"products = [\n    (\"Creality Ender 3 V2\", 249.99, 100, \"The Creality Ender 3 V2 is a popular and reliable 3D printer known for its excellent print quality. It features a glass bed for better adhesion and easy removal of prints.\"),\n    (\"Anycubic i3 Mega\", 299.99, 75, \"The Anycubic i3 Mega offers a user-friendly experience with a touchscreen interface and quick assembly. It produces high-quality prints and has a sturdy frame for stability.\"),\n    (\"Prusa i3 MK3S+\", 999.99, 30, \"The Prusa i3 MK3S+ is a premium 3D printer that combines advanced features with exceptional reliability. It includes automatic bed leveling and a removable magnetic bed for easy print removal.\"),\n    (\"Artillery Sidewinder X1\", 499.99, 50, \"The Artillery Sidewinder X1 boasts a large build volume and a direct drive extruder for flexible filament compatibility. Its quiet operation and touchscreen interface make it user-friendly.\"),\n    (\"Monoprice Select Mini V2\", 199.99, 80, \"The Monoprice Select Mini V2 is an affordable entry-level 3D printer that comes fully assembled. It's compact and features a heated bed for better print adhesion.\"),\n    (\"Elegoo Mars 2 Pro\", 299.99, 40, \"The Elegoo Mars 2 Pro is a resin 3D printer that delivers high-resolution prints with incredible detail. It features a monochrome LCD screen for faster curing times.\"),\n    (\"FlashForge Creator Pro\", 599.99, 25, \"The FlashForge Creator Pro is a versatile 3D printer that supports multiple filament types. Its dual extrusion capability allows for complex prints with multiple colors.\"),\n    (\"Raise3D E2\", 1,799.99, 20, \"The Raise3D E2 is a professional-grade 3D printer designed for reliability and precision. It features a fully enclosed build chamber for better temperature control.\"),\n    (\"Anycubic Photon Mono\", 249.99, 60, \"The Anycubic Photon Mono is a compact resin printer that offers fast printing speeds and high detail. Its user-friendly interface makes it suitable for both beginners and experienced users.\"),\n    (\"Dremel DigiLab 3D45\", 1,499.99, 15, \"The Dremel DigiLab 3D45 is an advanced 3D printer that supports a variety of materials, including nylon and eco-ABS. Its built-in camera allows for remote monitoring of prints.\"),\n    (\"LulzBot Mini 2\", 1,199.99, 35, \"The LulzBot Mini 2 is a compact and reliable 3D printer designed for ease of use. It features automatic bed leveling and a wide range of compatible filaments.\"),\n    (\"Anycubic Chiron\", 499.99, 20, \"The Anycubic Chiron offers a massive build volume for large projects. It features a touchscreen interface and a sturdy frame for stability during printing.\"),\n    (\"Monoprice Maker Select Plus\", 299.99, 45, \"The Monoprice Maker Select Plus is a versatile 3D printer with a large build area. It is known for its ease of use and excellent print quality.\"),\n    (\"SainSmart Ender 3\", 219.99, 55, \"The SainSmart Ender 3 is an affordable 3D printer that delivers great performance. It features a heated bed and a large community for support and upgrades.\"),\n    (\"Zortrax M200 Plus\", 1,899.99, 10, \"The Zortrax M200 Plus is a professional-grade 3D printer that offers high precision and reliability. It features a closed chamber for consistent printing conditions.\"),\n    (\"Artillery Genius\", 349.99, 40, \"The Artillery Genius is a compact 3D printer that offers great print quality and a direct drive extruder. Its silent stepper drivers ensure quiet operation.\"),\n    (\"Anycubic Kobra\", 299.99, 50, \"The Anycubic Kobra is an easy-to-use 3D printer with automatic bed leveling. It features a large build volume and a user-friendly interface.\"),\n    (\"Creality CR-10 V3\", 499.99, 30, \"The Creality CR-10 V3 is known for its large build volume and excellent print quality. It features a silent motherboard and a flexible print bed.\"),\n    (\"Elegoo Neptune 2\", 199.99, 70, \"The Elegoo Neptune 2 is an affordable 3D printer that offers a great balance of quality and performance. It features a heated bed and is easy to assemble.\"),\n    (\"Raise3D Pro2\", 3,999.99, 5, \"The Raise3D Pro2 is a high-end 3D printer designed for professional use. It features dual extrusion and a fully enclosed build chamber for optimal printing conditions.\"),\n    (\"FlashForge Adventurer 3\", 399.99, 50, \"The FlashForge Adventurer 3 is a user-friendly 3D printer with a removable nozzle for easy maintenance. It features a built-in camera for remote monitoring.\"),\n    (\"Wanhao Duplicator i3 Plus\", 299.99, 35, \"The Wanhao Duplicator i3 Plus is a reliable 3D printer that offers great print quality. It features a large build volume and a heated bed for better adhesion.\"),\n    (\"Photon Mono X\", 599.99, 20, \"The Photon Mono X is a large-format resin printer that delivers high-resolution prints quickly. Its monochrome screen allows for faster curing times and longer lifespan.\"),\n    (\"Anycubic Mega-S\", 259.99, 60, \"The Anycubic Mega-S is an upgraded version of the popular Mega series, offering improved stability and print quality. It features a large build volume and a user-friendly interface.\"),\n    (\"Creality Ender 5\", 399.99, 40, \"The Creality Ender 5 features a unique cube design that enhances stability during printing. It offers a large build volume and is easy to assemble.\"),\n    (\"Monoprice Mini Delta\", 199.99, 50, \"The Monoprice Mini Delta is a compact 3D printer that offers a unique delta design for faster printing. It's perfect for beginners and small projects.\"),\n    (\"Dremel 3D40\", 799.99, 25, \"The Dremel 3D40 is a versatile 3D printer that supports a variety of materials. Its intuitive software and built-in camera make it easy to use.\"),\n    (\"Artillery Sidewinder X2\", 549.99, 20, \"The Artillery Sidewinder X2 offers a large build volume and improved features over its predecessor. It includes a direct drive extruder for better filament handling.\"),\n    (\"Elegoo Saturn\", 499.99, 15, \"The Elegoo Saturn is a large resin printer that delivers high-quality prints with incredible detail. It features a monochrome LCD for faster curing times.\"),\n    (\"Creality CR-6 SE\", 399.99, 50, \"The Creality CR-6 SE is known for its innovative features like automatic bed leveling and a modular design. It offers excellent print quality and is user-friendly.\"),\n    (\"Anycubic Photon S\", 249.99, 40, \"The Anycubic Photon S is a popular resin printer that delivers high-resolution prints. Its user-friendly interface makes it suitable for beginners.\"),\n    (\"FlashForge Dreamer\", 699.99, 15, \"The FlashForge Dreamer is a dual extrusion 3D printer that allows for complex designs with multiple colors. It features a fully enclosed build area for safety.\"),\n    (\"LulzBot TAZ Workhorse\", 2,499.99, 10, \"The LulzBot TAZ Workhorse is a professional-grade printer with a large build area and high reliability. It features automatic bed leveling and a wide range of filament compatibility.\"),\n    (\"Monoprice Select Mini Pro\", 249.99, 30, \"The Monoprice Select Mini Pro is an upgraded version of the Select Mini, offering better performance and features. It comes fully assembled and is perfect for beginners.\"),\n    (\"Raise3D E2CF\", 1,899.99, 15, \"The Raise3D E2CF is designed for advanced users, capable of printing with composite materials. It features a fully enclosed build chamber and dual extrusion capabilities.\"),\n    (\"Creality Ender 3 Pro\", 279.99, 50, \"The Creality Ender 3 Pro is an upgraded version of the popular Ender 3, featuring a magnetic build surface and improved stability. It offers excellent print quality and a large community for support.\"),\n    (\"Artillery Hornet\", 279.99, 45, \"The Artillery Hornet is a compact 3D printer that offers great performance in a small package. It features a direct drive extruder and a silent operation.\"),\n    (\"Anycubic Vyper\", 349.99, 30, \"The Anycubic Vyper is a feature-rich 3D printer with automatic bed leveling and a large build volume. Its user-friendly interface makes it ideal for both beginners and experts.\"),\n    (\"Elegoo Mars 3\", 299.99, 20, \"The Elegoo Mars 3 is a high-resolution resin printer that delivers incredible detail in prints. Its user-friendly software makes it easy to operate.\"),\n    (\"Monoprice Maker Pro\", 499.99, 25, \"The Monoprice Maker Pro is a versatile 3D printer that supports multiple filament types. It features a large build area and a heated bed for better adhesion.\"),\n    (\"FlashForge Inventor II\", 599.99, 15, \"The FlashForge Inventor II is an easy-to-use 3D printer with a fully enclosed build area. It features a dual extrusion system for complex prints.\"),\n    (\"Creality CR-10 Smart\", 499.99, 20, \"The Creality CR-10 Smart is a large-format 3D printer that offers smart features like remote monitoring. It provides excellent print quality and a user-friendly setup.\"),\n    (\"Anycubic Photon Mono SE\", 299.99, 25, \"The Anycubic Photon Mono SE is a high-speed resin printer that offers superior detail and faster printing times. Its monochrome LCD screen enhances durability.\"),\n    (\"Artillery Sidewinder X1 Pro\", 599.99, 10, \"The Artillery Sidewinder X1 Pro is an upgraded version of the popular model with enhanced features. It includes a direct drive extruder and a large build volume.\"),\n    (\"Dremel 3D40 Flex\", 899.99, 5, \"The Dremel 3D40 Flex is a versatile 3D printer that supports a wide range of materials. Its intuitive software and flexible design make it user-friendly.\"),\n    (\"Anycubic Kobra Plus\", 349.99, 30, \"The Anycubic Kobra Plus features a large build volume and automatic bed leveling for ease of use. It's suitable for both beginners and experienced users.\"),\n    (\"FlashForge Guider II\", 799.99, 10, \"The FlashForge Guider II is a professional-grade 3D printer designed for large projects. It features a fully enclosed build chamber and a user-friendly interface.\"),\n    (\"Monoprice Voxel\", 349.99, 25, \"The Monoprice Voxel is an easy-to-use 3D printer with a fully enclosed build area. Its touchscreen interface and automatic bed leveling make it beginner-friendly.\"),\n    (\"Creality Ender 3 S1\", 399.99, 40, \"The Creality Ender 3 S1 combines affordability with advanced features like a direct drive extruder and automatic bed leveling. It offers excellent print quality.\"),\n    (\"Raise3D Pro3\", 3,499.99, 5, \"The Raise3D Pro3 is a high-end 3D printer designed for professional applications. It features dual extrusion and a large build volume for complex projects.\"),\n    (\"Elegoo Mars 2 Ultra\", 349.99, 15, \"The Elegoo Mars 2 Ultra is a resin printer that delivers high-quality prints with exceptional detail. Its user-friendly interface makes it easy to operate.\"),\n    (\"Anycubic Mega X\", 299.99, 20, \"The Anycubic Mega X offers a large build volume and easy assembly. It features a heated bed and a user-friendly touchscreen interface.\"),\n    (\"FlashForge Creator 3\", 1,599.99, 10, \"The FlashForge Creator 3 is a professional dual extrusion 3D printer that allows for complex designs. It features a large build area and high reliability.\"),\n    (\"Monoprice Select Mini V3\", 199.99, 50, \"The Monoprice Select Mini V3 is a compact and affordable 3D printer perfect for beginners. It comes fully assembled and is easy to use.\"),\n    (\"Creality CR-10 V2\", 399.99, 30, \"The Creality CR-10 V2 is known for its large build volume and excellent print quality. It features a glass bed for better adhesion and easy print removal.\"),\n    (\"Artillery Genius Pro\", 399.99, 20, \"The Artillery Genius Pro is a compact 3D printer that offers advanced features like silent stepper drivers and a direct drive extruder. It's perfect for home use.\"),\n    (\"Raise3D E2 Lite\", 1,299.99, 10, \"The Raise3D E2 Lite is a reliable and user-friendly 3D printer designed for professionals. It features a fully enclosed build chamber and advanced printing capabilities.\"),\n    (\"Anycubic Photon Mono X 4K\", 599.99, 5, \"The Anycubic Photon Mono X 4K offers exceptional detail and a large build volume for resin printing. Its monochrome screen provides faster curing times.\"),\n    (\"FlashForge Adventurer 4\", 499.99, 15, \"The FlashForge Adventurer 4 is a versatile 3D printer with a removable nozzle for easy maintenance. It features a large build volume and a user-friendly interface.\"),\n    (\"Monoprice Maker Select Plus V2\", 299.99, 25, \"The Monoprice Maker Select Plus V2 is an upgraded version of the popular Maker Select series. It offers a large build area and excellent print quality.\"),\n    (\"Creality Ender 3 V2 Neo\", 269.99, 30, \"The Creality Ender 3 V2 Neo is an enhanced version of the Ender 3 V2 with improved features. It offers great print quality and user-friendly operation.\"),\n    (\"Anycubic Chiron Pro\", 499.99, 10, \"The Anycubic Chiron Pro is designed for large-scale projects with its massive build volume. It features a sturdy frame and excellent print quality.\"),\n    (\"Artillery Sidewinder X1 Plus\", 599.99, 10, \"The Artillery Sidewinder X1 Plus offers enhanced features over its predecessor, including a direct drive extruder and improved stability. It's suitable for both beginners and experts.\"),\n    (\"Elegoo Mars 3 Pro\", 349.99, 15, \"The Elegoo Mars 3 Pro is a high-resolution resin printer with a user-friendly interface. It delivers exceptional detail and is perfect for intricate designs.\"),\n    (\"FlashForge Inventor 3\", 499.99, 10, \"The FlashForge Inventor 3 is an upgraded version of the popular Inventor series, featuring a dual extrusion system and a fully enclosed build area.\"),\n    (\"Monoprice Voxel Pro\", 399.99, 20, \"The Monoprice Voxel Pro is an easy-to-use 3D printer with a large build area. Its touchscreen interface and automatic bed leveling make it beginner-friendly.\"),\n    (\"Creality CR-6 SE Plus\", 499.99, 15, \"The Creality CR-6 SE Plus features a large build volume and advanced features like automatic bed leveling. It's designed for both beginners and experienced users.\"),\n    (\"Raise3D E2CF Pro\", 1,899.99, 5, \"The Raise3D E2CF Pro is designed for advanced users and supports composite materials. It features a fully enclosed build chamber for optimal printing conditions.\"),\n    (\"Anycubic Mega Zero 2.0\", 219.99, 30, \"The Anycubic Mega Zero 2.0 is an affordable 3D printer that offers great performance and print quality. It's easy to assemble and suitable for beginners.\"),\n    (\"FlashForge Creator Pro 2\", 699.99, 10, \"The FlashForge Creator Pro 2 is a dual extrusion 3D printer that allows for complex designs. It features a large build area and high reliability.\"),\n    (\"Monoprice Select Mini V4\", 199.99, 50, \"The Monoprice Select Mini V4 is a compact 3D printer perfect for beginners. It comes fully assembled and is easy to operate.\"),\n    (\"Creality Ender 5 Plus\", 499.99, 20, \"The Creality Ender 5 Plus features a large build volume and improved stability. It offers excellent print quality and is user-friendly.\"),\n    (\"Artillery Hornet Pro\", 299.99, 25, \"The Artillery Hornet Pro is a compact 3D printer that delivers great performance in a small package. It features a direct drive extruder and a silent operation.\"),\n    (\"Anycubic Vyper Pro\", 349.99, 30, \"The Anycubic Vyper Pro is a feature-rich 3D printer with automatic bed leveling and a large build volume. Its user-friendly interface makes it ideal for both beginners and experts.\"),\n    (\"Elegoo Mars 2 Pro SE\", 299.99, 15, \"The Elegoo Mars 2 Pro SE is a high-resolution resin printer that delivers incredible detail in prints. Its user-friendly software makes it easy to operate.\"),\n    (\"FlashForge Guider II Plus\", 899.99, 5, \"The FlashForge Guider II Plus is a professional-grade 3D printer designed for large projects. It features a fully enclosed build chamber and a user-friendly interface.\"),\n    (\"Monoprice Maker Pro V2\", 499.99, 20, \"The Monoprice Maker Pro V2 is a versatile 3D printer that supports multiple filament types. It features a large build area and a heated bed for better adhesion.\"),\n    (\"Creality CR-10 Smart Pro\", 599.99, 10, \"The Creality CR-10 Smart Pro is a large-format 3D printer that offers smart features like remote monitoring. It provides excellent print quality and a user-friendly setup.\"),\n    (\"Raise3D Pro3 Plus\", 3,999.99, 5, \"The Raise3D Pro3 Plus is a high-end 3D printer designed for professional applications. It features dual extrusion and a large build volume for complex projects.\"),\n    (\"Anycubic Photon Mono X 4K SE\", 649.99, 5, \"The Anycubic Photon Mono X 4K SE offers exceptional detail and a large build volume for resin printing. Its monochrome screen provides faster curing times.\"),\n    (\"FlashForge Adventurer 4 Plus\", 599.99, 10, \"The FlashForge Adventurer 4 Plus is a versatile 3D printer with a removable nozzle for easy maintenance. It features a large build volume and a user-friendly interface.\"),\n]"