"[(\"Catan\", 49.99, 30, \"A popular strategy board game where players collect resources and build settlements. The game involves trading and negotiation, making every session unique.\"), \n(\"Ticket to Ride\", 39.99, 25, \"An exciting game of strategy and adventure where players build train routes across the country. It’s easy to learn and offers endless fun for families and friends.\"), \n(\"Pandemic\", 44.99, 20, \"A cooperative board game where players work together to stop global outbreaks of diseases. Each player takes on a unique role, adding strategic depth to the game.\"), \n(\"Carcassonne\", 34.99, 40, \"A tile-placement game where players build cities, roads, and fields in the French landscape. The game is simple to learn but offers deep strategic gameplay.\"), \n(\"7 Wonders\", 49.99, 15, \"A card drafting game that allows players to build their civilization over three ages. It combines resource management and strategic planning in a unique way.\"), \n(\"Splendor\", 39.99, 35, \"A fast-paced game where players collect gems to purchase development cards and earn points. The game is easy to learn and offers a satisfying strategic experience.\"), \n(\"Azul\", 29.99, 50, \"A beautiful tile-laying game where players compete to create the most stunning mosaic. It combines strategy and aesthetics, making it a favorite among gamers.\"), \n(\"Dominion\", 44.99, 10, \"A deck-building game where players compete to create the most efficient kingdom. With numerous expansions available, it offers endless replayability.\"), \n(\"Codenames\", 24.99, 45, \"A word-based party game where players work in teams to identify their agents based on clever clues. It's a game of deduction and teamwork.\"), \n(\"Risk\", 39.99, 20, \"A classic game of global domination where players strategize to conquer territories. It’s a thrilling game of chance and strategy.\"), \n(\"Clue\", 29.99, 30, \"A murder mystery game where players must deduce who committed the crime, with what weapon, and in which room. It’s a blend of strategy and deduction.\"), \n(\"Dixit\", 34.99, 25, \"A storytelling game featuring beautifully illustrated cards. Players use their imagination to interpret and convey their thoughts through creative clues.\"), \n(\"Gloomhaven\", 139.99, 5, \"A cooperative campaign-driven game set in a dark fantasy world. Players take on the role of mercenaries, making choices that affect the story.\"), \n(\"Terraforming Mars\", 59.99, 15, \"A strategy game where players work to terraform the planet Mars. The game involves resource management and strategic planning to achieve victory.\"), \n(\"King of Tokyo\", 39.99, 30, \"A dice game where players compete as monsters to conquer Tokyo. It’s a fun mix of luck and strategy, perfect for family game night.\"), \n(\"The Settlers of Catan: Seafarers\", 54.99, 10, \"An expansion to the classic Catan game that introduces ships and new scenarios. This adds depth and variety to the base game.\"), \n(\"Patchwork\", 29.99, 40, \"A two-player game where players compete to build the most aesthetic quilt. It combines strategy and creativity in a compact format.\"), \n(\"Machi Koro\", 29.99, 50, \"A fast-paced city-building game where players develop their own towns. It’s simple to learn and offers strategic depth.\"), \n(\"Wingspan\", 59.99, 15, \"A beautifully illustrated game about bird conservation. Players attract birds to their wildlife preserves while managing resources.\"), \n(\"Small World\", 49.99, 20, \"A civilization-building game where players control fantasy races to conquer a world that is too small for them. It’s fun and filled with strategic opportunities.\"), \n(\"Sushi Go!\", 19.99, 60, \"A quick card game where players draft sushi dishes to create the best meal. It’s light-hearted and perfect for casual gaming.\"), \n(\"Betrayal at House on the Hill\", 49.99, 10, \"A horror-themed game where players explore a haunted mansion. The game shifts from cooperative to competitive as one player becomes the traitor.\"), \n(\"Kingdomino\", 34.99, 45, \"A domino-style game where players build their kingdoms by connecting tiles. It’s easy to learn and offers strategic depth.\"), \n(\"Telestrations\", 29.99, 25, \"A hilarious drawing and guessing game that’s perfect for parties. It combines elements of Pictionary and Telephone for endless fun.\"), \n(\"Coup\", 14.99, 70, \"A quick bluffing game where players compete to eliminate each other's influence. It’s fast-paced and filled with deception.\"), \n(\"Blokus\", 29.99, 50, \"A strategic board game where players place colored pieces on the board to block opponents. It’s simple to learn but offers deep strategy.\"), \n(\"Quirkle\", 29.99, 40, \"A tile-based game that combines colors and shapes for strategic scoring. It’s easy to learn and great for players of all ages.\"), \n(\"The Resistance\", 24.99, 35, \"A social deduction game where players are either members of the resistance or spies. It’s all about bluffing and teamwork.\"), \n(\"Scythe\", 79.99, 10, \"A strategy game set in an alternate-history 1920s Europe. Players build their empire through resource management and combat.\"), \n(\"Catan: Cities & Knights\", 44.99, 15, \"An expansion to Catan that introduces new mechanics and challenges. Players must defend their settlements while expanding their empires.\"), \n(\"Love Letter\", 14.99, 80, \"A quick card game of risk and deduction where players try to deliver a love letter to the princess. It's simple yet engaging.\"), \n(\"RoboRally\", 39.99, 20, \"A programming game where players control robots racing through a factory. It’s filled with chaos and strategic movement.\"), \n(\"Caverna\", 59.99, 10, \"A worker placement game where players build and manage a farm in a cave. It offers deep strategic gameplay with multiple paths to victory.\"), \n(\"Tigris & Euphrates\", 44.99, 15, \"A strategy board game set in ancient Mesopotamia. Players build civilizations while managing conflicts and resources.\"), \n(\"Formula D\", 49.99, 10, \"A high-stakes racing game where players compete on various tracks. It combines strategy and luck for a thrilling experience.\"), \n(\"Arkham Horror\", 59.99, 5, \"A cooperative game set in H.P. Lovecraft's universe where players fight against ancient evils. It’s rich in storytelling and atmosphere.\"), \n(\"Cosmic Encounter\", 49.99, 15, \"A space-themed game of negotiation and strategy where players control different alien races. Each race has unique powers, adding variety to gameplay.\"), \n(\"Blood Rage\", 69.99, 10, \"A Viking-themed strategy game where players fight for glory before Ragnarok. The game combines area control and card drafting.\"), \n(\"Gloom\", 24.99, 50, \"A storytelling game where players try to make their characters suffer the most before they die. It’s darkly humorous and offers unique gameplay.\"), \n(\"Lords of Waterdeep\", 49.99, 20, \"A worker placement game set in the Dungeons & Dragons universe. Players recruit adventurers to complete quests and earn points.\"), \n(\"The Game\", 14.99, 70, \"A cooperative card game where players work together to play cards in ascending and descending order. It’s simple but requires teamwork.\"), \n(\"Tokaido\", 39.99, 30, \"A peaceful board game where players travel along the East Sea Road in Japan. It’s about experiencing the journey rather than competing.\"), \n(\"Catan: Traders & Barbarians\", 44.99, 15, \"An expansion for Catan that adds new scenarios and challenges. Players must navigate trade routes and fend off barbarian threats.\"), \n(\"Mysterium\", 49.99, 10, \"A cooperative game where players act as psychics trying to solve a murder mystery. One player acts as the ghost, providing clues through illustrated cards.\"), \n(\"Takenoko\", 39.99, 25, \"A delightful game where players cultivate a bamboo garden for a hungry panda. It combines strategy and beautiful artwork.\"), \n(\"Parks\", 49.99, 15, \"A card-driven game that celebrates national parks in the USA. Players hike through trails, collect memories, and enjoy the scenery.\"), \n(\"Viticulture\", 59.99, 10, \"A worker placement game about running a vineyard in Italy. Players must manage resources to produce the best wine.\"), \n(\"Kingdom Builder\", 39.99, 25, \"A strategy game where players build their kingdoms using various terrain types. It’s easy to learn but offers strategic depth.\"), \n(\"Fireball Island\", 49.99, 15, \"A 3D adventure game where players navigate a dangerous island while avoiding fireballs. It’s filled with excitement and nostalgia.\"), \n(\"The Mind\", 14.99, 80, \"A cooperative card game where players must play cards in ascending order without communicating. It’s a test of intuition and teamwork.\"), \n(\"Just One\", 29.99, 40, \"A cooperative party game where players give one-word clues to help their teammates guess a secret word. It’s simple yet highly engaging.\"), \n(\"Catan: Explorers & Pirates\", 54.99, 10, \"An expansion for Catan that introduces new gameplay elements like exploration and piracy. It adds depth and variety to the base game.\"), \n(\"Hansa Teutonica\", 49.99, 15, \"A strategy game set in medieval trade routes where players compete to establish trading posts. It’s all about resource management and strategic planning.\"), \n(\"Sagrada\", 39.99, 30, \"A dice-drafting game where players create beautiful stained glass windows. It combines strategy with a visually stunning design.\"), \n(\"Raptor\", 34.99, 25, \"A two-player game where one player controls a mother dinosaur and her babies while the other player is a scientist trying to capture them. It’s a unique asymmetrical game.\"), \n(\"Coup: Rebellion G54\", 14.99, 70, \"A stand-alone version of Coup set in a dystopian future. Players bluff and strategize to eliminate their opponents.\"), \n(\"Everdell\", 59.99, 10, \"A beautiful worker placement game set in a woodland village. Players build their city and gather resources throughout the seasons.\"), \n(\"Boggle\", 19.99, 60, \"A classic word game where players find words in a grid of letters. It’s fast-paced and perfect for word enthusiasts.\"), \n(\"Star Realms\", 39.99, 20, \"A deck-building game set in space where players compete to build powerful ships and bases. It’s strategic and quick to play.\"), \n(\"Funkoverse\", 39.99, 30, \"A strategy game featuring beloved Funko Pop characters. Players engage in tactical battles across various scenarios.\"), \n(\"Catan: 3-4 Player Extension\", 19.99, 50, \"An expansion that allows more players to join the classic Catan experience. It enhances social interaction and competition.\"), \n(\"Tigris & Euphrates: The Board Game\", 44.99, 15, \"A strategy game that explores the rise and fall of civilizations. Players must manage resources and conflicts to succeed.\"), \n(\"Spyfall\", 24.99, 45, \"A social deduction game where players must discover the spy among them. It’s filled with laughter and intrigue.\"), \n(\"The Crew\", 14.99, 70, \"A cooperative trick-taking game where players work together to complete missions in space. It requires communication and strategy.\"), \n(\"Orleans\", 49.99, 20, \"A bag-building game set in medieval France where players gather resources and develop their towns. It’s strategic and engaging.\"), \n(\"Catan: Cities & Knights Expansion\", 44.99, 15, \"An expansion that adds new challenges and mechanics to the classic Catan game. Players must defend against barbarian attacks while expanding their cities.\"), \n(\"Rococo\", 49.99, 10, \"A strategy game about managing a tailor shop in 18th century France. Players design dresses and organize balls to earn prestige.\"), \n(\"Fiasco\", 34.99, 25, \"A role-playing game that focuses on creating and playing through a heist gone wrong. It’s all about storytelling and humor.\"), \n(\"Eclipse\", 59.99, 10, \"A space exploration game where players expand their civilizations and engage in epic battles. It offers deep strategy and complexity.\"), \n(\"Wavelength\", 29.99, 40, \"A social guessing game where players must communicate their thoughts on a spectrum. It’s great for parties and gatherings.\"), \n(\"Tammany Hall\", 44.99, 15, \"A strategy game set in 19th century New York where players vie for political control. It’s filled with negotiation and strategy.\"), \n(\"Gem Rush\", 19.99, 50, \"A fast-paced card game where players collect gems while avoiding pitfalls. It’s simple and quick to play.\"), \n(\"The Fox in the Forest\", 19.99, 60, \"A two-player trick-taking game with a fairy tale theme. It’s designed specifically for two players, offering unique gameplay.\"), \n(\"Chai\", 39.99, 25, \"A tea-themed game where players run their own tea shop. It combines resource management with a charming theme.\"), \n(\"Dead of Winter\", 59.99, 10, \"A cooperative game set in a zombie apocalypse where players must survive and complete objectives. It’s filled with tension and moral dilemmas.\"), \n(\"The Quacks of Quedlinburg\", 39.99, 20, \"A push-your-luck game where players create potions in a fantastical setting. It’s colorful and offers a unique blend of strategy and luck.\"), \n(\"Onitama\", 29.99, 50, \"A two-player abstract strategy game that combines chess-like mechanics with simplicity. It’s quick to learn and offers deep tactical gameplay.\"), \n(\"The Great Dalmuti\", 19.99, 60, \"A fun card game of social hierarchy where players try to become the Great Dalmuti. It’s light-hearted and perfect for gatherings.\"), \n(\"Paladins of the West Kingdom\", 49.99, 15, \"A worker placement game set in the Carolingian Empire where players build their influence. It’s rich in strategy and historical themes.\"), \n(\"Sushi Go Party!\", 24.99, 35, \"An expanded version of Sushi Go! that allows for more players and additional cards. It enhances the fun and variety of the original game.\"), \n(\"Catan: Traders & Barbarians Expansion\", 44.99, 15, \"An expansion that introduces new scenarios and challenges to the classic Catan experience. It adds depth and variety.\"), \n(\"The Isle of Cats\", 49.99, 10, \"A tile-laying game where players rescue cats from an island. It combines strategy with a charming theme.\"), \n(\"Rising Sun\", 79.99, 5, \"A strategy game set in feudal Japan where players negotiate and battle for control. It’s rich in theme and strategic depth.\"), \n(\"Codenames: XXL\", 29.99, 30, \"A larger version of the popular word game, perfect for bigger groups. It retains the fun and challenge of the original.\"), \n(\"The Manhattan Project\", 49.99, 20, \"A strategy game about building atomic bombs during the Cold War. Players manage resources and compete for scientific advancements.\"), \n(\"Fabled Fruit\", 34.99, 25, \"A unique, evolving game where players collect fruits to make smoothies. It’s a fun and engaging experience that changes over time.\"), \n(\"Raptor: The Board Game\", 34.99, 25, \"An asymmetrical game where one player controls a mother dinosaur and her hatchlings. The other player is a scientist trying to capture them.\"), \n(\"The Estates\", 49.99, 10, \"A strategic auction game where players build and manipulate a cityscape. It’s filled with intrigue and competition.\"), \n(\"Mosaic\", 39.99, 30, \"A civilization-building game where players develop their own cultures. It combines strategy and historical themes.\"), \n(\"Sagrada: 5-6 Player Expansion\", 19.99, 50, \"An expansion for Sagrada that allows for more players to join the fun. It adds new dynamics to the original game.\"), \n(\"Rising Sun: Clan Expansion\", 39.99, 20, \"An expansion that introduces new clans and mechanics to Rising Sun. It enhances the strategic depth and variety.\"), \n(\"Carcassonne: Expansion 1\", 29.99, 40, \"An expansion that adds new tiles and features to the classic Carcassonne game. It increases the variety and strategic options.\"), \n(\"Pandemic: Legacy Season 1\", 69.99, 10, \"A cooperative legacy game that evolves over time as players face global outbreaks. It’s a thrilling and immersive experience.\"), \n(\"Terraforming Mars: Prelude\", 19.99, 50, \"An expansion that adds new starting corporations and cards to Terraforming Mars. It enhances the strategic options from the start.\"), \n(\"Catan: 5-6 Player Extension\", 19.99, 50, \"An extension that allows more players to join the classic Catan game. It increases social interaction and competition.\"), \n(\"The Crew: Mission Deep Sea\", 14.99, 70, \"A sequel to The Crew that introduces new missions and challenges. It’s a cooperative game that requires teamwork and strategy.\"), \n(\"Wingspan: European Expansion\", 19.99, 50, \"An expansion that adds new birds and mechanics to the popular game Wingspan. It enhances the variety and gameplay.\"), \n(\"The King’s Dilemma\", 49.99, 20, \"A narrative-driven game where players make decisions that affect the kingdom. It’s filled with moral dilemmas and storytelling.\"), \n(\"Dungeons & Dragons: Dungeon Master's Guide\", 49.99, 10, \"An essential guide for Dungeon Masters in the Dungeons & Dragons RPG. It provides tools and advice for creating immersive adventures.\"), \n(\"Machi Koro: Legacy\", 49.99, 10, \"A legacy version of the popular city-building game Machi Koro. It evolves over time, creating a unique experience.\"), \n(\"The Fox in the Forest Duet\", 19.99, 60, \"A cooperative two-player version of The Fox in the Forest. Players work together to collect gems while avoiding pitfalls.\"), \n(\"Taverns of Tiefenthal\", 49.99, 15, \"A deck-building game where players manage a tavern in a medieval setting. It combines strategy and resource management.\"), \n(\"The Red Cathedral\", 39.99, 30, \"A strategy game about building a cathedral in Renaissance Russia. Players must manage resources and workers effectively.\"), \n(\"Parks: Expansion\", 19.99, 50, \"An expansion that adds new trails and parks to the original Parks game. It enhances the exploration and gameplay.\"), \n(\"The Game: Face to Face\", 24.99, 45, \"A two-player version of the cooperative card game The Game. It offers a new twist on the original mechanics.\"), \n(\"Catan: Expansion Pack\", 19.99, 50, \"An expansion pack that adds new scenarios and challenges to the classic Catan game. It increases variety and replayability.\"), \n(\"The Great Western Trail\", 49.99, 20, \"A strategy game where players drive cattle across the American frontier. It combines resource management and strategic planning.\"), \n(\"The Quacks of Quedlinburg: The Herb Witches\", 19.99, 50, \"An expansion that introduces new ingredients and mechanics to the base game. It adds depth and variety to the potion-making experience.\"), \n(\"The Magnificent\", 49.99, 15, \"A strategy game about building a traveling show in the 19th century. Players must manage resources and performances effectively.\"), \n(\"Codenames: XXL Edition\", 29.99, 30, \"An oversized edition of the popular word game, perfect for larger groups. It retains the fun and challenge of the original.\"), \n(\"The Isle of Cats: Late Arrivals\", 19.99, 50, \"An expansion that adds new cats and mechanics to The Isle of Cats. It enhances the gameplay and variety.\"), \n(\"The Crew: The Quest for Planet Nine\", 14.99, 70, \"A cooperative trick-taking game that requires teamwork and strategy. It’s filled with challenges and missions.\"), \n(\"The King’s Dilemma: Legacy\", 49.99, 10, \"A legacy version of The King’s Dilemma that evolves over time. Players make decisions that shape the kingdom’s future.\"), \n(\"Taverns of Tiefenthal: The Expansion\", 19.99, 50, \"An expansion that adds new mechanics and features to the original tavern management game. It enhances the gameplay experience.\"), \n(\"The Red Cathedral: Expansion\", 19.99, 50, \"An expansion that introduces new buildings and mechanics to The Red Cathedral. It adds depth and variety to the original game.\"), \n(\"The Fox in the Forest: The Expansion\", 19.99, 50, \"An expansion that adds new cards and mechanics to the original two-player game. It enhances the gameplay experience.\"), \n(\"The Quacks of Quedlinburg: The Herb Witches Expansion\", 19.99, 50, \"An expansion that introduces new ingredients and mechanics to The Quacks of Quedlinburg. It adds depth and variety to the potion-making experience.\")]"