"[(\"The Great Gatsby\", 10.99, 25, \"A classic novel by F. Scott Fitzgerald that explores themes of wealth, love, and the American Dream. Its rich characters and poetic prose make it a timeless read.\"), \n(\"To Kill a Mockingbird\", 12.99, 30, \"Harper Lee's Pulitzer Prize-winning novel addresses serious issues like racial injustice through the eyes of a child. It's a poignant tale of empathy and moral growth.\"), \n(\"1984\", 14.99, 40, \"George Orwell's dystopian novel paints a chilling picture of totalitarianism and surveillance. It's a powerful warning about the dangers of oppressive governments.\"), \n(\"Pride and Prejudice\", 9.99, 35, \"Jane Austen's beloved novel satirizes the British class system and explores themes of love and social standing. Its witty dialogue and memorable characters make it a joy to read.\"), \n(\"The Catcher in the Rye\", 13.50, 20, \"J.D. Salinger's iconic coming-of-age story follows Holden Caulfield as he navigates the struggles of adolescence. It's a raw and honest exploration of teenage angst.\"), \n(\"Moby Dick\", 15.99, 15, \"Herman Melville's epic tale of obsession and revenge centers around Captain Ahab's pursuit of the elusive white whale. Its rich symbolism and complex themes offer much to ponder.\"), \n(\"Brave New World\", 11.99, 22, \"Aldous Huxley's novel presents a futuristic society driven by technology and consumerism. It raises questions about individuality and the cost of progress.\"), \n(\"The Alchemist\", 16.99, 18, \"Paulo Coelho's philosophical novel follows a shepherd's journey to discover his personal legend. It's a tale of dreams, destiny, and the importance of listening to one's heart.\"), \n(\"The Hobbit\", 10.50, 50, \"J.R.R. Tolkien's enchanting tale follows Bilbo Baggins on an unexpected adventure with dwarves and dragons. It's a delightful introduction to the world of Middle-earth.\"), \n(\"Harry Potter and the Sorcerer's Stone\", 12.99, 45, \"J.K. Rowling's magical story introduces us to a young wizard's first year at Hogwarts. It's a captivating blend of friendship, adventure, and the battle between good and evil.\"), \n(\"The Diary of a Young Girl\", 8.99, 40, \"Anne Frank's poignant diary chronicles her life in hiding during World War II. Her reflections on hope and humanity resonate deeply.\"), \n(\"The Road\", 14.50, 10, \"Cormac McCarthy's haunting post-apocalyptic novel follows a father and son's struggle for survival. Its stark prose and emotional depth create a gripping experience.\"), \n(\"Fahrenheit 451\", 13.99, 25, \"Ray Bradbury's dystopian novel warns against censorship and the loss of individuality. It's a thought-provoking exploration of a future where books are banned.\"), \n(\"The Picture of Dorian Gray\", 11.50, 20, \"Oscar Wilde's novel delves into themes of vanity and moral corruption through the story of a man who remains youthful while his portrait ages. It's a compelling read.\"), \n(\"The Book Thief\", 12.50, 30, \"Markus Zusak's unique narrative follows a young girl in Nazi Germany who finds solace in stealing books. It's a powerful story about the impact of words and love in dark times.\"), \n(\"The Fault in Our Stars\", 9.99, 50, \"John Green's contemporary novel tells the love story of two teens with cancer. It's a poignant exploration of life, love, and the struggles of illness.\"), \n(\"The Hitchhiker's Guide to the Galaxy\", 10.99, 45, \"Douglas Adams' comedic sci-fi classic follows Arthur Dent on a wild intergalactic adventure. It's a hilarious take on the absurdities of life and the universe.\"), \n(\"The Chronicles of Narnia\", 19.99, 15, \"C.S. Lewis's beloved series transports readers to a magical land filled with talking animals and epic battles. It's a timeless tale of good versus evil.\"), \n(\"The Shining\", 14.99, 25, \"Stephen King's horror masterpiece follows a family in an isolated hotel haunted by supernatural forces. Its chilling atmosphere keeps readers on the edge of their seats.\"), \n(\"The Little Prince\", 7.99, 50, \"Antoine de Saint-Exupéry's enchanting tale explores themes of love and loss through the eyes of a young prince. It's a beautifully illustrated story for all ages.\"), \n(\"The Hunger Games\", 12.99, 40, \"Suzanne Collins' dystopian novel follows Katniss Everdeen as she fights for survival in a brutal competition. It's a gripping tale of courage and rebellion.\"), \n(\"The Perks of Being a Wallflower\", 11.99, 30, \"Stephen Chbosky's coming-of-age novel captures the highs and lows of adolescence through letters from a sensitive teen. It's a heartfelt exploration of friendship and self-discovery.\"), \n(\"Wuthering Heights\", 8.99, 20, \"Emily Brontë's dark and passionate tale of love and revenge unfolds on the Yorkshire moors. Its complex characters and haunting atmosphere make it a classic.\"), \n(\"The Grapes of Wrath\", 12.99, 15, \"John Steinbeck's powerful novel depicts the struggles of a family during the Great Depression. It's a poignant commentary on social injustice and resilience.\"), \n(\"The Handmaid's Tale\", 14.99, 10, \"Margaret Atwood's dystopian novel explores themes of power and gender in a totalitarian society. Its chilling narrative remains relevant in today's world.\"), \n(\"The Secret Garden\", 9.50, 30, \"Frances Hodgson Burnett's classic children's novel tells the story of a lonely girl who discovers a hidden garden. It's a heartwarming tale of healing and friendship.\"), \n(\"The Kite Runner\", 13.99, 20, \"Khaled Hosseini's poignant novel explores the bond between two boys in Afghanistan. It's a powerful story of redemption and the impact of the past.\"), \n(\"The Old Man and the Sea\", 11.50, 25, \"Ernest Hemingway's novella follows an aging fisherman on a relentless quest for a giant marlin. Its themes of perseverance and dignity resonate deeply.\"), \n(\"The Color Purple\", 12.50, 15, \"Alice Walker's Pulitzer Prize-winning novel tells the story of African American women in the early 20th century. It's a powerful exploration of race, gender, and resilience.\"), \n(\"The Bell Jar\", 10.99, 30, \"Sylvia Plath's semi-autobiographical novel delves into the struggles of mental illness and identity. Its haunting prose captures the complexities of the human experience.\"), \n(\"The Alchemist\", 16.99, 18, \"Paulo Coelho's philosophical novel follows a shepherd's journey to discover his personal legend. It's a tale of dreams, destiny, and the importance of listening to one's heart.\"), \n(\"The Road\", 14.50, 10, \"Cormac McCarthy's haunting post-apocalyptic novel follows a father and son's struggle for survival. Its stark prose and emotional depth create a gripping experience.\"), \n(\"The Night Circus\", 12.99, 25, \"Erin Morgenstern's enchanting novel weaves a tale of a magical competition between two young illusionists. Its lush imagery and intricate plot will captivate readers.\"), \n(\"The Time Traveler's Wife\", 14.99, 20, \"Audrey Niffenegger's unique love story follows a man with a genetic disorder that causes him to time travel unpredictably. It's a poignant exploration of love and loss.\"), \n(\"Gone with the Wind\", 15.99, 15, \"Margaret Mitchell's sweeping historical novel follows the tumultuous life of Scarlett O'Hara during the American Civil War. Its rich characters and epic scope make it unforgettable.\"), \n(\"The Immortal Life of Henrietta Lacks\", 13.50, 30, \"Rebecca Skloot's nonfiction narrative tells the story of Henrietta Lacks, whose cells were used for groundbreaking medical research without her knowledge. It's a powerful exploration of ethics and race.\"), \n(\"The Glass Castle\", 11.99, 25, \"Jeannette Walls' memoir recounts her unconventional upbringing in a dysfunctional family. It's a testament to resilience and the power of storytelling.\"), \n(\"The Fault in Our Stars\", 9.99, 50, \"John Green's contemporary novel tells the love story of two teens with cancer. It's a poignant exploration of life, love, and the struggles of illness.\"), \n(\"The 7 Habits of Highly Effective People\", 19.99, 22, \"Stephen R. Covey's self-help classic offers timeless principles for personal and professional effectiveness. It's a guide to achieving goals and improving relationships.\"), \n(\"Sapiens: A Brief History of Humankind\", 14.99, 18, \"Yuval Noah Harari's thought-provoking book explores the history of our species from the Stone Age to the present. It's a fascinating look at what makes us human.\"), \n(\"Becoming\", 12.99, 30, \"Michelle Obama's memoir offers an intimate look at her life, from her childhood to her time as First Lady. It's an inspiring story of resilience and empowerment.\"), \n(\"Educated\", 13.50, 25, \"Tara Westover's memoir chronicles her journey from growing up in a strict and abusive household to earning a PhD from Cambridge University. It's a powerful testament to the transformative power of education.\"), \n(\"Where the Crawdads Sing\", 11.99, 20, \"Delia Owens' debut novel intertwines a coming-of-age story with a murder mystery set in the marshes of North Carolina. It's a beautifully written tale of loneliness and resilience.\"), \n(\"The Silent Patient\", 14.99, 15, \"Alex Michaelides' psychological thriller follows a woman's act of violence against her husband and her subsequent silence. It's a gripping tale of obsession and betrayal.\"), \n(\"Circe\", 12.50, 30, \"Madeline Miller's retelling of the mythological figure Circe offers a fresh perspective on her story. It's a beautifully written exploration of power, femininity, and self-discovery.\"), \n(\"The Vanishing Half\", 13.99, 25, \"Brit Bennett's novel follows the lives of twin sisters who choose to live in two very different worlds. It's a powerful exploration of identity, race, and family.\"), \n(\"The Midnight Library\", 15.99, 20, \"Matt Haig's novel takes readers on a journey through a library that allows one to explore alternate lives. It's a thought-provoking tale about choices and regrets.\"), \n(\"The Seven Husbands of Evelyn Hugo\", 11.99, 30, \"Taylor Jenkins Reid's novel tells the story of a reclusive Hollywood icon as she recounts her glamorous and tumultuous life. It's a captivating exploration of love and fame.\"), \n(\"Daisy Jones & The Six\", 12.99, 25, \"Taylor Jenkins Reid's fictional oral history follows a rock band in the 1970s and their rise to fame. It's a gripping tale of ambition, love, and the complexities of relationships.\"), \n(\"The Song of Achilles\", 14.50, 15, \"Madeline Miller's retelling of the Trojan War focuses on the relationship between Achilles and Patroclus. It's a beautifully written exploration of love and destiny.\"), \n(\"Little Fires Everywhere\", 13.99, 20, \"Celeste Ng's novel delves into the intertwined lives of two families in a suburban community. It's a poignant exploration of motherhood, race, and the secrets we keep.\"), \n(\"The Overstory\", 15.99, 10, \"Richard Powers' Pulitzer Prize-winning novel tells the story of multiple characters whose lives are connected by trees. It's a profound exploration of nature and humanity.\"), \n(\"Anxious People\", 12.50, 30, \"Fredrik Backman's novel follows a failed bank robber who takes a group of strangers hostage during an open house. It's a heartwarming tale about human connection.\"), \n(\"The Guest List\", 13.99, 25, \"Lucy Foley's thriller unfolds during a wedding on a remote Irish island where secrets and lies come to light. It's a gripping tale of suspense and betrayal.\"), \n(\"The Woman in the Window\", 14.99, 15, \"A.J. Finn's psychological thriller follows an agoraphobic woman who believes she witnesses a crime. It's a tense and twisty narrative that keeps readers guessing.\"), \n(\"Normal People\", 11.99, 30, \"Sally Rooney's novel explores the complicated relationship between two Irish teenagers as they navigate love and friendship. It's a beautifully written exploration of intimacy.\"), \n(\"The Invisible Life of Addie LaRue\", 12.99, 25, \"V.E. Schwab's fantasy novel follows a young woman who makes a Faustian bargain to live forever but is forgotten by everyone she meets. It's a poignant tale of identity and legacy.\"), \n(\"The Light We Lost\", 13.50, 20, \"Jill Santopolo's novel follows a woman who reflects on her life and the choices that led her to where she is now. It's a heartfelt exploration of love and loss.\"), \n(\"The Nightingale\", 14.99, 15, \"Kristin Hannah's historical novel tells the story of two sisters in Nazi-occupied France. It's a powerful tale of courage and resilience during wartime.\"), \n(\"The Giver of Stars\", 12.50, 30, \"Jojo Moyes' novel follows a group of women who become traveling librarians in rural Kentucky during the Great Depression. It's an inspiring story about friendship and empowerment.\"), \n(\"A Man Called Ove\", 11.99, 25, \"Fredrik Backman's heartwarming novel follows a grumpy yet lovable man whose life changes when new neighbors move in. It's a touching story about community and connection.\"), \n(\"The Light Between Oceans\", 13.99, 20, \"M.L. Stedman's novel tells the story of a lighthouse keeper and his wife who make a life-altering decision after finding a baby. It's a poignant exploration of love and sacrifice.\"), \n(\"The Tattooist of Auschwitz\", 14.50, 15, \"Heather Morris' historical novel is based on the true story of a Holocaust survivor who falls in love in a concentration camp. It's a powerful tale of love and survival.\"), \n(\"The Book of Lost Names\", 12.99, 30, \"Kristin Harmel's historical fiction follows a young woman who forges identity documents for Jewish children during WWII. It's a gripping tale of courage and hope.\"), \n(\"The Henna Artist\", 13.99, 25, \"Alka Joshi's debut novel follows a young woman who escapes an abusive marriage and becomes a henna artist in Jaipur. It's a beautifully written exploration of freedom and identity.\"), \n(\"The Paris Library\", 14.99, 20, \"Janet Skeslien Charles' novel tells the story of a young woman who works at the American Library in Paris during WWII. It's a poignant tale of love, friendship, and the power of books.\"), \n(\"The Book Woman of Troublesome Creek\", 12.50, 30, \"Kim Michele Richardson's novel follows a woman who delivers books to remote communities in Kentucky during the Great Depression. It's an inspiring story about the importance of literacy.\"), \n(\"The Rosie Project\", 11.99, 25, \"Graeme Simsion's romantic comedy follows a genetics professor who creates a scientific survey to find a wife. It's a charming and humorous exploration of love and connection.\"), \n(\"Eleanor Oliphant Is Completely Fine\", 12.99, 20, \"Gail Honeyman's novel follows a socially awkward woman whose life changes when she develops a crush on a musician. It's a heartwarming tale about friendship and self-discovery.\"), \n(\"The Midnight Library\", 13.50, 15, \"Matt Haig's novel takes readers on a journey through a library that allows one to explore alternate lives. It's a thought-provoking tale about choices and regrets.\"), \n(\"The Silent Patient\", 14.99, 10, \"Alex Michaelides' psychological thriller follows a woman's act of violence against her husband and her subsequent silence. It's a gripping tale of obsession and betrayal.\"), \n(\"The Seven Husbands of Evelyn Hugo\", 11.99, 30, \"Taylor Jenkins Reid's novel tells the story of a reclusive Hollywood icon as she recounts her glamorous and tumultuous life. It's a captivating exploration of love and fame.\"), \n(\"Daisy Jones & The Six\", 12.99, 25, \"Taylor Jenkins Reid's fictional oral history follows a rock band in the 1970s and their rise to fame. It's a gripping tale of ambition, love, and the complexities of relationships.\"), \n(\"The Song of Achilles\", 14.50, 15, \"Madeline Miller's retelling of the Trojan War focuses on the relationship between Achilles and Patroclus. It's a beautifully written exploration of love and destiny.\"), \n(\"Little Fires Everywhere\", 13.99, 20, \"Celeste Ng's novel delves into the intertwined lives of two families in a suburban community. It's a poignant exploration of motherhood, race, and the secrets we keep.\"), \n(\"The Overstory\", 15.99, 10, \"Richard Powers' Pulitzer Prize-winning novel tells the story of multiple characters whose lives are connected by trees. It's a profound exploration of nature and humanity.\"), \n(\"Anxious People\", 12.50, 30, \"Fredrik Backman's novel follows a failed bank robber who takes a group of strangers hostage during an open house. It's a heartwarming tale about human connection.\"), \n(\"The Guest List\", 13.99, 25, \"Lucy Foley's thriller unfolds during a wedding on a remote Irish island where secrets and lies come to light. It's a gripping tale of suspense and betrayal.\"), \n(\"The Woman in the Window\", 14.99, 15, \"A.J. Finn's psychological thriller follows an agoraphobic woman who believes she witnesses a crime. It's a tense and twisty narrative that keeps readers guessing.\"), \n(\"Normal People\", 11.99, 30, \"Sally Rooney's novel explores the complicated relationship between two Irish teenagers as they navigate love and friendship. It's a beautifully written exploration of intimacy.\"), \n(\"The Invisible Life of Addie LaRue\", 12.99, 25, \"V.E. Schwab's fantasy novel follows a young woman who makes a Faustian bargain to live forever but is forgotten by everyone she meets. It's a poignant tale of identity and legacy.\"), \n(\"The Light We Lost\", 13.50, 20, \"Jill Santopolo's novel follows a woman who reflects on her life and the choices that led her to where she is now. It's a heartfelt exploration of love and loss.\"), \n(\"The Nightingale\", 14.99, 15, \"Kristin Hannah's historical novel tells the story of two sisters in Nazi-occupied France. It's a powerful tale of courage and resilience during wartime.\"), \n(\"The Giver of Stars\", 12.50, 30, \"Jojo Moyes' novel follows a group of women who become traveling librarians in rural Kentucky during the Great Depression. It's an inspiring story about friendship and empowerment.\"), \n(\"A Man Called Ove\", 11.99, 25, \"Fredrik Backman's heartwarming novel follows a grumpy yet lovable man whose life changes when new neighbors move in. It's a touching story about community and connection.\"), \n(\"The Light Between Oceans\", 13.99, 20, \"M.L. Stedman's novel tells the story of a lighthouse keeper and his wife who make a life-altering decision after finding a baby. It's a poignant exploration of love and sacrifice.\"), \n(\"The Tattooist of Auschwitz\", 14.50, 15, \"Heather Morris' historical novel is based on the true story of a Holocaust survivor who falls in love in a concentration camp. It's a powerful tale of love and survival.\"), \n(\"The Book Woman of Troublesome Creek\", 12.99, 30, \"Kim Michele Richardson's novel follows a woman who delivers books to remote communities in Kentucky during the Great Depression. It's an inspiring story about the importance of literacy.\"), \n(\"The Rosie Project\", 11.99, 25, \"Graeme Simsion's romantic comedy follows a genetics professor who creates a scientific survey to find a wife. It's a charming and humorous exploration of love and connection.\"), \n(\"Eleanor Oliphant Is Completely Fine\", 12.99, 20, \"Gail Honeyman's novel follows a socially awkward woman whose life changes when she develops a crush on a musician. It's a heartwarming tale about friendship and self-discovery.\")]"