"products = [\n    (\"Camping Tent\", 149.99, 30, \"A spacious 4-person tent designed for easy setup and durability. Perfect for family camping trips or weekend getaways.\"),\n    (\"Sleeping Bag\", 59.99, 100, \"A lightweight sleeping bag that provides warmth and comfort in cold weather. Features a water-resistant exterior and soft lining.\"),\n    (\"Camping Stove\", 89.99, 40, \"A portable camping stove that cooks meals quickly and efficiently. It runs on propane and is easy to pack for any adventure.\"),\n    (\"Cooler\", 79.99, 50, \"A rugged cooler that keeps your food and drinks cold for days. Ideal for camping trips, picnics, and beach outings.\"),\n    (\"Hiking Backpack\", 99.99, 70, \"A durable hiking backpack with ample storage and comfortable straps. Perfect for day hikes or extended backpacking trips.\"),\n    (\"Camping Chair\", 39.99, 80, \"A lightweight folding chair that offers comfort and support. Great for sitting around the campfire or relaxing at the campsite.\"),\n    (\"Flashlight\", 29.99, 120, \"A powerful LED flashlight that provides bright illumination. Compact and easy to carry, it's essential for nighttime adventures.\"),\n    (\"First Aid Kit\", 24.99, 90, \"A comprehensive first aid kit that includes essential medical supplies. Perfect for treating minor injuries while camping or hiking.\"),\n    (\"Water Filter\", 49.99, 60, \"A portable water filter that ensures safe drinking water from natural sources. Ideal for camping in remote areas.\"),\n    (\"Camping Hammock\", 39.99, 50, \"A lightweight hammock that is easy to set up between trees. Perfect for relaxing and enjoying the outdoors.\"),\n    (\"Multi-tool\", 34.99, 75, \"A versatile multi-tool that includes various functions like a knife, screwdriver, and bottle opener. Essential for any camping trip.\"),\n    (\"Portable Solar Charger\", 49.99, 40, \"A solar-powered charger that keeps your devices charged while off the grid. Compact and eco-friendly for outdoor adventures.\"),\n    (\"Campfire Cooking Set\", 59.99, 30, \"A complete cooking set designed for campfire meals. Includes pots, pans, and utensils for a fun outdoor cooking experience.\"),\n    (\"Binoculars\", 79.99, 25, \"High-quality binoculars for birdwatching and exploring nature. Compact design with excellent magnification for clear viewing.\"),\n    (\"Portable Toilet\", 89.99, 20, \"A compact and portable toilet solution for camping trips. Easy to use and clean, providing comfort in the great outdoors.\"),\n    (\"Camping Lantern\", 34.99, 60, \"An LED lantern that provides bright light for your campsite. Lightweight and rechargeable, it's perfect for evening activities.\"),\n    (\"Insulated Water Bottle\", 24.99, 100, \"A durable insulated water bottle that keeps drinks hot or cold for hours. Ideal for hiking and camping.\"),\n    (\"Trekking Poles\", 49.99, 45, \"Adjustable trekking poles that provide stability on uneven terrain. Lightweight and easy to pack for hiking adventures.\"),\n    (\"Fire Starter Kit\", 19.99, 80, \"A complete kit for starting campfires easily. Includes waterproof matches, kindling, and fire starters.\"),\n    (\"Camping Cookware Set\", 69.99, 35, \"A compact cookware set designed for outdoor cooking. Made from durable materials, it includes pots, pans, and utensils.\"),\n    (\"Bug Spray\", 14.99, 150, \"An effective bug spray that repels mosquitoes and other insects. Essential for a comfortable camping experience.\"),\n    (\"Portable Grill\", 99.99, 25, \"A compact portable grill perfect for cooking meals outdoors. Easy to set up and ideal for camping or picnics.\"),\n    (\"Outdoor Blanket\", 39.99, 55, \"A waterproof outdoor blanket that provides comfort and warmth. Great for picnics, camping, or lounging at the beach.\"),\n    (\"Camping Table\", 89.99, 30, \"A foldable camping table that is lightweight and easy to transport. Ideal for meals, games, and socializing at the campsite.\"),\n    (\"Survival Kit\", 79.99, 40, \"A comprehensive survival kit that includes tools and supplies for emergencies. Essential for any outdoor adventure.\"),\n    (\"Portable Fire Pit\", 129.99, 15, \"A portable fire pit that provides warmth and ambiance for your campsite. Easy to set up and perfect for roasting marshmallows.\"),\n    (\"Sunglasses\", 29.99, 100, \"Stylish sunglasses that provide UV protection and comfort. Ideal for sunny days spent outdoors.\"),\n    (\"Camping Guidebook\", 19.99, 70, \"A detailed guidebook featuring the best camping spots and tips. Perfect for both novice and experienced campers.\"),\n    (\"Knot Tying Guide\", 9.99, 100, \"A handy guide for learning essential knots for camping and boating. Great for beginners and seasoned adventurers.\"),\n    (\"Portable Shower\", 49.99, 25, \"A portable camping shower that provides a refreshing wash after a long day outdoors. Includes a water bag and showerhead.\"),\n    (\"Emergency Blanket\", 14.99, 80, \"A lightweight emergency blanket that retains body heat in cold conditions. Compact and essential for any outdoor kit.\"),\n    (\"Trail Map\", 9.99, 150, \"A detailed trail map that highlights hiking routes and points of interest. Essential for navigating the great outdoors.\"),\n    (\"Camping Pillow\", 24.99, 100, \"A compact camping pillow that provides comfort while sleeping outdoors. Lightweight and easy to pack for any trip.\"),\n    (\"Weather Radio\", 39.99, 40, \"A portable weather radio that keeps you informed of weather conditions. Essential for safety during outdoor adventures.\"),\n    (\"Fishing Rod\", 69.99, 30, \"A lightweight fishing rod designed for easy casting and catching. Perfect for fishing trips during your camping adventures.\"),\n    (\"Portable Speaker\", 49.99, 50, \"A waterproof portable speaker that delivers high-quality sound. Ideal for enjoying music around the campfire.\"),\n    (\"Camping Cot\", 99.99, 20, \"A durable camping cot that provides a comfortable sleeping surface. Elevated design keeps you off the ground for better rest.\"),\n    (\"Trail Running Shoes\", 89.99, 45, \"Lightweight trail running shoes designed for off-road adventures. Offers excellent grip and support for rugged terrains.\"),\n    (\"Emergency Whistle\", 5.99, 200, \"A loud emergency whistle that can be heard from great distances. Essential for signaling for help in case of emergencies.\"),\n    (\"Campfire Skewers\", 14.99, 100, \"Durable campfire skewers for roasting marshmallows and hotdogs. Perfect for fun evenings around the fire.\"),\n    (\"Solar Lantern\", 29.99, 70, \"A solar-powered lantern that provides bright light without batteries. Eco-friendly and perfect for camping use.\"),\n    (\"Camping Cookbook\", 24.99, 50, \"A cookbook filled with delicious and easy recipes for outdoor cooking. Perfect for making meals at the campsite.\"),\n    (\"Compact Binoculars\", 39.99, 60, \"Compact binoculars that are lightweight and easy to carry. Ideal for birdwatching and exploring nature.\"),\n    (\"Portable Camping Shower\", 49.99, 30, \"A portable camping shower that provides a refreshing wash after a long day outdoors. Easy to set up and use.\"),\n    (\"Bear Spray\", 39.99, 40, \"An effective bear spray that helps keep you safe in the wild. Compact and essential for camping in bear country.\"),\n    (\"Camping Tarp\", 49.99, 50, \"A waterproof camping tarp that provides shelter from rain and sun. Versatile for various outdoor uses.\"),\n    (\"Headlamp\", 29.99, 80, \"A hands-free headlamp that provides bright light for nighttime activities. Perfect for hiking, cooking, or reading in the dark.\"),\n    (\"Camping Games Set\", 34.99, 45, \"A set of fun outdoor games for family and friends. Includes items like frisbees, balls, and more for entertainment.\"),\n    (\"Portable Hammock Stand\", 69.99, 20, \"A sturdy portable hammock stand that allows you to relax anywhere. Perfect for use with camping hammocks.\"),\n    (\"Thermal Flask\", 29.99, 90, \"An insulated thermal flask that keeps beverages hot or cold for hours. Ideal for camping trips and outdoor activities.\"),\n    (\"Outdoor Cooking Grate\", 39.99, 40, \"A cooking grate that fits over a campfire for grilling. Perfect for making meals outdoors.\"),\n    (\"Camping Knife\", 24.99, 100, \"A versatile camping knife with multiple functions. Essential for cooking, cutting, and other outdoor tasks.\"),\n    (\"Portable Camping Sink\", 49.99, 25, \"A portable sink that makes washing dishes easy while camping. Compact and easy to transport.\"),\n    (\"Firewood Carrier\", 19.99, 60, \"A durable firewood carrier that makes transporting wood easy. Essential for campfires and outdoor cooking.\"),\n    (\"Camping Safety Whistle\", 9.99, 100, \"A safety whistle that can be used for signaling in emergencies. Lightweight and essential for outdoor safety.\"),\n    (\"Outdoor Adventure Kit\", 99.99, 15, \"A complete adventure kit that includes essential gear for outdoor activities. Perfect for camping, hiking, and exploring.\"),\n    (\"Portable Camping Fan\", 39.99, 30, \"A battery-operated fan that provides a cool breeze while camping. Compact and easy to use in tents or at the campsite.\"),\n    (\"Camping Water Bottle\", 19.99, 100, \"A durable water bottle designed for outdoor use. Features a built-in filter for clean drinking water.\"),\n    (\"Portable Campfire Grill\", 69.99, 20, \"A portable grill that allows you to cook meals over an open fire. Perfect for camping and tailgating.\"),\n    (\"Camping Notebook\", 14.99, 80, \"A waterproof notebook for jotting down notes and experiences while camping. Great for keeping memories alive.\"),\n    (\"Nature Journal\", 19.99, 70, \"A journal designed for documenting nature observations and experiences. Perfect for outdoor enthusiasts and campers.\"),\n    (\"Camping Seat Cushion\", 24.99, 90, \"A comfortable seat cushion for added comfort while sitting outdoors. Lightweight and easy to carry.\"),\n    (\"Portable BBQ Smoker\", 149.99, 10, \"A portable BBQ smoker that allows you to smoke meats and veggies while camping. Great for outdoor cooking enthusiasts.\"),\n    (\"Camping Phone Case\", 19.99, 100, \"A waterproof phone case that protects your device during outdoor activities. Essential for keeping your phone safe.\"),\n    (\"Outdoor Survival Guide\", 24.99, 50, \"A guidebook filled with essential survival tips and techniques. Perfect for campers and adventurers.\"),\n    (\"Camping Pet Gear\", 39.99, 30, \"A set of camping gear designed specifically for pets. Includes a portable water bowl and travel bag.\"),\n    (\"Camping Gear Organizer\", 29.99, 50, \"A compact organizer that keeps all your camping gear in one place. Ideal for easy access and transport.\"),\n    (\"Portable Campfire Pot\", 34.99, 40, \"A lightweight pot designed for cooking over an open fire. Perfect for making soups, stews, and more.\"),\n    (\"Camping Shoe Storage\", 19.99, 70, \"A compact storage solution for keeping shoes organized while camping. Helps keep dirt and mud out of your tent.\"),\n    (\"Camping Fire Pit Table\", 199.99, 5, \"A stylish fire pit table that adds ambiance to your campsite. Perfect for gathering around with friends and family.\"),\n    (\"Outdoor Adventure Map\", 14.99, 80, \"A detailed map highlighting outdoor adventures and trails. Essential for planning your next camping trip.\"),\n    (\"Camping Water Purification Tablets\", 9.99, 100, \"Tablets that purify water from natural sources, ensuring safe drinking. Essential for camping in remote areas.\"),\n    (\"Portable Camping Desk\", 49.99, 20, \"A compact camping desk that provides a workspace outdoors. Great for writing or using a laptop while camping.\"),\n    (\"Camping Gear Dry Bag\", 29.99, 50, \"A waterproof dry bag that keeps your gear safe from water. Ideal for canoeing, kayaking, or rainy camping trips.\"),\n    (\"Camping Lantern String Lights\", 34.99, 30, \"A set of string lights that adds ambiance to your campsite. Perfect for lighting up your outdoor space.\"),\n    (\"Portable Cooking Grill\", 89.99, 25, \"A portable cooking grill that makes outdoor cooking easy. Ideal for camping trips and tailgating.\"),\n    (\"Camping Gear Checklist\", 9.99, 100, \"A handy checklist to ensure you have all the essential camping gear. Perfect for planning your next adventure.\"),\n    (\"Camping Firewood Rack\", 39.99, 30, \"A sturdy firewood rack that keeps your firewood organized at the campsite. Essential for easy access to firewood.\"),\n    (\"Camping Gear Storage Bag\", 24.99, 80, \"A durable storage bag designed for organizing camping gear. Keeps everything neat and easy to find.\"),\n    (\"Outdoor Cooking Thermometer\", 19.99, 50, \"A cooking thermometer that ensures your food is cooked to perfection. Essential for outdoor chefs.\"),\n    (\"Camping Cooking Utensils\", 29.99, 60, \"A set of essential cooking utensils designed for camping. Includes spatula, tongs, and more for outdoor cooking.\"),\n    (\"Camping Fire Starter\", 14.99, 100, \"A fire starter kit that makes lighting campfires easy. Includes kindling and waterproof matches.\"),\n    (\"Portable Camping Tableware\", 34.99, 40, \"A lightweight set of camping tableware that includes plates, bowls, and utensils. Perfect for outdoor dining.\"),\n    (\"Camping Snacks Pack\", 19.99, 70, \"A pack of delicious and nutritious snacks for camping trips. Perfect for keeping your energy up while exploring.\"),\n    (\"Outdoor Adventure Gear\", 99.99, 10, \"A complete gear set designed for outdoor adventures. Includes essential items for camping, hiking, and more.\"),\n    (\"Camping Travel Mug\", 24.99, 100, \"A durable travel mug that keeps your beverages hot or cold. Perfect for enjoying coffee on the go while camping.\"),\n    (\"Camping Gear Repair Kit\", 19.99, 50, \"A repair kit that includes essential tools and materials for fixing camping gear. Perfect for emergencies in the wild.\"),\n    (\"Portable Camping Chair with Cooler\", 49.99, 30, \"A camping chair with a built-in cooler for drinks. Perfect for relaxing at the campsite with refreshments.\"),\n    (\"Camping Gear Organizer Backpack\", 79.99, 20, \"A backpack designed to organize all your camping gear. Features multiple compartments for easy access.\"),\n    (\"Camping Gear First Aid Kit\", 34.99, 40, \"A specialized first aid kit designed for camping. Includes essential supplies for treating outdoor injuries.\"),\n    (\"Camping Gear Multi-Purpose Tool\", 29.99, 60, \"A multi-purpose tool designed for camping tasks. Includes knife, screwdriver, and more for outdoor use.\"),\n    (\"Portable Camping Solar Shower\", 39.99, 25, \"A solar-powered shower that provides warm water for washing. Perfect for camping in remote locations.\"),\n    (\"Camping Gear Emergency Kit\", 49.99, 20, \"A comprehensive emergency kit designed for camping. Includes tools and supplies for various outdoor situations.\"),\n    (\"Camping Gear Drying Rack\", 34.99, 30, \"A portable drying rack for drying clothes and gear while camping. Essential for keeping everything organized.\"),\n    (\"Camping Gear Insulated Blanket\", 49.99, 25, \"An insulated blanket that provides warmth during chilly nights. Perfect for snuggling around the campfire.\"),\n    (\"Camping Gear Mosquito Net\", 19.99, 50, \"A lightweight mosquito net that provides protection from bugs while sleeping. Essential for a comfortable camping experience.\"),\n    (\"Camping Gear Water Storage Bag\", 14.99, 100, \"A collapsible water storage bag that is easy to transport. Perfect for storing water while camping.\"),\n    (\"Camping Gear Portable Grill Pan\", 29.99, 40, \"A portable grill pan that allows for easy cooking over a campfire. Ideal for making pancakes and eggs outdoors.\"),\n    (\"Camping Gear Pocket Knife\", 19.99, 100, \"A compact pocket knife that is perfect for camping tasks. Features multiple tools for versatility.\"),\n    (\"Camping Gear Folding Table\", 49.99, 30, \"A lightweight folding table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Portable Firestarter\", 14.99, 80, \"A portable firestarter that makes it easy to light campfires. Essential for any camping trip.\"),\n    (\"Camping Gear Safety Kit\", 24.99, 50, \"A safety kit that includes essential items for outdoor emergencies. Perfect for ensuring safety while camping.\"),\n    (\"Camping Gear Portable Water Filter\", 39.99, 25, \"A portable water filter that ensures safe drinking water while camping. Compact and easy to use.\"),\n    (\"Camping Gear Sleeping Pad\", 34.99, 40, \"A comfortable sleeping pad that provides insulation and support. Perfect for a good night's sleep while camping.\"),\n    (\"Camping Gear Portable Campfire\", 89.99, 15, \"A portable campfire that provides warmth and light. Ideal for cooking and gathering around at the campsite.\"),\n    (\"Camping Gear Trail Mix\", 14.99, 100, \"A nutritious trail mix that provides energy for outdoor adventures. Perfect for snacking while hiking or camping.\"),\n    (\"Camping Gear Lantern Batteries\", 9.99, 80, \"Batteries designed for camping lanterns to ensure you have light when you need it. Essential for nighttime activities.\"),\n    (\"Camping Gear Portable Cook Stove\", 69.99, 20, \"A portable cook stove that makes outdoor cooking easy. Ideal for camping trips and tailgating.\"),\n    (\"Camping Gear Quick-Dry Towel\", 19.99, 100, \"A quick-dry towel that is lightweight and compact. Perfect for drying off after swimming or washing.\"),\n    (\"Camping Gear Portable Tent Fan\", 29.99, 40, \"A portable fan designed for use in tents. Helps circulate air and keep you cool while camping.\"),\n    (\"Camping Gear Fire Pit Cooking Grate\", 39.99, 30, \"A cooking grate that fits over a fire pit for grilling. Perfect for outdoor cooking at the campsite.\"),\n    (\"Camping Gear Insulated Cooler\", 59.99, 50, \"An insulated cooler that keeps food and drinks cold for days. Ideal for camping trips and picnics.\"),\n    (\"Camping Gear Outdoor Blanket\", 34.99, 40, \"A versatile outdoor blanket that is perfect for picnics and camping. Provides comfort and warmth during outdoor activities.\"),\n    (\"Camping Gear Portable Water Bottle with Filter\", 29.99, 60, \"A water bottle with a built-in filter that ensures safe drinking water. Perfect for outdoor adventures.\"),\n    (\"Camping Gear Folding Camping Chair\", 49.99, 30, \"A folding camping chair that provides comfort and support. Lightweight and easy to carry for outdoor activities.\"),\n    (\"Camping Gear Portable Solar Panel\", 99.99, 10, \"A portable solar panel that charges your devices while camping. Eco-friendly and perfect for off-grid adventures.\"),\n    (\"Camping Gear Waterproof Phone Pouch\", 14.99, 100, \"A waterproof pouch that protects your phone during outdoor activities. Essential for keeping your device safe.\"),\n    (\"Camping Gear Portable Camping Table\", 49.99, 20, \"A portable camping table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Insulated Water Bottle\", 24.99, 100, \"An insulated water bottle that keeps drinks hot or cold for hours. Ideal for staying hydrated while camping.\"),\n    (\"Camping Gear Emergency Firestarter Kit\", 19.99, 50, \"An emergency firestarter kit that includes everything you need to start a fire. Perfect for camping and emergencies.\"),\n    (\"Camping Gear Portable Shower Tent\", 69.99, 15, \"A portable shower tent that provides privacy for outdoor showers. Easy to set up and perfect for camping.\"),\n    (\"Camping Gear Compact Sleeping Pad\", 34.99, 40, \"A compact sleeping pad that provides comfort and insulation while camping. Perfect for a good night's sleep.\"),\n    (\"Camping Gear Portable Water Purifier\", 39.99, 25, \"A portable water purifier that ensures safe drinking water while camping. Essential for outdoor adventures.\"),\n    (\"Camping Gear Lightweight Backpack\", 49.99, 30, \"A lightweight backpack designed for day hikes and camping trips. Offers comfort and ample storage for gear.\"),\n    (\"Camping Gear Portable Campfire Cooking Kit\", 69.99, 20, \"A complete cooking kit designed for use over a campfire. Includes pots, pans, and utensils for outdoor cooking.\"),\n    (\"Camping Gear Waterproof Dry Bag\", 24.99, 100, \"A waterproof dry bag that keeps your gear safe from water. Perfect for canoeing, kayaking, or rainy camping trips.\"),\n    (\"Camping Gear Portable Fire Pit\", 129.99, 10, \"A portable fire pit that provides warmth and ambiance for your campsite. Great for roasting marshmallows and gathering around.\"),\n    (\"Camping Gear Outdoor Adventure Kit\", 99.99, 10, \"A complete kit designed for outdoor adventures. Includes essential gear for camping, hiking, and exploring.\"),\n    (\"Camping Gear Portable Camping Sink\", 49.99, 25, \"A portable sink that makes washing dishes easy while camping. Compact and easy to transport.\"),\n    (\"Camping Gear Insulated Blanket\", 49.99, 25, \"An insulated blanket that provides warmth during chilly nights. Perfect for snuggling around the campfire.\"),\n    (\"Camping Gear Mosquito Net\", 19.99, 50, \"A lightweight mosquito net that provides protection from bugs while sleeping. Essential for a comfortable camping experience.\"),\n    (\"Camping Gear Water Storage Bag\", 14.99, 100, \"A collapsible water storage bag that is easy to transport. Perfect for storing water while camping.\"),\n    (\"Camping Gear Portable Grill Pan\", 29.99, 40, \"A portable grill pan that allows for easy cooking over a campfire. Ideal for making pancakes and eggs outdoors.\"),\n    (\"Camping Gear Pocket Knife\", 19.99, 100, \"A compact pocket knife that is perfect for camping tasks. Features multiple tools for versatility.\"),\n    (\"Camping Gear Folding Table\", 49.99, 30, \"A lightweight folding table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Portable Firestarter\", 14.99, 80, \"A portable firestarter that makes it easy to light campfires. Essential for any camping trip.\"),\n    (\"Camping Gear Safety Kit\", 24.99, 50, \"A safety kit that includes essential items for outdoor emergencies. Perfect for ensuring safety while camping.\"),\n    (\"Camping Gear Portable Water Filter\", 39.99, 25, \"A portable water filter that ensures safe drinking water while camping. Compact and easy to use.\"),\n    (\"Camping Gear Sleeping Pad\", 34.99, 40, \"A comfortable sleeping pad that provides insulation and support. Perfect for a good night's sleep while camping.\"),\n    (\"Camping Gear Portable Campfire\", 89.99, 15, \"A portable campfire that provides warmth and light. Ideal for cooking and gathering around at the campsite.\"),\n    (\"Camping Gear Trail Mix\", 14.99, 100, \"A nutritious trail mix that provides energy for outdoor adventures. Perfect for snacking while hiking or camping.\"),\n    (\"Camping Gear Lantern Batteries\", 9.99, 80, \"Batteries designed for camping lanterns to ensure you have light when you need it. Essential for nighttime activities.\"),\n    (\"Camping Gear Portable Cook Stove\", 69.99, 20, \"A portable cook stove that makes outdoor cooking easy. Ideal for camping trips and tailgating.\"),\n    (\"Camping Gear Quick-Dry Towel\", 19.99, 100, \"A quick-dry towel that is lightweight and compact. Perfect for drying off after swimming or washing.\"),\n    (\"Camping Gear Portable Tent Fan\", 29.99, 40, \"A portable fan designed for use in tents. Helps circulate air and keep you cool while camping.\"),\n    (\"Camping Gear Fire Pit Cooking Grate\", 39.99, 30, \"A cooking grate that fits over a fire pit for grilling. Perfect for outdoor cooking at the campsite.\"),\n    (\"Camping Gear Insulated Cooler\", 59.99, 50, \"An insulated cooler that keeps food and drinks cold for days. Ideal for camping trips and picnics.\"),\n    (\"Camping Gear Outdoor Blanket\", 34.99, 40, \"A versatile outdoor blanket that is perfect for picnics and camping. Provides comfort and warmth during outdoor activities.\"),\n    (\"Camping Gear Portable Water Bottle with Filter\", 29.99, 60, \"A water bottle with a built-in filter that ensures safe drinking water. Perfect for outdoor adventures.\"),\n    (\"Camping Gear Folding Camping Chair\", 49.99, 30, \"A folding camping chair that provides comfort and support. Lightweight and easy to carry for outdoor activities.\"),\n    (\"Camping Gear Portable Solar Panel\", 99.99, 10, \"A portable solar panel that charges your devices while camping. Eco-friendly and perfect for off-grid adventures.\"),\n    (\"Camping Gear Waterproof Phone Pouch\", 14.99, 100, \"A waterproof pouch that protects your phone during outdoor activities. Essential for keeping your device safe.\"),\n    (\"Camping Gear Portable Camping Table\", 49.99, 20, \"A portable camping table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Insulated Water Bottle\", 24.99, 100, \"An insulated water bottle that keeps drinks hot or cold for hours. Ideal for staying hydrated while camping.\"),\n    (\"Camping Gear Emergency Firestarter Kit\", 19.99, 50, \"An emergency firestarter kit that includes everything you need to start a fire. Perfect for camping and emergencies.\"),\n    (\"Camping Gear Portable Shower Tent\", 69.99, 15, \"A portable shower tent that provides privacy for outdoor showers. Easy to set up and perfect for camping.\"),\n    (\"Camping Gear Compact Sleeping Pad\", 34.99, 40, \"A compact sleeping pad that provides comfort and insulation while camping. Perfect for a good night's sleep.\"),\n    (\"Camping Gear Portable Water Purifier\", 39.99, 25, \"A portable water purifier that ensures safe drinking water while camping. Essential for outdoor adventures.\"),\n    (\"Camping Gear Lightweight Backpack\", 49.99, 30, \"A lightweight backpack designed for day hikes and camping trips. Offers comfort and ample storage for gear.\"),\n    (\"Camping Gear Portable Campfire Cooking Kit\", 69.99, 20, \"A complete cooking kit designed for use over a campfire. Includes pots, pans, and utensils for outdoor cooking.\"),\n    (\"Camping Gear Waterproof Dry Bag\", 24.99, 100, \"A waterproof dry bag that keeps your gear safe from water. Perfect for canoeing, kayaking, or rainy camping trips.\"),\n    (\"Camping Gear Portable Fire Pit\", 129.99, 10, \"A portable fire pit that provides warmth and ambiance for your campsite. Great for roasting marshmallows and gathering around.\"),\n    (\"Camping Gear Outdoor Adventure Kit\", 99.99, 10, \"A complete kit designed for outdoor adventures. Includes essential gear for camping, hiking, and exploring.\"),\n    (\"Camping Gear Portable Camping Sink\", 49.99, 25, \"A portable sink that makes washing dishes easy while camping. Compact and easy to transport.\"),\n    (\"Camping Gear Insulated Blanket\", 49.99, 25, \"An insulated blanket that provides warmth during chilly nights. Perfect for snuggling around the campfire.\"),\n    (\"Camping Gear Mosquito Net\", 19.99, 50, \"A lightweight mosquito net that provides protection from bugs while sleeping. Essential for a comfortable camping experience.\"),\n    (\"Camping Gear Water Storage Bag\", 14.99, 100, \"A collapsible water storage bag that is easy to transport. Perfect for storing water while camping.\"),\n    (\"Camping Gear Portable Grill Pan\", 29.99, 40, \"A portable grill pan that allows for easy cooking over a campfire. Ideal for making pancakes and eggs outdoors.\"),\n    (\"Camping Gear Pocket Knife\", 19.99, 100, \"A compact pocket knife that is perfect for camping tasks. Features multiple tools for versatility.\"),\n    (\"Camping Gear Folding Table\", 49.99, 30, \"A lightweight folding table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Portable Firestarter\", 14.99, 80, \"A portable firestarter that makes it easy to light campfires. Essential for any camping trip.\"),\n    (\"Camping Gear Safety Kit\", 24.99, 50, \"A safety kit that includes essential items for outdoor emergencies. Perfect for ensuring safety while camping.\"),\n    (\"Camping Gear Portable Water Filter\", 39.99, 25, \"A portable water filter that ensures safe drinking water while camping. Compact and easy to use.\"),\n    (\"Camping Gear Sleeping Pad\", 34.99, 40, \"A comfortable sleeping pad that provides insulation and support. Perfect for a good night's sleep while camping.\"),\n    (\"Camping Gear Portable Campfire\", 89.99, 15, \"A portable campfire that provides warmth and light. Ideal for cooking and gathering around at the campsite.\"),\n    (\"Camping Gear Trail Mix\", 14.99, 100, \"A nutritious trail mix that provides energy for outdoor adventures. Perfect for snacking while hiking or camping.\"),\n    (\"Camping Gear Lantern Batteries\", 9.99, 80, \"Batteries designed for camping lanterns to ensure you have light when you need it. Essential for nighttime activities.\"),\n    (\"Camping Gear Portable Cook Stove\", 69.99, 20, \"A portable cook stove that makes outdoor cooking easy. Ideal for camping trips and tailgating.\"),\n    (\"Camping Gear Quick-Dry Towel\", 19.99, 100, \"A quick-dry towel that is lightweight and compact. Perfect for drying off after swimming or washing.\"),\n    (\"Camping Gear Portable Tent Fan\", 29.99, 40, \"A portable fan designed for use in tents. Helps circulate air and keep you cool while camping.\"),\n    (\"Camping Gear Fire Pit Cooking Grate\", 39.99, 30, \"A cooking grate that fits over a fire pit for grilling. Perfect for outdoor cooking at the campsite.\"),\n    (\"Camping Gear Insulated Cooler\", 59.99, 50, \"An insulated cooler that keeps food and drinks cold for days. Ideal for camping trips and picnics.\"),\n    (\"Camping Gear Outdoor Blanket\", 34.99, 40, \"A versatile outdoor blanket that is perfect for picnics and camping. Provides comfort and warmth during outdoor activities.\"),\n    (\"Camping Gear Portable Water Bottle with Filter\", 29.99, 60, \"A water bottle with a built-in filter that ensures safe drinking water. Perfect for outdoor adventures.\"),\n    (\"Camping Gear Folding Camping Chair\", 49.99, 30, \"A folding camping chair that provides comfort and support. Lightweight and easy to carry for outdoor activities.\"),\n    (\"Camping Gear Portable Solar Panel\", 99.99, 10, \"A portable solar panel that charges your devices while camping. Eco-friendly and perfect for off-grid adventures.\"),\n    (\"Camping Gear Waterproof Phone Pouch\", 14.99, 100, \"A waterproof pouch that protects your phone during outdoor activities. Essential for keeping your device safe.\"),\n    (\"Camping Gear Portable Camping Table\", 49.99, 20, \"A portable camping table that is easy to set up and transport. Perfect for meals and activities at the campsite.\"),\n    (\"Camping Gear Insulated Water Bottle\", 24.99, 100, \"An insulated water bottle that keeps drinks hot or cold for hours. Ideal for staying hydrated while camping.\"),\n    (\"Camping Gear Emergency Firestarter Kit\", 19.99, 50, \"An emergency firestarter kit that includes everything you need to start a fire. Perfect for camping and emergencies.\"),\n    (\"Camping Gear Portable Shower Tent\", 69.99, 15, \"A portable shower tent that provides privacy for outdoor showers. Easy to set up and perfect for camping.\"),\n    (\"Camping Gear Compact Sleeping Pad\", 34.99, 40, \"A compact sleeping pad that provides comfort and insulation while camping. Perfect for a good night's sleep.\"),\n    (\"Camping Gear Portable Water Purifier\", 39.99, 25, \"A portable water purifier that ensures safe drinking water while camping. Essential for outdoor adventures.\"),\n    (\"Camping Gear Lightweight Backpack\", 49.99, 30, \"A lightweight backpack designed for day hikes and camping trips. Offers comfort and ample storage for gear.\"),\n    (\"Camping Gear Portable Campfire Cooking Kit\", 69.99, 20, \"A complete cooking kit designed for use over a campfire. Includes pots, pans, and utensils for outdoor cooking.\"),\n]"