"[(\"All-Purpose Cleaner\", 5.99, 150, \"A versatile cleaner that can be used on multiple surfaces. It effectively removes dirt and grime, leaving your home sparkling clean.\"), \n(\"Glass Cleaner\", 4.99, 200, \"This streak-free glass cleaner is perfect for windows and mirrors. It provides a crystal-clear finish without any residue.\"), \n(\"Disinfectant Wipes\", 7.49, 100, \"Convenient disinfectant wipes that kill 99.9% of germs. Ideal for quick clean-ups and sanitizing surfaces.\"), \n(\"Floor Cleaner\", 6.49, 120, \"A specially formulated cleaner for hardwood and tile floors. It cleans deeply while protecting the finish of your floors.\"), \n(\"Bathroom Cleaner\", 5.49, 90, \"This powerful bathroom cleaner tackles soap scum and mildew with ease. It leaves your bathroom fresh and sparkling.\"), \n(\"Laundry Detergent\", 12.99, 80, \"A concentrated laundry detergent that removes tough stains and odors. Suitable for all types of fabrics and washing machines.\"), \n(\"Dish Soap\", 3.99, 150, \"A gentle yet effective dish soap that cuts through grease. It leaves your dishes clean and free of residues.\"), \n(\"Oven Cleaner\", 8.99, 70, \"This heavy-duty oven cleaner works quickly to remove baked-on grease and grime. It's tough on stains but gentle on surfaces.\"), \n(\"Carpet Cleaner\", 11.99, 60, \"A powerful carpet cleaner that eliminates stains and odors. It revitalizes your carpets, leaving them fresh and clean.\"), \n(\"Microfiber Cleaning Cloths\", 9.99, 200, \"Soft and absorbent microfiber cloths that trap dust and dirt. Perfect for cleaning delicate surfaces without scratching.\"), \n(\"Toilet Bowl Cleaner\", 3.49, 110, \"A thick gel toilet bowl cleaner that clings to surfaces to eliminate stains and odors. It leaves a fresh scent after every use.\"), \n(\"Mop and Bucket Set\", 24.99, 40, \"This complete mop and bucket set makes cleaning floors a breeze. The mop head is washable and reusable for convenience.\"), \n(\"Sponge Scourers\", 2.49, 300, \"Durable sponge scourers that are perfect for scrubbing pots and pans. They are designed to tackle tough messes without damaging surfaces.\"), \n(\"Air Freshener Spray\", 4.49, 130, \"A refreshing air freshener spray that eliminates odors and leaves a pleasant fragrance. Ideal for use in any room of the house.\"), \n(\"Trash Bags\", 9.99, 200, \"Strong and durable trash bags that can hold heavy loads without tearing. Perfect for home or office use.\"), \n(\"Dishwasher Detergent\", 8.49, 90, \"This dishwasher detergent provides powerful cleaning for your dishes. It effectively removes food residues and leaves no spots.\"), \n(\"Surface Disinfectant\", 6.99, 110, \"A fast-acting surface disinfectant that kills germs on contact. Great for high-touch areas in your home or office.\"), \n(\"Broom and Dustpan Set\", 15.99, 50, \"This broom and dustpan set is designed for efficient sweeping. The dustpan has a rubber edge for easy collection of debris.\"), \n(\"Lint Roller\", 3.99, 180, \"An essential lint roller that quickly removes lint, hair, and dust from clothing and upholstery. Compact and easy to use.\"), \n(\"Stainless Steel Cleaner\", 5.99, 75, \"A specially formulated cleaner for stainless steel appliances. It cleans, shines, and protects without leaving streaks.\"), \n(\"Pet Stain Remover\", 9.49, 65, \"This pet stain remover effectively eliminates stains and odors caused by pets. Safe for use on carpets and upholstery.\"), \n(\"Scented Candle\", 12.99, 40, \"A beautifully scented candle that adds a warm ambiance to your home. It burns cleanly and evenly for hours of enjoyment.\"), \n(\"Window Squeegee\", 4.99, 150, \"A high-quality window squeegee that makes cleaning windows effortless. It features a comfortable grip and durable rubber blade.\"), \n(\"Heavy-Duty Trash Bags\", 14.99, 100, \"Extra strong trash bags designed for heavy loads and sharp objects. Ideal for construction sites or outdoor use.\"), \n(\"Foam Hand Soap\", 3.49, 200, \"A foaming hand soap that gently cleanses while moisturizing your hands. Perfect for use in kitchens and bathrooms.\"), \n(\"Cleaning Caddy\", 19.99, 30, \"A portable cleaning caddy that keeps all your cleaning supplies organized. It features multiple compartments for easy access.\"), \n(\"Dusting Spray\", 6.49, 90, \"This dusting spray attracts and traps dust for a cleaner home. It leaves behind a light, pleasant fragrance.\"), \n(\"Fabric Freshener\", 5.99, 80, \"A fabric freshener spray that revitalizes upholstery and linens. It eliminates odors and leaves a fresh scent.\"), \n(\"Chlorine Bleach\", 3.99, 100, \"A powerful chlorine bleach that disinfects and whitens laundry. It's effective for tough stains and sanitizing surfaces.\"), \n(\"Pressure Washer Detergent\", 12.99, 50, \"This detergent is specially formulated for use with pressure washers. It effectively removes dirt and grime from outdoor surfaces.\"), \n(\"Scrub Brush\", 4.49, 150, \"A sturdy scrub brush that is perfect for tough cleaning jobs. It features durable bristles for effective scrubbing.\"), \n(\"Cleaning Gloves\", 2.99, 200, \"Protect your hands while cleaning with these durable cleaning gloves. They provide a secure grip and are easy to clean.\"), \n(\"Dust Mop\", 10.99, 60, \"An efficient dust mop that captures dust and dirt with ease. Ideal for quick clean-ups on hardwood or tile floors.\"), \n(\"Squeegee for Shower\", 7.49, 80, \"This shower squeegee helps prevent water spots on glass surfaces. It features a suction hook for easy storage.\"), \n(\"Stain Remover Spray\", 8.99, 70, \"A powerful stain remover spray that works on a variety of fabrics. It effectively tackles tough stains without damaging materials.\"), \n(\"Baking Soda Cleaner\", 4.99, 150, \"A natural cleaning solution made from baking soda. It's effective for deodorizing and scrubbing surfaces.\"), \n(\"Carpet Stain Remover\", 9.99, 60, \"This carpet stain remover quickly lifts stains and odors from carpets. It's safe for use on most carpet types.\"), \n(\"Heavy-Duty Scrub Pads\", 5.49, 100, \"These heavy-duty scrub pads are perfect for tough cleaning tasks. They are durable and can be used on various surfaces.\"), \n(\"Foaming Bathroom Cleaner\", 6.99, 90, \"A foaming bathroom cleaner that clings to surfaces for deep cleaning. It effectively removes soap scum and mildew.\"), \n(\"Cleaning Brush Set\", 11.99, 40, \"This cleaning brush set includes various sizes for all your cleaning needs. Ideal for scrubbing hard-to-reach areas.\"), \n(\"Odor Eliminator Spray\", 7.99, 80, \"An odor eliminator spray that neutralizes unpleasant smells. Perfect for use in homes, cars, and offices.\"), \n(\"Toilet Brush and Holder\", 9.49, 50, \"A toilet brush with a sturdy holder for discreet storage. It features durable bristles for effective cleaning.\"), \n(\"Cleaning Solution Concentrate\", 14.99, 30, \"A concentrated cleaning solution that can be diluted for various uses. It's effective for floors, countertops, and more.\"), \n(\"Dusting Cloths\", 3.99, 200, \"Soft dusting cloths that trap dust and allergens. Ideal for use on electronics and delicate surfaces.\"), \n(\"Laundry Stain Remover\", 6.49, 100, \"This laundry stain remover is tough on stains but gentle on fabrics. It works effectively in both cold and hot water.\"), \n(\"Mop Refill Pads\", 12.99, 50, \"Refill pads for your mop that provide superior cleaning power. They are machine washable for easy maintenance.\"), \n(\"Hand Sanitizer\", 4.99, 150, \"A quick-drying hand sanitizer that kills 99.9% of germs. Perfect for use at home or on the go.\"), \n(\"Floor Wax\", 8.49, 70, \"This floor wax provides a long-lasting shine and protects your floors. It's suitable for use on various types of flooring.\"), \n(\"Pressure Washer\", 149.99, 20, \"A powerful pressure washer that makes outdoor cleaning easy. It effectively removes dirt and grime from surfaces.\"), \n(\"Lint-Free Cleaning Cloths\", 7.49, 100, \"These lint-free cleaning cloths are perfect for polishing and dusting. They leave no residue behind.\"), \n(\"Car Wash Soap\", 5.99, 80, \"A specially formulated car wash soap that cleans without scratching. It leaves your vehicle looking shiny and new.\"), \n(\"Scented Garbage Bags\", 12.99, 50, \"These scented garbage bags help mask unpleasant odors. They are strong and durable for everyday use.\"), \n(\"Dustpan with Broom\", 9.99, 60, \"This dustpan and broom set is designed for easy clean-up. The broom has soft bristles for effective sweeping.\"), \n(\"Cleaning Vinegar\", 4.49, 100, \"A natural cleaning vinegar that can be used for a variety of tasks. It's effective for deodorizing and breaking down grease.\"), \n(\"Fabric Softener\", 6.99, 80, \"This fabric softener leaves your clothes soft and fresh. It helps reduce static cling and wrinkles.\"), \n(\"Outdoor Cleaner\", 11.99, 40, \"An outdoor cleaner that effectively removes dirt and stains from patios and decks. It's safe for use on most surfaces.\"), \n(\"Vacuum Cleaner Bags\", 9.49, 50, \"High-efficiency vacuum cleaner bags designed to capture dust and allergens. They are compatible with various vacuum models.\"), \n(\"Portable Vacuum\", 39.99, 30, \"A compact and portable vacuum cleaner ideal for quick clean-ups. Lightweight and easy to store.\"), \n(\"Cleaning Spray Bottle\", 2.99, 200, \"A refillable spray bottle for your favorite cleaning solutions. It features an adjustable nozzle for fine mist or stream.\"), \n(\"Eco-Friendly Cleaning Spray\", 7.99, 70, \"An eco-friendly cleaning spray made from natural ingredients. It's effective for everyday cleaning without harsh chemicals.\"), \n(\"Window Cleaning Kit\", 14.99, 50, \"A complete window cleaning kit that includes everything you need for streak-free windows. Perfect for home or office use.\"), \n(\"Stainless Steel Scrubbers\", 3.49, 150, \"Durable stainless steel scrubbers that tackle tough grime. Ideal for pots, pans, and grills.\"), \n(\"Odor Absorbing Gel\", 5.99, 100, \"An odor-absorbing gel that neutralizes smells in your home. It’s perfect for use in kitchens, bathrooms, or closets.\"), \n(\"Cleaning Sponge\", 2.49, 300, \"Multi-purpose cleaning sponges that are soft yet effective. They are great for dishes, countertops, and more.\"), \n(\"Squeegee with Handle\", 9.49, 60, \"A squeegee with an ergonomic handle for comfortable use. Ideal for keeping shower doors and windows streak-free.\"), \n(\"Reusable Cleaning Pads\", 11.99, 40, \"These reusable cleaning pads are compatible with most mops. They are machine washable and environmentally friendly.\"), \n(\"Bleach Alternative\", 6.49, 90, \"An effective bleach alternative that whitens and brightens without harsh chemicals. Safe for most fabrics.\"), \n(\"Dust Buster\", 29.99, 30, \"A handheld dust buster that makes quick clean-ups a breeze. It’s lightweight and easy to maneuver.\"), \n(\"Cleaning Kit\", 19.99, 20, \"A complete cleaning kit that includes essential tools for every cleaning task. Perfect for home or office use.\"), \n(\"Odor Eliminator Granules\", 8.99, 50, \"Granules that absorb and neutralize odors in your home. Ideal for use in basements, closets, or pet areas.\"), \n(\"Heavy-Duty Cleaning Gloves\", 4.99, 150, \"These heavy-duty cleaning gloves provide extra protection for tough cleaning jobs. They are durable and reusable.\"), \n(\"Baking Soda Carpet Cleaner\", 5.49, 80, \"A carpet cleaner made with baking soda that eliminates odors and freshens carpets. Safe for use on all carpet types.\"), \n(\"All-Natural Floor Cleaner\", 6.99, 70, \"An all-natural floor cleaner that is safe for children and pets. It cleans effectively without harmful chemicals.\"), \n(\"Cleaning Wipes\", 7.49, 100, \"Convenient cleaning wipes that are perfect for on-the-go cleaning. They are pre-moistened and ready to use.\"), \n(\"Mop Bucket with Wringer\", 24.99, 40, \"A mop bucket with a built-in wringer for easy cleaning. It’s perfect for mopping large areas quickly.\"), \n(\"Foam Cleaning Pads\", 3.99, 150, \"Soft foam cleaning pads that are perfect for delicate surfaces. They provide effective cleaning without scratching.\"), \n(\"Scented Hand Soap\", 4.99, 200, \"A luxurious scented hand soap that leaves your hands feeling soft. It's perfect for use in kitchens and bathrooms.\"), \n(\"Window Cleaning Solution\", 4.49, 130, \"A specially formulated window cleaning solution that provides a streak-free shine. Ideal for use on glass surfaces.\"), \n(\"Mop Handle\", 8.99, 60, \"A sturdy mop handle that is adjustable for comfortable use. It is compatible with most mop heads for versatility.\"), \n(\"Shower Cleaner\", 5.49, 90, \"A powerful shower cleaner that removes soap scum and mildew. It leaves your shower sparkling clean and fresh.\"), \n(\"Air Purifier Filter\", 19.99, 30, \"A replacement filter for air purifiers that captures allergens and dust. It helps improve indoor air quality.\"), \n(\"Steam Cleaner\", 99.99, 20, \"A versatile steam cleaner that sanitizes and cleans a variety of surfaces. It’s chemical-free and eco-friendly.\"), \n(\"All-Purpose Cleaning Spray\", 5.99, 150, \"An all-purpose cleaning spray that works on multiple surfaces. It cuts through grease and grime with ease.\"), \n(\"Carpet Freshener\", 6.49, 80, \"A carpet freshener that eliminates odors and leaves a pleasant scent. It's easy to use and safe for pets.\"), \n(\"Heavy-Duty Broom\", 10.99, 50, \"A heavy-duty broom designed for outdoor use. It effectively sweeps away leaves and debris.\"), \n(\"Dishwasher Cleaner\", 8.49, 90, \"This dishwasher cleaner removes hard water buildup and odors. It helps maintain the efficiency of your dishwasher.\"), \n(\"Eco-Friendly Trash Bags\", 12.99, 50, \"Biodegradable trash bags that are environmentally friendly. They are strong and suitable for everyday use.\"), \n(\"Window Tinting Film\", 19.99, 30, \"A window tinting film that reduces glare and UV rays. It enhances privacy while maintaining visibility.\"), \n(\"Pet Odor Neutralizer\", 7.99, 70, \"An effective pet odor neutralizer that eliminates unpleasant smells. Safe for use on carpets and upholstery.\"), \n(\"Cleaning Brush with Handle\", 4.49, 150, \"A cleaning brush with a comfortable handle for scrubbing tough stains. Ideal for kitchens and bathrooms.\"), \n(\"Furniture Polish\", 5.99, 80, \"A furniture polish that cleans and protects wood surfaces. It leaves a beautiful shine and a pleasant scent.\"), \n(\"Grout Cleaner\", 6.99, 60, \"A powerful grout cleaner that removes stains and restores the original color. Perfect for tiles and bathroom surfaces.\"), \n(\"Glass Cleaning Cloths\", 3.49, 200, \"Specialized cloths for cleaning glass surfaces without streaks. They are reusable and machine washable.\"), \n(\"Portable Steam Cleaner\", 49.99, 30, \"A handheld portable steam cleaner that sanitizes surfaces. It's perfect for quick clean-ups and tough stains.\"), \n(\"Oven Mitts\", 9.99, 50, \"Heat-resistant oven mitts that protect your hands while cooking. They provide a secure grip and are easy to clean.\"), \n(\"Dish Drying Rack\", 14.99, 40, \"A space-saving dish drying rack that holds plates, cups, and utensils. It features a drip tray to catch excess water.\"), \n(\"Car Cleaning Kit\", 19.99, 30, \"A complete car cleaning kit that includes everything you need to keep your vehicle spotless. Perfect for car enthusiasts.\"), \n(\"Cleaning Supply Organizer\", 24.99, 20, \"An organizer that keeps all your cleaning supplies in one place. It features compartments for easy access and storage.\")]"