"[\n    (\"French Press\", 29.99, 150, \"A classic French press that brews rich and flavorful coffee. Its stainless steel design ensures durability and easy cleaning.\"),\n    (\"Electric Kettle\", 39.99, 80, \"This electric kettle heats water quickly and efficiently. With an automatic shut-off feature, it's perfect for tea lovers.\"),\n    (\"Coffee Grinder\", 49.99, 100, \"A compact coffee grinder that delivers a consistent grind for your favorite brew. Its sleek design fits perfectly on any countertop.\"),\n    (\"Pour Over Coffee Maker\", 24.99, 120, \"Enjoy a smooth and aromatic cup of coffee with this pour-over coffee maker. Its simple design allows for precise brewing.\"),\n    (\"Espresso Machine\", 299.99, 30, \"Craft barista-quality espresso at home with this powerful espresso machine. It features a built-in steam wand for frothing milk.\"),\n    (\"Tea Infuser\", 15.99, 200, \"This tea infuser allows you to brew loose leaf tea with ease. Its fine mesh ensures no leaves escape into your cup.\"),\n    (\"Coffee Scale\", 29.99, 90, \"Achieve the perfect brew with this digital coffee scale. It measures both weight and time for precision brewing.\"),\n    (\"Cold Brew Maker\", 34.99, 70, \"Brew smooth and refreshing cold brew coffee at home with this easy-to-use maker. Enjoy your favorite coffee chilled and ready to serve.\"),\n    (\"Travel Mug\", 19.99, 150, \"This insulated travel mug keeps your beverages hot or cold for hours. Its leak-proof design makes it perfect for on-the-go.\"),\n    (\"Coffee Carafe\", 39.99, 60, \"A stylish glass coffee carafe that enhances your coffee experience. Its elegant design is perfect for serving guests.\"),\n    (\"Milk Frother\", 24.99, 110, \"Create creamy froth for your lattes and cappuccinos with this handheld milk frother. It's easy to use and clean.\"),\n    (\"Tea Pot\", 34.99, 80, \"This ceramic tea pot is perfect for brewing your favorite tea. Its classic design adds elegance to any tea time.\"),\n    (\"Coffee Capsule Machine\", 199.99, 40, \"Enjoy a variety of coffee flavors with this convenient capsule machine. It brews coffee in minutes with minimal cleanup.\"),\n    (\"Coffee Filter\", 9.99, 300, \"These disposable coffee filters ensure a clean and flavorful brew every time. They fit most standard coffee makers.\"),\n    (\"Coffee Storage Canister\", 25.99, 75, \"Keep your coffee beans fresh with this airtight storage canister. Its sleek design and vacuum seal maintain optimal flavor.\"),\n    (\"Tea Sampler Set\", 29.99, 50, \"Explore a variety of teas with this sampler set. It includes different flavors to satisfy every tea lover's palate.\"),\n    (\"Coffee Mug Set\", 49.99, 60, \"This set of ceramic coffee mugs adds a touch of style to your kitchen. Each mug is uniquely designed for a personal touch.\"),\n    (\"Single Serve Coffee Maker\", 89.99, 45, \"Brew a single cup of coffee quickly and easily with this single serve maker. It's perfect for busy mornings.\"),\n    (\"Coffee Table Book\", 19.99, 100, \"This beautifully illustrated coffee table book explores the art of coffee. It's perfect for coffee enthusiasts and collectors.\"),\n    (\"Tea Strainer\", 12.99, 150, \"A stainless steel tea strainer for brewing loose leaf tea. Its fine mesh ensures a smooth cup without any leaves.\"),\n    (\"Coffee Pouring Kettle\", 39.99, 50, \"This gooseneck kettle allows for precise pouring, enhancing your coffee brewing technique. Its stylish design is perfect for any kitchen.\"),\n    (\"Coffee Stencils\", 9.99, 200, \"Add a personal touch to your coffee with these fun stencils. Perfect for creating beautiful designs on your cappuccinos.\"),\n    (\"Café Style Milk Steamer\", 49.99, 40, \"Create café-style frothed milk at home with this milk steamer. It's easy to use and perfect for lattes and cappuccinos.\"),\n    (\"Coffee Bean Subscription\", 19.99, 100, \"Enjoy freshly roasted coffee delivered to your door with a coffee bean subscription. Discover new flavors every month.\"),\n    (\"Matcha Whisk\", 14.99, 120, \"This traditional bamboo whisk is essential for preparing matcha tea. It creates a frothy and smooth blend with ease.\"),\n    (\"Coffee Press\", 29.99, 80, \"Experience the rich flavors of coffee with this durable coffee press. It's perfect for brewing multiple cups at once.\"),\n    (\"Tea Tumbler\", 22.99, 90, \"This insulated tea tumbler keeps your tea hot or cold for hours. Perfect for enjoying your favorite brew on the go.\"),\n    (\"Coffee Scoop\", 4.99, 300, \"This stainless steel coffee scoop ensures you measure the perfect amount of coffee every time. Its durable design will last for years.\"),\n    (\"Herbal Tea Infuser\", 16.99, 150, \"Brew your favorite herbal teas with this easy-to-use infuser. Its fine mesh allows for maximum flavor extraction.\"),\n    (\"Coffee Subscription Box\", 29.99, 60, \"Discover new coffee roasters with this monthly subscription box. Each box features unique blends and flavors.\"),\n    (\"Electric Coffee Grinder\", 39.99, 100, \"Grind your coffee beans to perfection with this electric grinder. Its adjustable settings allow for a customized grind.\"),\n    (\"Tea Bag Dispenser\", 19.99, 80, \"Keep your tea bags organized with this stylish dispenser. Its compact design fits easily on any countertop.\"),\n    (\"French Press Travel Mug\", 34.99, 70, \"Brew coffee on the go with this French press travel mug. It's perfect for camping or road trips.\"),\n    (\"Coffee Stirrers\", 5.99, 250, \"These eco-friendly coffee stirrers are perfect for mixing your favorite beverages. Made from sustainable materials.\"),\n    (\"Coffee Art Kit\", 29.99, 50, \"Create stunning coffee art with this coffee art kit. Perfect for impressing guests or enhancing your brewing experience.\"),\n    (\"Tea Brewing Kit\", 39.99, 40, \"This tea brewing kit includes everything you need for the perfect cup. It features a tea infuser, timer, and more.\"),\n    (\"Espresso Cups\", 24.99, 100, \"Enjoy your espresso in style with these elegant cups. Their unique design enhances the coffee experience.\"),\n    (\"Coffee Table\", 199.99, 20, \"A stylish coffee table that complements any living space. It features a built-in storage compartment for coffee essentials.\"),\n    (\"Tea Infusion Pitcher\", 34.99, 50, \"Brew and serve tea with this elegant infusion pitcher. Its glass design allows you to see the brewing process.\"),\n    (\"Coffee Recipe Book\", 19.99, 100, \"Explore new coffee recipes with this comprehensive book. Perfect for both novice and experienced coffee lovers.\"),\n    (\"Portable Espresso Maker\", 59.99, 30, \"Make espresso anywhere with this portable espresso maker. Its compact design is perfect for travel.\"),\n    (\"Coffee Coasters\", 9.99, 150, \"Protect your surfaces with these stylish coffee coasters. Made from durable materials, they are easy to clean.\"),\n    (\"Tea Tasting Set\", 39.99, 40, \"Experience a variety of teas with this tasting set. Perfect for hosting tea parties or exploring new flavors.\"),\n    (\"Coffee Bean Roaster\", 299.99, 10, \"Roast your own coffee beans at home with this professional-grade roaster. Enjoy fresh coffee like never before.\"),\n    (\"Coffee Travel Kit\", 49.99, 50, \"This travel kit includes everything you need for coffee on the go. Perfect for camping or road trips.\"),\n    (\"Tea Storage Jar\", 15.99, 150, \"Keep your loose leaf tea fresh with this airtight storage jar. Its elegant design adds charm to your kitchen.\"),\n    (\"Coffee Flavoring Syrups\", 12.99, 200, \"Add a splash of flavor to your coffee with these gourmet syrups. Available in a variety of delicious flavors.\"),\n    (\"Coffee Filter Holder\", 19.99, 100, \"Organize your coffee filters with this stylish holder. Its compact design fits easily in any kitchen.\"),\n    (\"Tea Infuser Bottle\", 24.99, 80, \"Brew tea on the go with this infuser bottle. Its double-wall design keeps your tea hot while preventing burns.\"),\n    (\"Coffee Press Pot\", 39.99, 60, \"This elegant coffee press pot brews up to 8 cups of coffee. Its stainless steel design ensures durability.\"),\n    (\"Coffee Beans Variety Pack\", 29.99, 50, \"Sample different coffee beans with this variety pack. Perfect for discovering your new favorite blend.\"),\n    (\"Tea Infuser Mug\", 22.99, 90, \"Enjoy your tea with this infuser mug that combines style and functionality. Its built-in infuser makes brewing easy.\"),\n    (\"Coffee Table Runner\", 19.99, 100, \"Add a touch of elegance to your coffee table with this stylish runner. It's perfect for displaying your coffee setup.\"),\n    (\"Coffee and Tea Gift Basket\", 49.99, 30, \"Surprise a loved one with this beautifully arranged gift basket. It includes a selection of gourmet coffee and tea.\"),\n    (\"Reusable Coffee Filter\", 12.99, 200, \"Reduce waste with this reusable coffee filter. It's easy to clean and compatible with most coffee makers.\"),\n    (\"Coffee Creamer Dispenser\", 24.99, 50, \"Serve your coffee creamer in style with this elegant dispenser. Its airtight design keeps cream fresh.\"),\n    (\"Tea Brewing Timer\", 9.99, 150, \"Perfect your tea brewing with this handy timer. It ensures you steep your tea for the ideal amount of time.\"),\n    (\"Coffee Cup Warmer\", 19.99, 100, \"Keep your coffee warm with this electric cup warmer. It's perfect for long workdays or leisurely mornings.\"),\n    (\"Coffee Pour Over Set\", 34.99, 40, \"This pour-over set includes everything you need for a perfect brew. Enjoy a rich and flavorful cup of coffee.\"),\n    (\"Electric Tea Kettle\", 39.99, 80, \"Boil water quickly with this electric tea kettle. Its sleek design and automatic shut-off make it a kitchen essential.\"),\n    (\"Coffee Mug Warmer\", 24.99, 100, \"Keep your coffee at the perfect temperature with this mug warmer. Ideal for busy professionals.\"),\n    (\"Tea Tasting Journal\", 12.99, 150, \"Document your tea tasting experiences with this journal. Perfect for tea enthusiasts looking to explore new flavors.\"),\n    (\"Coffee Siphon\", 49.99, 30, \"Experience a unique brewing method with this coffee siphon. It creates a theatrical coffee-making experience.\"),\n    (\"Coffee and Tea Infuser\", 19.99, 100, \"This versatile infuser allows you to brew both coffee and tea. Its compact design makes it perfect for any kitchen.\"),\n    (\"Coffee Bean Storage Bag\", 9.99, 200, \"Keep your coffee beans fresh with this resealable storage bag. Its design prevents air and moisture from entering.\"),\n    (\"Tea Infuser Spoon\", 6.99, 250, \"Brew loose leaf tea easily with this infuser spoon. Its compact size makes it perfect for travel.\"),\n    (\"Coffee Press Filter\", 12.99, 150, \"Ensure a clean brew with these coffee press filters. They fit most standard French presses.\"),\n    (\"Tea Infuser Basket\", 14.99, 100, \"Brew your favorite loose leaf tea with this infuser basket. Its fine mesh allows for maximum flavor extraction.\"),\n    (\"Coffee Dripper\", 29.99, 70, \"This coffee dripper allows for a smooth and flavorful brew. Its simple design is perfect for beginners.\"),\n    (\"Coffee and Tea Gift Set\", 39.99, 50, \"This gift set includes a selection of premium coffee and tea. Perfect for gifting or treating yourself.\"),\n    (\"Tea Brewing Pitcher\", 34.99, 40, \"Brew and serve tea with this elegant brewing pitcher. Its glass design allows you to see the brewing process.\"),\n    (\"Coffee Aroma Kit\", 19.99, 100, \"Enhance your coffee experience with this aroma kit. It includes various scents to elevate your tasting.\"),\n    (\"Coffee Filter Cone\", 9.99, 200, \"This coffee filter cone is perfect for brewing single cups of coffee. Its design ensures a clean and flavorful brew.\"),\n    (\"Tea Infuser Bottle with Strainer\", 22.99, 90, \"Brew your favorite tea on the go with this infuser bottle. Its built-in strainer ensures a smooth cup.\"),\n    (\"Coffee Mug Warmer Set\", 34.99, 60, \"Keep your coffee warm with this mug warmer set. Perfect for home or office use.\"),\n    (\"Coffee Bean Grinder\", 44.99, 100, \"Grind your coffee beans to perfection with this high-quality grinder. It's an essential tool for coffee lovers.\"),\n    (\"Tea Caddy\", 19.99, 80, \"Store your tea bags stylishly with this elegant tea caddy. Its compact design fits perfectly in any kitchen.\"),\n    (\"Coffee and Tea Pairing Guide\", 12.99, 150, \"Discover the perfect pairings for coffee and tea with this guide. Ideal for enhancing your beverage experience.\")\n]"