"[(\"Pirate Costume\", 29.99, 100, \"Transform into a swashbuckling pirate with this detailed costume. It includes a shirt, pants, and a pirate hat for a complete look.\"), \n(\"Fairy Wings\", 15.99, 150, \"Add a touch of magic to your outfit with these beautiful fairy wings. Lightweight and colorful, they're perfect for any fairy-themed party.\"), \n(\"Superhero Cape\", 19.99, 200, \"Become your favorite superhero with this vibrant cape. It's made from durable fabric and is perfect for dress-up or themed events.\"), \n(\"Vampire Fangs\", 5.99, 300, \"Complete your vampire look with these realistic fangs. They are easy to wear and perfect for Halloween or costume parties.\"), \n(\"Witch Hat\", 12.99, 180, \"This classic witch hat is a must-have for any Halloween costume. Its tall, pointed design adds an authentic touch to your witch ensemble.\"), \n(\"Clown Wig\", 9.99, 250, \"Bring laughter to the party with this colorful clown wig. Its bright colors will make you the life of the event.\"), \n(\"Bunny Ears Headband\", 7.99, 220, \"Hop into the fun with these adorable bunny ears. Perfect for Easter or any costume party, they add a playful touch.\"), \n(\"Zombie Makeup Kit\", 24.99, 80, \"Transform into a terrifying zombie with this comprehensive makeup kit. It includes everything you need for a ghoulish look.\"), \n(\"Hawaiian Leis\", 4.99, 500, \"Celebrate in style with these colorful Hawaiian leis. Ideal for luau parties, they add a festive touch to any gathering.\"), \n(\"Elf Costume\", 34.99, 75, \"Become a festive elf with this charming costume. It includes a green tunic, pants, and a pointy hat, perfect for holiday events.\"), \n(\"Skeleton Bodysuit\", 39.99, 60, \"Stand out in this eye-catching skeleton bodysuit. It's perfect for Halloween parties and features a glow-in-the-dark design.\"), \n(\"Princess Tiara\", 8.99, 300, \"Feel like royalty with this sparkling princess tiara. Perfect for dress-up or birthday parties, it adds a touch of elegance.\"), \n(\"Dinosaur Costume\", 49.99, 40, \"Roar into the party with this fun dinosaur costume. It's designed for comfort and is sure to impress fellow party-goers.\"), \n(\"Pirate Eye Patch\", 3.99, 400, \"Complete your pirate look with this classic eye patch. Lightweight and easy to wear, it's a great accessory for any pirate costume.\"), \n(\"Mermaid Tail Blanket\", 29.99, 90, \"Cozy up in this enchanting mermaid tail blanket. It's perfect for snuggling on the couch or for themed parties.\"), \n(\"Space Alien Costume\", 35.99, 55, \"Become an extraterrestrial with this fun space alien costume. It features metallic accents and is sure to turn heads.\"), \n(\"Toga Costume\", 19.99, 120, \"Join the toga party with this classic costume. Made from soft fabric, it's comfortable and easy to wear.\"), \n(\"Dragon Wings\", 22.99, 70, \"Fly into fantasy with these stunning dragon wings. They're perfect for a variety of costumes and add an impressive flair.\"), \n(\"Scarecrow Costume\", 27.99, 65, \"Embrace the harvest season with this charming scarecrow costume. It's complete with a hat and straw accents for authenticity.\"), \n(\"Bumblebee Costume\", 34.99, 50, \"Buzz around in this adorable bumblebee costume. It's perfect for kids and adults alike, featuring fun stripes and wings.\"), \n(\"Ladybug Dress\", 24.99, 85, \"This cute ladybug dress is perfect for little ones. It's bright, cheerful, and perfect for any costume occasion.\"), \n(\"Ghost Costume\", 14.99, 150, \"This classic ghost costume is a Halloween staple. Made from lightweight fabric, it's easy to wear and spooky!\" ), \n(\"Ninja Costume\", 39.99, 45, \"Become a stealthy ninja with this complete costume. It includes a mask and weapons for an authentic look.\"), \n(\"Star Wars Jedi Robe\", 49.99, 30, \"Join the Jedi with this iconic robe. It's perfect for fans of the franchise and makes for a great costume.\"), \n(\"Football Player Costume\", 29.99, 70, \"Show your team spirit with this football player costume. It comes with a jersey, pants, and a helmet for a complete look.\"), \n(\"Retro Disco Outfit\", 39.99, 50, \"Get groovy with this retro disco outfit. With its flashy colors and patterns, it's perfect for any dance party.\"), \n(\"Frog Costume\", 32.99, 40, \"Leap into fun with this cute frog costume. It's soft and comfortable, making it great for dress-up or themed events.\"), \n(\"Construction Worker Costume\", 24.99, 60, \"Build your look with this construction worker costume. It includes a hard hat and reflective vest for authenticity.\"), \n(\"Ballerina Tutu\", 19.99, 80, \"Dance into the spotlight with this beautiful ballerina tutu. It's perfect for performances or dress-up play.\"), \n(\"Spooky Spider Decoration\", 10.99, 200, \"Add a creepy touch to your Halloween decor with this spooky spider. It's large and realistic, perfect for scaring guests.\"), \n(\"Christmas Elf Costume\", 29.99, 55, \"Spread holiday cheer with this festive Christmas elf costume. It features a colorful design that's perfect for parties.\"), \n(\"Vintage Clown Costume\", 39.99, 35, \"Step back in time with this vintage clown costume. It’s playful and nostalgic, perfect for a themed event.\"), \n(\"Sailor Costume\", 34.99, 45, \"Set sail for adventure with this classic sailor costume. It’s stylish and perfect for nautical-themed parties.\"), \n(\"Fairy Godmother Costume\", 45.99, 30, \"Make dreams come true with this enchanting fairy godmother costume. It features a beautiful gown and wand.\"), \n(\"Mummy Costume\", 27.99, 50, \"Wrap yourself in fun with this mummy costume. It's perfect for Halloween and features tattered bandages for a spooky effect.\"), \n(\"Cinderella Dress\", 49.99, 20, \"Become a princess with this stunning Cinderella dress. It's perfect for dress-up or themed parties.\"), \n(\"Viking Helmet\", 14.99, 150, \"Complete your Viking costume with this iconic helmet. It's durable and features classic horns for authenticity.\"), \n(\"Mad Hatter Hat\", 19.99, 75, \"Add a whimsical touch to your outfit with this Mad Hatter hat. It's perfect for tea parties or costume events.\"), \n(\"Santa Claus Costume\", 59.99, 25, \"Bring holiday cheer with this classic Santa Claus costume. It includes a red suit, hat, and belt for a festive look.\"), \n(\"Alien Mask\", 9.99, 200, \"Transform your look with this fun alien mask. It's perfect for sci-fi themed parties and adds a unique touch.\"), \n(\"T-Rex Inflatable Costume\", 79.99, 15, \"Become the king of the dinosaurs with this inflatable T-Rex costume. It's hilarious and sure to be a hit at any party.\"), \n(\"Hula Skirt\", 12.99, 300, \"Get ready for a luau with this colorful hula skirt. It's perfect for beach parties or tropical-themed events.\"), \n(\"Grim Reaper Costume\", 39.99, 35, \"Embrace the dark side with this Grim Reaper costume. It features a hooded robe and scythe for a chilling effect.\"), \n(\"Bachelorette Party Sashes\", 10.99, 150, \"Celebrate the bride-to-be with these fun bachelorette party sashes. They add a special touch to any party.\"), \n(\"Pikachu Costume\", 34.99, 50, \"Become everyone's favorite Pokémon with this Pikachu costume. It's cute and perfect for fans of all ages.\"), \n(\"Harry Potter Wand\", 12.99, 200, \"Cast spells with this authentic Harry Potter wand. It's a great accessory for any wizarding costume.\"), \n(\"Glow in the Dark Skeleton Costume\", 29.99, 45, \"Stand out at night with this glow in the dark skeleton costume. It's perfect for Halloween and sure to impress.\"), \n(\"Circus Ringmaster Costume\", 54.99, 20, \"Take center stage with this circus ringmaster costume. It features a stylish jacket and top hat for a dramatic look.\"), \n(\"Rock Star Costume\", 39.99, 30, \"Live out your rock star dreams with this flashy costume. It's perfect for concerts or themed parties.\"), \n(\"Glow Stick Bracelets\", 5.99, 400, \"Light up the night with these fun glow stick bracelets. They're perfect for parties and festivals.\"), \n(\"Cat Ears Headband\", 6.99, 250, \"Add a playful touch to your outfit with this cat ears headband. It's great for costume parties or everyday wear.\"), \n(\"Minnie Mouse Costume\", 34.99, 40, \"Become the iconic Minnie Mouse with this adorable costume. It features her signature polka dots and bow.\"), \n(\"Wizard Robe\", 49.99, 30, \"Channel your inner wizard with this stylish robe. It's perfect for Halloween or any magical event.\"), \n(\"Giant Inflatable Unicorn\", 89.99, 10, \"Make a splash with this giant inflatable unicorn. Perfect for pool parties, it's sure to be a crowd-pleaser.\"), \n(\"Monster Costume\", 32.99, 50, \"Become a friendly monster with this fun costume. It's colorful and comfortable, perfect for kids and adults alike.\"), \n(\"Jester Costume\", 39.99, 35, \"Bring laughter to the party with this colorful jester costume. It's playful and perfect for any festive occasion.\"), \n(\"Tropical Flower Crown\", 14.99, 200, \"Add a touch of paradise to your outfit with this tropical flower crown. It's perfect for beach parties and luaus.\"), \n(\"Firefighter Costume\", 29.99, 60, \"Save the day with this firefighter costume. It includes a jacket, helmet, and accessories for a heroic look.\"), \n(\"Gothic Vampire Costume\", 44.99, 25, \"Embrace the dark side with this gothic vampire costume. It features elegant details and a dramatic cape.\"), \n(\"Cactus Costume\", 29.99, 50, \"Stand out at the party with this unique cactus costume. It's fun and perfect for a desert-themed event.\"), \n(\"Spider Web Tablecloth\", 12.99, 180, \"Set the mood for Halloween with this spooky spider web tablecloth. It's perfect for decorating your party table.\"), \n(\"Retro 80s Costume\", 39.99, 40, \"Travel back to the 80s with this vibrant retro costume. It's colorful and perfect for themed parties.\"), \n(\"Fireworks Party Poppers\", 9.99, 250, \"Add excitement to your celebration with these fireworks party poppers. They're perfect for birthdays and New Year's Eve.\"), \n(\"Panda Costume\", 34.99, 50, \"Become a cute panda with this cozy costume. It's perfect for themed parties or just for fun.\"), \n(\"Skeleton Gloves\", 7.99, 300, \"Complete your skeleton costume with these fun gloves. They add a spooky touch to any Halloween outfit.\"), \n(\"Renaissance Dress\", 49.99, 20, \"Step back in time with this beautiful Renaissance dress. It's perfect for themed events and historical reenactments.\"), \n(\"Creepy Clown Costume\", 39.99, 30, \"Frighten your friends with this creepy clown costume. It's colorful yet spooky, perfect for Halloween.\"), \n(\"Superhero Mask\", 6.99, 250, \"Complete your superhero look with this fun mask. It's comfortable and perfect for dress-up.\"), \n(\"Bachelorette Party Photo Props\", 14.99, 150, \"Capture memories with these fun bachelorette party photo props. They're perfect for adding a playful touch to photos.\"), \n(\"Tropical Paradise Costume\", 34.99, 45, \"Embrace the beach vibes with this tropical paradise costume. It's colorful and perfect for summer parties.\"), \n(\"Dragon Costume\", 39.99, 35, \"Become a fierce dragon with this fun costume. It's perfect for fantasy-themed events and dress-up.\"), \n(\"Glow in the Dark Face Paint\", 8.99, 200, \"Get creative with this glow in the dark face paint. It's perfect for Halloween and adds a unique touch to your look.\"), \n(\"Bunny Costume\", 29.99, 50, \"Hop into fun with this adorable bunny costume. It's perfect for Easter celebrations or costume parties.\"), \n(\"Space Explorer Costume\", 34.99, 40, \"Blast off into adventure with this space explorer costume. It's perfect for kids who dream of becoming astronauts.\"), \n(\"Hocus Pocus Witch Costume\", 39.99, 30, \"Channel your inner witch with this Hocus Pocus-inspired costume. It's fun and perfect for Halloween.\"), \n(\"Fairy Tale Prince Costume\", 44.99, 25, \"Become a charming prince with this fairy tale prince costume. It's perfect for themed parties and dress-up.\"), \n(\"Pirate Treasure Chest\", 24.99, 70, \"Store your treasures in this fun pirate treasure chest. It's perfect for party decorations or as a prop.\"), \n(\"Shark Costume\", 32.99, 50, \"Swim into fun with this adorable shark costume. It's perfect for beach parties or Halloween.\"), \n(\"Creepy Doll Costume\", 39.99, 30, \"Frighten your friends with this creepy doll costume. It's perfect for Halloween and adds a spooky touch.\"), \n(\"Hawaiian Shirt\", 19.99, 150, \"Get ready for a luau with this colorful Hawaiian shirt. It's perfect for beach parties and summer events.\"), \n(\"Bee Costume\", 34.99, 40, \"Buzz around in this adorable bee costume. It's perfect for kids and adds a fun touch to any event.\"), \n(\"Vampire Cloak\", 14.99, 200, \"Complete your vampire look with this dramatic cloak. It's perfect for Halloween and adds an elegant touch.\"), \n(\"Circus Animal Costume\", 39.99, 30, \"Step right up with this fun circus animal costume. It's colorful and perfect for themed parties.\"), \n(\"Magic Wand\", 8.99, 250, \"Cast spells with this enchanting magic wand. It's a great accessory for any fairy tale costume.\"), \n(\"Hen Party Accessories\", 12.99, 150, \"Celebrate the bride-to-be with these fun hen party accessories. They're perfect for adding a playful touch to the celebration.\"), \n(\"Cowboy Hat\", 19.99, 180, \"Complete your cowboy look with this classic cowboy hat. It's perfect for themed events and adds a rugged touch.\"), \n(\"Space Alien Costume\", 34.99, 50, \"Become an intergalactic traveler with this fun space alien costume. It's perfect for sci-fi themed parties.\"), \n(\"Tropical Beach Ball\", 9.99, 300, \"Make a splash with this colorful tropical beach ball. It's perfect for pool parties and summer fun.\"), \n(\"Funky 70s Costume\", 39.99, 40, \"Get groovy with this funky 70s costume. It's perfect for disco parties and retro-themed events.\"), \n(\"Fairy Dust Glitter\", 7.99, 200, \"Add a touch of magic with this fairy dust glitter. It's perfect for decorating costumes or party favors.\"), \n(\"Scary Clown Mask\", 12.99, 150, \"Frighten your friends with this scary clown mask. It's perfect for Halloween or horror-themed parties.\"), \n(\"Rainbow Unicorn Costume\", 44.99, 25, \"Become a magical unicorn with this colorful costume. It's perfect for kids and adds a whimsical touch.\"), \n(\"Pirate Flag\", 9.99, 300, \"Show your pirate spirit with this fun pirate flag. It's perfect for decorating your party or as a prop.\"), \n(\"Jungle Explorer Costume\", 34.99, 40, \"Embark on an adventure with this jungle explorer costume. It's perfect for themed parties and dress-up.\"), \n(\"Magic Potion Bottles\", 10.99, 200, \"Add a mystical touch to your decor with these magic potion bottles. They're perfect for Halloween or themed parties.\"), \n(\"Tropical Fruit Headband\", 14.99, 150, \"Add a fruity flair to your outfit with this tropical fruit headband. It's perfect for beach parties and summer events.\"), \n(\"Giant Inflatable Banana\", 49.99, 20, \"Make a statement with this giant inflatable banana. It's perfect for summer parties and adds a fun touch.\"), \n(\"Pirate Sword\", 9.99, 250, \"Complete your pirate look with this fun pirate sword. It's lightweight and perfect for dress-up.\"), \n(\"Fairy Princess Costume\", 39.99, 30, \"Become a magical fairy princess with this enchanting costume. It's perfect for dress-up and themed parties.\"), \n(\"Monster Mask\", 12.99, 150, \"Transform into a scary monster with this fun mask. It's perfect for Halloween and adds a spooky touch.\"), \n(\"Dinosaur Hat\", 14.99, 100, \"Bring out your inner dinosaur with this fun dinosaur hat. It's perfect for kids and adds a playful touch.\"), \n(\"Hula Hoop\", 19.99, 200, \"Get moving with this colorful hula hoop. It's perfect for parties or just for fun.\"), \n(\"Shimmering Mermaid Costume\", 44.99, 25, \"Dive into adventure with this shimmering mermaid costume. It's perfect for beach parties and dress-up.\"), \n(\"Fairytale Witch Costume\", 39.99, 30, \"Become a whimsical witch with this fairytale witch costume. It's perfect for Halloween and adds a magical touch.\"), \n(\"Giant Inflatable Octopus\", 89.99, 10, \"Make a splash with this giant inflatable octopus. Perfect for pool parties, it's sure to be a hit!\" )]"