"[(\"Acrylic Paint Set\", 29.99, 150, \"This set includes 24 vibrant acrylic colors that are perfect for artists of all skill levels. The paints are water-based and easy to clean up, making them ideal for both canvas and craft projects.\"), \n(\"Watercolor Paper Pad\", 19.99, 80, \"A high-quality watercolor paper pad with 20 sheets of 200 gsm paper. It is perfect for watercolor painting, sketching, and mixed media projects.\"), \n(\"Knitting Yarn Bundle\", 34.99, 120, \"This bundle includes five skeins of soft, durable knitting yarn in various colors. Ideal for knitting and crocheting projects, it offers excellent stitch definition and warmth.\"), \n(\"Craft Scissors\", 12.99, 200, \"These precision craft scissors feature stainless steel blades for clean cuts. Perfect for paper, fabric, and other crafting materials, they are a must-have for any crafter.\"), \n(\"Glue Gun Kit\", 24.99, 75, \"This glue gun kit includes a high-temperature glue gun and 20 glue sticks. It's perfect for all your crafting needs, from quick repairs to intricate projects.\"), \n(\"Beading Supplies Set\", 22.99, 60, \"A complete beading supplies set featuring assorted beads, strings, and tools. Perfect for jewelry making and other creative projects, this set inspires endless creativity.\"), \n(\"Embroidery Thread Set\", 15.99, 100, \"This set contains 50 vibrant colors of embroidery thread, perfect for all your sewing and embroidery projects. The threads are durable and easy to work with, ensuring beautiful results.\"), \n(\"Canvas Art Panels\", 39.99, 40, \"This pack includes 6 pre-stretched canvas art panels in various sizes. Ideal for painting and mixed media projects, they provide a sturdy surface for your creativity.\"), \n(\"Scrapbooking Kit\", 49.99, 30, \"A complete scrapbooking kit with decorative papers, stickers, and tools. Perfect for preserving memories, this kit offers endless possibilities for creativity.\"), \n(\"Modeling Clay Pack\", 19.99, 150, \"This pack includes 12 colors of non-toxic modeling clay that is easy to mold and shape. Ideal for kids and adults alike, it encourages creativity and fine motor skills.\"), \n(\"Calligraphy Pen Set\", 27.99, 70, \"This elegant calligraphy pen set includes four different nibs and a variety of ink colors. Perfect for invitations, cards, and personalized gifts, it adds a touch of sophistication.\"), \n(\"Craft Storage Box\", 18.99, 90, \"A spacious craft storage box with multiple compartments for organizing your supplies. Its sturdy design makes it perfect for home or on-the-go crafting.\"), \n(\"Origami Paper Pack\", 14.99, 110, \"This pack includes 100 sheets of colorful origami paper in various sizes. Perfect for creating intricate paper designs, it inspires creativity and fine motor skills.\"), \n(\"Sewing Machine\", 199.99, 25, \"This user-friendly sewing machine is perfect for beginners and advanced sewers alike. With multiple stitch patterns and easy threading, it makes sewing projects a breeze.\"), \n(\"Leather Craft Kit\", 34.99, 50, \"This kit includes all the tools and materials needed for leather crafting. Perfect for creating wallets, bags, and other accessories, it inspires creativity and craftsmanship.\"), \n(\"Stencils Set\", 12.99, 100, \"This set of 10 reusable stencils is perfect for adding designs to your crafts. Made from durable plastic, they are easy to clean and use with various mediums.\"), \n(\"Chalkboard Paint\", 23.99, 40, \"This chalkboard paint allows you to transform any surface into a writable chalkboard. Perfect for home decor and organization, it adds a fun and functional touch.\"), \n(\"Fabric Bundle\", 29.99, 80, \"This fabric bundle includes 10 different patterns of high-quality cotton fabric. Perfect for quilting, sewing, and crafting, it offers endless creative possibilities.\"), \n(\"Stamping Set\", 16.99, 90, \"This stamping set includes various designs and a clear acrylic block for easy stamping. Perfect for card making and scrapbooking, it adds a personal touch to your projects.\"), \n(\"Pencil Case\", 9.99, 150, \"This stylish pencil case is perfect for organizing your art supplies. With multiple compartments, it keeps everything neatly stored and easily accessible.\"), \n(\"Miniature Dollhouse Kit\", 49.99, 20, \"This miniature dollhouse kit allows you to build and decorate your own tiny home. It includes all the materials needed for a fun and engaging crafting experience.\"), \n(\"Decoupage Glue\", 12.99, 100, \"This decoupage glue is perfect for adhering paper and fabric to various surfaces. It dries clear and provides a durable finish, making it ideal for all your crafting needs.\"), \n(\"Silicone Molds Set\", 25.99, 60, \"This set includes 10 silicone molds for making unique shapes in resin, soap, or baking. Flexible and easy to use, they inspire creativity in various crafting projects.\"), \n(\"Crafting Tweezers\", 8.99, 130, \"These precision crafting tweezers are perfect for handling small items with ease. Ideal for scrapbooking, model building, and more, they are a must-have tool.\"), \n(\"Paintbrush Set\", 18.99, 100, \"This paintbrush set includes a variety of brush sizes and shapes for all your painting needs. Made with high-quality bristles, they provide excellent control and precision.\"), \n(\"Dye Kit for Fabrics\", 24.99, 40, \"This fabric dye kit includes everything you need to create vibrant colors on your fabrics. Perfect for upcycling and creating custom pieces, it allows for endless creativity.\"), \n(\"Quilling Paper Strips\", 14.99, 120, \"This pack includes 100 strips of colorful quilling paper for creating intricate designs. Perfect for card making and scrapbooking, it adds a unique touch to your projects.\"), \n(\"Candle Making Kit\", 39.99, 30, \"This candle making kit includes all the supplies needed to create beautiful candles at home. Perfect for gifts or home decor, it inspires creativity and relaxation.\"), \n(\"Coloring Book for Adults\", 12.99, 200, \"This intricate coloring book features beautiful designs to help you unwind and express your creativity. Perfect for stress relief, it provides hours of artistic enjoyment.\"), \n(\"T-shirt Transfer Paper\", 19.99, 100, \"This transfer paper allows you to print custom designs onto T-shirts and other fabrics. Easy to use, it helps you create personalized clothing and gifts.\"), \n(\"Felt Craft Kit\", 22.99, 70, \"This felt craft kit includes colorful felt sheets and tools for creating fun projects. Perfect for kids and adults alike, it encourages creativity and hands-on learning.\"), \n(\"Mosaic Tile Kit\", 29.99, 50, \"This mosaic tile kit includes a variety of colorful tiles for creating stunning art pieces. Perfect for home decor projects, it inspires creativity and artistic expression.\"), \n(\"Wooden Craft Sticks\", 9.99, 150, \"These wooden craft sticks are perfect for a variety of crafting projects. Ideal for building models, puppets, and more, they are a versatile addition to your supplies.\"), \n(\"Sponge Brushes Set\", 14.99, 80, \"This set includes 12 sponge brushes in various sizes for painting and crafting. Perfect for applying paint evenly, they are a great tool for any artist.\"), \n(\"Craft Foam Sheets\", 19.99, 100, \"These colorful craft foam sheets are perfect for a variety of projects. Easy to cut and shape, they are ideal for scrapbooking, school projects, and more.\"), \n(\"Natural Dyes Kit\", 34.99, 25, \"This kit includes natural dyes made from plants for creating unique colors on fabrics. Perfect for eco-friendly crafting, it inspires creativity and sustainability.\"), \n(\"Fabric Glue\", 10.99, 90, \"This fabric glue is perfect for bonding fabric and embellishments without sewing. It dries clear and flexible, making it ideal for all your fabric projects.\"), \n(\"Paper Mache Kit\", 29.99, 40, \"This paper mache kit includes everything you need to create fun and unique sculptures. Perfect for kids and adults, it encourages creativity and hands-on learning.\"), \n(\"Rhinestone Embellishments\", 15.99, 100, \"These sparkling rhinestone embellishments are perfect for adding a touch of glamour to your crafts. Ideal for scrapbooking, card making, and more, they inspire creativity.\"), \n(\"Sewing Patterns Book\", 19.99, 50, \"This book features a variety of sewing patterns for clothing and accessories. Perfect for beginners and experienced sewers alike, it provides inspiration and guidance.\"), \n(\"Crafting Tape Set\", 12.99, 150, \"This set of decorative crafting tape includes various colors and patterns. Perfect for scrapbooking, card making, and gift wrapping, it adds a unique touch to your projects.\"), \n(\"Stitching Needles Assortment\", 8.99, 200, \"This assortment of stitching needles includes various sizes for different projects. Perfect for sewing, quilting, and embroidery, it is a must-have for any crafter.\"), \n(\"DIY Jewelry Making Kit\", 39.99, 30, \"This DIY jewelry making kit includes everything you need to create stunning accessories. Perfect for beginners and experienced crafters, it encourages creativity and self-expression.\"), \n(\"Paint Palette\", 9.99, 120, \"This paint palette features multiple wells for mixing colors. Perfect for artists of all levels, it makes the painting process easy and organized.\"), \n(\"Crafting Bookshelf\", 49.99, 20, \"This stylish crafting bookshelf is perfect for organizing your supplies. With multiple shelves, it keeps everything neatly stored and easily accessible.\"), \n(\"Stamp Ink Pad Set\", 14.99, 90, \"This set includes 6 colorful ink pads for stamping projects. Perfect for card making and scrapbooking, it adds a vibrant touch to your crafts.\"), \n(\"Sewing Clips\", 10.99, 150, \"These sewing clips are perfect for holding fabric together without damaging it. Ideal for quilting and sewing projects, they are a great alternative to pins.\"), \n(\"Cork Board Tiles\", 19.99, 80, \"These cork board tiles are perfect for creating a customizable bulletin board. Ideal for home or office use, they provide a practical and stylish solution for organization.\"), \n(\"Watercolor Brush Pens\", 24.99, 60, \"These watercolor brush pens allow you to create beautiful watercolor effects with ease. Perfect for artists and crafters, they are versatile and easy to use.\"), \n(\"Faux Leather Sheets\", 22.99, 40, \"These faux leather sheets are perfect for a variety of crafting projects. Ideal for making bags, wallets, and accessories, they offer a stylish and cruelty-free option.\"), \n(\"Crafting Magnifying Glass\", 15.99, 100, \"This crafting magnifying glass is perfect for detailed work and precision crafting. With a comfortable handle, it makes intricate projects easier to manage.\"), \n(\"DIY Soap Making Kit\", 34.99, 30, \"This DIY soap making kit includes all the materials needed to create beautiful, fragrant soaps at home. Perfect for gifts or personal use, it inspires creativity and relaxation.\"), \n(\"Colorful Washi Tape\", 11.99, 120, \"This colorful washi tape is perfect for decorating journals, planners, and crafts. Easy to use and reposition, it adds a fun and creative touch to any project.\"), \n(\"Plastic Canvas Kit\", 19.99, 70, \"This plastic canvas kit includes everything you need to create beautiful needlepoint projects. Perfect for beginners and experienced crafters, it inspires creativity and relaxation.\"), \n(\"Artistic Sketchbook\", 16.99, 100, \"This artistic sketchbook features high-quality paper for drawing and sketching. Perfect for artists of all levels, it provides a blank canvas for your imagination.\"), \n(\"Crafting Apron\", 24.99, 50, \"This crafting apron features multiple pockets for storing tools and supplies. Ideal for keeping your clothes clean while working on projects, it combines style and functionality.\"), \n(\"Glitter Glue Set\", 10.99, 150, \"This glitter glue set includes 12 colors of glitter glue for adding sparkle to your crafts. Perfect for kids and adults, it inspires creativity and fun.\"), \n(\"Bamboo Sketching Pencils\", 19.99, 80, \"This set of bamboo sketching pencils is perfect for artists who appreciate eco-friendly materials. They offer a smooth writing experience and are ideal for sketching and drawing.\"), \n(\"Crafting Iron\", 29.99, 30, \"This crafting iron is perfect for applying heat to fabric and other materials. Ideal for ironing out wrinkles or applying heat transfer designs, it is a versatile tool.\"), \n(\"Fabric Markers\", 15.99, 100, \"These fabric markers are perfect for adding custom designs to clothing and accessories. They are permanent, washable, and come in a variety of vibrant colors.\"), \n(\"DIY Candle Kit\", 34.99, 40, \"This DIY candle kit includes everything you need to create beautiful scented candles at home. Perfect for gifts or home decor, it inspires creativity and relaxation.\"), \n(\"Burlap Fabric Roll\", 19.99, 60, \"This burlap fabric roll is perfect for a variety of crafting projects. Ideal for home decor, gift wrapping, and more, it adds a rustic touch to your creations.\"), \n(\"Art Supply Organizer\", 22.99, 50, \"This art supply organizer features multiple compartments for storing your crafting materials. Perfect for keeping everything neat and tidy, it makes crafting more enjoyable.\"), \n(\"Foil Transfer Kit\", 29.99, 30, \"This foil transfer kit allows you to add metallic accents to your crafts. Perfect for card making and scrapbooking, it provides a luxurious touch to your projects.\"), \n(\"Kids Crafting Kit\", 24.99, 70, \"This kids crafting kit includes a variety of materials for fun and creative projects. Perfect for encouraging creativity, it provides hours of entertainment for children.\"), \n(\"Wooden Bead Set\", 12.99, 100, \"This set includes 200 wooden beads in various shapes and sizes for crafting jewelry and decorations. Perfect for kids and adults, it inspires creativity and hands-on learning.\"), \n(\"DIY Tie-Dye Kit\", 34.99, 30, \"This DIY tie-dye kit includes everything you need to create colorful designs on T-shirts and other fabrics. Perfect for parties and family activities, it inspires creativity and fun.\"), \n(\"Silk Flowers Kit\", 19.99, 50, \"This silk flowers kit includes a variety of realistic-looking flowers for crafting beautiful arrangements. Perfect for home decor and special occasions, it adds a touch of elegance.\"), \n(\"Paper Cutting Tools\", 14.99, 90, \"This set of paper cutting tools includes precision knives and blades for intricate designs. Perfect for scrapbooking and card making, it inspires creativity and attention to detail.\"), \n(\"Crafting Bookmarks\", 9.99, 150, \"These crafting bookmarks are perfect for personalizing your reading experience. Ideal for gifts or keeping track of your favorite books, they are a fun and creative project.\")]"