"[(\"Mountain Bike\", 899.99, 30, \"A rugged mountain bike designed for off-road adventures. It features durable tires and a lightweight frame for maximum performance on tough terrains.\"), \n(\"Road Bike\", 1299.99, 25, \"An aerodynamic road bike built for speed and efficiency. With its lightweight construction and advanced gearing system, it's perfect for long-distance rides.\"), \n(\"Hybrid Bike\", 499.99, 40, \"A versatile hybrid bike that combines features of road and mountain bikes. It's great for commuting and recreational riding on various surfaces.\"), \n(\"Cycling Helmet\", 59.99, 100, \"A high-quality cycling helmet that ensures safety without compromising comfort. It has adjustable straps and ventilation for a perfect fit.\"), \n(\"Cycling Gloves\", 29.99, 80, \"These padded cycling gloves provide excellent grip and comfort during long rides. They are designed to reduce hand fatigue and improve control.\"), \n(\"Bike Lock\", 39.99, 70, \"A sturdy bike lock that offers high security to protect your bicycle. It's lightweight and easy to carry, making it perfect for urban commuting.\"), \n(\"Bike Pump\", 24.99, 90, \"A portable bike pump that quickly inflates tires with ease. Its compact design allows for easy storage in your backpack or bike frame.\"), \n(\"Cycling Shorts\", 49.99, 60, \"Comfortable cycling shorts made from moisture-wicking fabric. They provide a snug fit and feature padding for added comfort during long rides.\"), \n(\"Water Bottle\", 14.99, 150, \"A durable water bottle designed for cyclists. It fits in standard bike cages and keeps your drinks cold for hours.\"), \n(\"Bike Lights\", 34.99, 50, \"Bright bike lights that enhance visibility during nighttime rides. They are easy to install and have multiple flashing modes for safety.\"), \n(\"Saddle Bag\", 19.99, 40, \"A compact saddle bag that attaches under your bike seat. It's perfect for storing tools and essentials for quick repairs on the go.\"), \n(\"Cycling Jersey\", 69.99, 55, \"A breathable cycling jersey that wicks away moisture. It features a stylish design and pockets for convenient storage during rides.\"), \n(\"Bike Computer\", 49.99, 35, \"A smart bike computer that tracks your speed, distance, and time. It’s easy to mount and provides valuable data for performance tracking.\"), \n(\"Cycling Shoes\", 89.99, 45, \"Specialized cycling shoes designed for maximum power transfer. They feature a stiff sole and are compatible with clipless pedals.\"), \n(\"Bike Repair Kit\", 39.99, 60, \"A complete bike repair kit that includes essential tools for on-the-go fixes. It’s compact and easy to carry, ensuring you're always prepared.\"), \n(\"Cycling Sunglasses\", 49.99, 75, \"Lightweight cycling sunglasses that provide UV protection. They come with interchangeable lenses for various weather conditions.\"), \n(\"Bike Trailer\", 299.99, 10, \"A durable bike trailer designed for transporting cargo or children. It features a sturdy frame and a weather-resistant cover.\"), \n(\"Cycling Backpack\", 79.99, 40, \"A functional cycling backpack with hydration reservoir. It’s designed for comfort and convenience on long rides.\"), \n(\"Bike Rack\", 199.99, 20, \"A heavy-duty bike rack that securely holds multiple bicycles. It’s perfect for families or cycling enthusiasts with several bikes.\"), \n(\"Cycling Cap\", 19.99, 100, \"A stylish cycling cap that provides sun protection and sweat absorption. It fits comfortably under a helmet for added convenience.\"), \n(\"Chain Lubricant\", 12.99, 80, \"A high-quality chain lubricant that ensures smooth gear shifts. It helps prolong the life of your bike's chain and components.\"), \n(\"Bike Frame Bag\", 24.99, 50, \"A sleek bike frame bag that fits snugly on your bike. It’s perfect for storing small items like snacks and tools.\"), \n(\"Cycling Arm Warmers\", 29.99, 65, \"Lightweight arm warmers that provide extra warmth during chilly rides. They’re easy to remove and pack away when not needed.\"), \n(\"Bike Seat Cover\", 14.99, 90, \"A comfortable bike seat cover that adds extra padding. It’s designed to enhance comfort on long rides and fits most bike seats.\"), \n(\"Cycling Tights\", 59.99, 50, \"High-performance cycling tights that offer warmth and support. They are made from breathable fabric and feature reflective details for safety.\"), \n(\"Portable Bike Stand\", 79.99, 30, \"A portable bike stand that makes repairs and maintenance easy. It’s lightweight and collapsible for convenient storage.\"), \n(\"Bike Water Bottle Cage\", 9.99, 100, \"A sturdy water bottle cage that securely holds your bottle while riding. It’s easy to install and fits most standard bottles.\"), \n(\"Bike Fenders\", 29.99, 40, \"Durable bike fenders that protect you from mud and water. They are adjustable and fit most bike models.\"), \n(\"Cycling Socks\", 19.99, 80, \"Moisture-wicking cycling socks designed for comfort and performance. They provide extra cushioning and support during long rides.\"), \n(\"Bike Handlebar Bag\", 34.99, 50, \"A convenient handlebar bag that keeps essentials within reach. It’s perfect for carrying snacks, tools, and your phone.\"), \n(\"Bike Maintenance Book\", 24.99, 30, \"An informative book that covers essential bike maintenance tips. It’s a great resource for beginners and experienced cyclists alike.\"), \n(\"Cycle Trainer\", 299.99, 15, \"An indoor cycle trainer that allows you to train year-round. It features adjustable resistance levels for a customizable workout.\"), \n(\"Cycling GPS\", 199.99, 20, \"A GPS device designed specifically for cyclists. It tracks routes, distance, and speed, helping you improve your performance.\"), \n(\"Bike Phone Mount\", 19.99, 70, \"A secure phone mount that attaches to your bike's handlebars. It keeps your phone accessible for navigation and music.\"), \n(\"Cycling Windbreaker\", 49.99, 45, \"A lightweight windbreaker that protects against chilly winds. It’s packable and fits easily in your cycling bag.\"), \n(\"Bike Multi-Tool\", 29.99, 60, \"A compact multi-tool that includes various tools for bike repairs. It’s essential for any cyclist to have on hand.\"), \n(\"Cycling Nutrition Bars\", 2.99, 200, \"Energy bars specifically designed for cyclists. They provide quick energy and are easy to digest during rides.\"), \n(\"Bike Chain Breaker Tool\", 12.99, 70, \"A handy tool for breaking and repairing bike chains. It’s compact and essential for any cyclist’s repair kit.\"), \n(\"Cycling Reflective Vest\", 24.99, 50, \"A reflective vest that enhances visibility during low-light conditions. It’s lightweight and adjustable for comfort.\"), \n(\"Bike Cleaning Kit\", 39.99, 30, \"A complete cleaning kit that keeps your bike in top condition. It includes brushes, cleaners, and a microfiber cloth.\"), \n(\"Cycling Panniers\", 89.99, 25, \"Spacious cycling panniers that attach to your bike rack. They provide ample storage for commuting or touring.\"), \n(\"Bike Frame Protection Tape\", 9.99, 100, \"Protective tape that guards your bike frame against scratches. It’s easy to apply and remove without leaving residue.\"), \n(\"Cycling Headlight\", 29.99, 60, \"A powerful front bike light that ensures visibility during nighttime rides. It features multiple brightness settings and a long battery life.\"), \n(\"Bike Tail Light\", 19.99, 70, \"A bright rear bike light that enhances safety while riding. It’s easy to install and has several flashing modes.\"), \n(\"Cycling Base Layer\", 39.99, 50, \"A moisture-wicking base layer that keeps you comfortable in varying temperatures. It fits snugly under your cycling jersey.\"), \n(\"Bike Repair Stand\", 99.99, 20, \"A professional-grade bike repair stand that makes maintenance easy. It’s adjustable and stable, perfect for home use.\"), \n(\"Cycling Hydration Pack\", 59.99, 30, \"A hydration pack designed for cyclists, featuring a built-in reservoir. It allows for hands-free drinking while riding.\"), \n(\"Bike Gear Bag\", 49.99, 40, \"A spacious gear bag designed to hold all your cycling essentials. It features multiple compartments for organization.\"), \n(\"Cycling Knee Warmers\", 24.99, 50, \"Knee warmers that provide additional warmth during colder rides. They are lightweight and easy to pack when not in use.\"), \n(\"Bike Pedals\", 39.99, 50, \"High-quality bike pedals designed for optimal grip and performance. They are compatible with various shoe types.\"), \n(\"Cycling Arm Warmers\", 29.99, 60, \"Arm warmers that offer extra warmth during chilly rides. They’re lightweight and easy to remove when the temperature rises.\"), \n(\"Bike Gear Ratio Calculator\", 14.99, 80, \"A handy tool for calculating gear ratios for your bike setup. It’s essential for optimizing performance and efficiency.\"), \n(\"Cycling Fitness Tracker\", 99.99, 15, \"A fitness tracker designed for cyclists, monitoring heart rate and distance. It syncs with your smartphone for easy data access.\"), \n(\"Bike Cleaning Brush\", 12.99, 70, \"A specialized cleaning brush for maintaining your bike’s components. It helps reach tight spots and keeps your bike looking new.\"), \n(\"Cycling Travel Case\", 199.99, 10, \"A protective travel case for transporting your bike. It’s padded and designed to fit most bike models securely.\"), \n(\"Bike Tuning Tool\", 24.99, 50, \"A tuning tool that helps adjust your bike’s gears and brakes. It’s compact and easy to use for quick adjustments.\"), \n(\"Cycling Safety Whistle\", 9.99, 100, \"A loud safety whistle that can alert others in case of emergencies. It’s lightweight and easy to attach to your gear.\"), \n(\"Bike Frame Bag\", 19.99, 60, \"A lightweight frame bag that fits securely on your bike. It’s perfect for carrying snacks and small tools during rides.\"), \n(\"Cycling First Aid Kit\", 29.99, 25, \"A compact first aid kit designed for cyclists. It includes essential supplies for treating minor injuries on the go.\"), \n(\"Bike Speedometer\", 39.99, 40, \"An easy-to-install speedometer that tracks your cycling speed and distance. It’s perfect for monitoring performance.\"), \n(\"Cycling Compression Socks\", 24.99, 50, \"Compression socks that enhance circulation during long rides. They provide support and comfort for your legs.\"), \n(\"Bike Reflectors\", 14.99, 80, \"Reflectors that enhance visibility during nighttime rides. They are easy to install and improve safety on the road.\"), \n(\"Cycling Beanie\", 19.99, 50, \"A warm cycling beanie that fits comfortably under your helmet. It provides extra warmth during cold weather rides.\"), \n(\"Bike Tire Repair Kit\", 12.99, 70, \"A compact tire repair kit that includes patches and tools. It’s essential for quick fixes while on the road.\"), \n(\"Cycling Sunglasses with Interchangeable Lenses\", 59.99, 30, \"Stylish cycling sunglasses featuring interchangeable lenses for different lighting conditions. They provide UV protection and comfort.\"), \n(\"Bike Chain Cleaner\", 24.99, 60, \"A specialized chain cleaner that removes dirt and grime from your bike chain. It helps maintain performance and prolongs chain life.\"), \n(\"Cycling Reflective Tape\", 9.99, 100, \"Reflective tape that can be applied to your bike for added visibility. It’s easy to use and enhances safety during night rides.\"), \n(\"Bike Gear Bag\", 49.99, 50, \"A spacious gear bag designed specifically for cyclists. It features multiple compartments for easy organization of your cycling gear.\"), \n(\"Cycling Trail Map\", 14.99, 80, \"A detailed map featuring the best cycling trails in your area. It’s a great resource for planning your next adventure.\"), \n(\"Bike Safety Flag\", 19.99, 40, \"A bright safety flag that increases your visibility on the road. It’s easy to attach to your bike and is perfect for family rides.\"), \n(\"Cycling Phone Holder\", 24.99, 50, \"A secure phone holder that keeps your device visible while riding. It’s perfect for navigation and listening to music.\"), \n(\"Bike Travel Tool\", 29.99, 60, \"A multi-tool designed for bike repairs on the go. It includes various tools in a compact design for easy transport.\"), \n(\"Cycling Adventure Book\", 19.99, 30, \"An inspiring book filled with cycling adventure stories. It’s perfect for motivating you to explore new trails.\"), \n(\"Bike Saddle\", 49.99, 50, \"A comfortable bike saddle designed for long rides. It features ergonomic design and ample padding for support.\"), \n(\"Cycling Training DVD\", 29.99, 25, \"An instructional DVD that offers cycling training tips and workouts. It’s perfect for improving your cycling skills at home.\"), \n(\"Bike Gear Organizer\", 19.99, 70, \"A practical organizer for storing your cycling gear. It features multiple compartments for easy access and organization.\"), \n(\"Cycling Weatherproof Jacket\", 89.99, 15, \"A weatherproof cycling jacket that keeps you dry in rain. It’s lightweight and breathable, perfect for all seasons.\"), \n(\"Bike Tire Pressure Gauge\", 14.99, 100, \"A reliable tire pressure gauge that ensures your tires are properly inflated. It’s compact and easy to carry.\"), \n(\"Cycling Community Membership\", 49.99, 25, \"A membership to a local cycling community offering group rides and events. It’s a great way to meet fellow cyclists.\"), \n(\"Bike Multi-Function Light\", 39.99, 40, \"A versatile bike light that serves as both a headlight and taillight. It features multiple modes for various riding conditions.\"), \n(\"Cycling Advocacy T-shirt\", 24.99, 50, \"A comfortable t-shirt that promotes cycling advocacy. It’s a great way to show your support for cycling in your community.\"), \n(\"Bike Reflective Vest\", 19.99, 70, \"A reflective vest designed to enhance visibility during nighttime rides. It’s adjustable and fits comfortably over your clothing.\"), \n(\"Cycling Event Registration\", 49.99, 30, \"Registration for an upcoming cycling event or race. It’s a great opportunity to challenge yourself and meet other cyclists.\"), \n(\"Bike Safety Course\", 99.99, 10, \"A comprehensive safety course for cyclists. It covers essential skills and knowledge for safe riding.\"), \n(\"Cycling Magazine Subscription\", 29.99, 25, \"A subscription to a popular cycling magazine. It’s filled with tips, reviews, and inspiration for cycling enthusiasts.\"), \n(\"Bike Adventure Tour Package\", 499.99, 5, \"A guided bike tour package exploring scenic routes. It includes accommodations and meals for an unforgettable cycling experience.\"), \n(\"Cycling Coaching Session\", 99.99, 10, \"A personalized coaching session to improve your cycling skills. It’s ideal for cyclists of all levels looking to enhance their performance.\"), \n(\"Bike Maintenance Workshop\", 49.99, 15, \"A hands-on workshop teaching essential bike maintenance skills. It’s perfect for beginners wanting to learn how to care for their bikes.\"), \n(\"Cycling Group Ride\", 29.99, 20, \"Join a local cycling group for a fun and social ride. It’s a great way to meet new friends and explore new routes.\"), \n(\"Bike Safety Inspection\", 39.99, 30, \"A professional safety inspection for your bike. It ensures your bike is in top condition for safe riding.\"), \n(\"Cycling Skills Clinic\", 49.99, 15, \"A skills clinic focused on improving your cycling technique. It’s perfect for cyclists looking to enhance their performance.\"), \n(\"Bike Trail Guide\", 14.99, 80, \"A comprehensive guide to the best bike trails in your area. It’s perfect for planning your next cycling adventure.\"), \n(\"Cycling Fitness Challenge\", 29.99, 25, \"Participate in a fitness challenge to improve your cycling endurance. It’s a great way to stay motivated and track your progress.\"), \n(\"Bike Customization Kit\", 49.99, 20, \"A kit that allows you to customize your bike's appearance. It includes decals, lights, and accessories for personalization.\"), \n(\"Cycling Endurance Training Plan\", 19.99, 30, \"A structured training plan designed to improve your cycling endurance. It’s perfect for cyclists preparing for long-distance rides.\"), \n(\"Bike Commuting Guide\", 14.99, 75, \"A guide filled with tips for commuting by bike. It covers safety, routes, and gear for urban cycling.\") ]"