"[\n    (\"DJ Mixer\", 299.99, 30, \"A professional DJ mixer with multiple channels and built-in effects for seamless transitions. Perfect for both beginners and experienced DJs looking to enhance their performances.\"),\n    (\"Turntable\", 499.99, 20, \"High-quality turntable designed for audiophiles and DJs alike. It delivers exceptional sound quality and comes with a sturdy build for durability.\"),\n    (\"DJ Headphones\", 129.99, 100, \"Comfortable over-ear headphones with excellent sound isolation. Ideal for monitoring tracks in loud environments.\"),\n    (\"Portable PA System\", 699.99, 15, \"A compact and powerful portable PA system for events and parties. Features Bluetooth connectivity and long battery life for outdoor use.\"),\n    (\"DJ Controller\", 249.99, 40, \"An all-in-one DJ controller with intuitive controls and built-in sound card. Great for mixing tracks and creating live remixes.\"),\n    (\"Microphone\", 89.99, 75, \"Dynamic microphone with excellent sound quality and feedback rejection. Perfect for live performances and studio recordings.\"),\n    (\"DJ Lighting Kit\", 349.99, 25, \"An exciting DJ lighting kit that includes LED lights and effects. Ideal for creating an electrifying atmosphere at any event.\"),\n    (\"Audio Interface\", 199.99, 50, \"High-performance audio interface for recording and mixing music. Features multiple inputs and outputs for versatile connectivity.\"),\n    (\"Laptop Stand\", 79.99, 60, \"Adjustable laptop stand designed for DJs on the go. It provides stability and ergonomic positioning for comfortable use.\"),\n    (\"DJ Software\", 149.99, 100, \"Professional DJ software with a user-friendly interface and advanced features. Perfect for mixing, editing, and producing music.\"),\n    (\"Vinyl Records\", 24.99, 200, \"A collection of classic vinyl records from various genres. Perfect for DJs looking to expand their music library.\"),\n    (\"DJ Backpack\", 59.99, 80, \"Durable and spacious DJ backpack designed to carry all your gear. Features padded compartments for laptops and accessories.\"),\n    (\"LED Fog Machine\", 199.99, 20, \"A powerful fog machine with built-in LED lights for stunning visual effects. Ideal for creating a captivating atmosphere at events.\"),\n    (\"Wireless Microphone System\", 399.99, 10, \"Professional wireless microphone system for freedom of movement during performances. Offers crystal-clear audio quality and reliable connectivity.\"),\n    (\"DJ Booth\", 599.99, 5, \"A stylish DJ booth designed for live performances. Features a sleek design and ample space for equipment setup.\"),\n    (\"Samplers\", 249.99, 40, \"A versatile sampler for creating unique sounds and beats. Ideal for electronic music producers and live performers.\"),\n    (\"Karaoke Machine\", 299.99, 15, \"An all-in-one karaoke machine with a variety of built-in songs. Perfect for parties and gatherings with family and friends.\"),\n    (\"Studio Monitors\", 399.99, 25, \"High-quality studio monitors designed for accurate sound reproduction. Ideal for mixing and mastering music in a studio environment.\"),\n    (\"DJ Snake Charmer\", 79.99, 50, \"A unique device that enhances the sound of your DJ setup. It adds a layer of depth to your mixes, making them more engaging.\"),\n    (\"Sound Mixer\", 499.99, 10, \"A professional sound mixer with multiple channels and effects. Perfect for live sound applications and studio recordings.\"),\n    (\"Turntable Slipmats\", 19.99, 150, \"Stylish slipmats designed to enhance your turntable experience. They help reduce friction and protect your vinyl records.\"),\n    (\"DJ Face Mask\", 29.99, 100, \"A stylish and comfortable face mask designed for DJs. Offers protection while allowing you to express your unique style.\"),\n    (\"Stage Monitors\", 299.99, 20, \"High-quality stage monitors for live performances. They provide clear sound feedback to performers on stage.\"),\n    (\"DJ Software Subscription\", 99.99, 100, \"Monthly subscription for access to premium DJ software features. Stay updated with the latest tools for your mixes.\"),\n    (\"DJ Table\", 149.99, 30, \"A sturdy and portable DJ table for events. Provides a stable surface for all your equipment.\"),\n    (\"DJ Fog Juice\", 29.99, 100, \"High-quality fog juice for fog machines. Creates thick fog that enhances lighting effects.\"),\n    (\"DJ Equipment Cleaning Kit\", 39.99, 60, \"A complete cleaning kit for maintaining your DJ gear. Includes cleaning solution and microfiber cloths.\"),\n    (\"Portable DJ Booth\", 399.99, 10, \"A lightweight and portable DJ booth for easy setup at events. Designed for convenience and style.\"),\n    (\"DJ Performance Book\", 24.99, 80, \"A comprehensive guide to mastering DJ skills. Covers techniques, equipment, and performance tips.\"),\n    (\"Wireless DJ Headphones\", 199.99, 15, \"High-quality wireless headphones designed for DJs. Offers freedom of movement without sacrificing sound quality.\"),\n    (\"DJ Gear Organizer\", 49.99, 70, \"A compact organizer for keeping all your DJ equipment in one place. Features multiple compartments for easy access.\"),\n    (\"DJ Turntable Case\", 129.99, 40, \"Durable case designed to protect your turntable during transport. Features padded interiors and sturdy handles.\"),\n    (\"DJ Lighting Controller\", 299.99, 20, \"Advanced lighting controller for synchronizing lights with your music. Perfect for creating stunning light shows.\"),\n    (\"DJ Interface\", 199.99, 30, \"Compact DJ interface for connecting your gear to a computer. Offers high-quality sound and low latency.\"),\n    (\"DJ Vinyl Cleaner\", 14.99, 100, \"Specially formulated cleaner for maintaining your vinyl records. Helps preserve sound quality and extend lifespan.\"),\n    (\"DJ Wireless Receiver\", 89.99, 50, \"Reliable wireless receiver for connecting microphones and instruments. Ensures clear audio transmission without interference.\"),\n    (\"DJ Performance Gloves\", 29.99, 100, \"Stylish gloves designed for DJs to enhance grip and control. Perfect for both live performances and studio work.\"),\n    (\"DJ Subwoofer\", 499.99, 15, \"Powerful subwoofer designed to deliver deep bass for your DJ setup. Ideal for creating a full sound experience.\"),\n    (\"DJ Music Library Management Software\", 99.99, 100, \"Software designed to help DJs manage their music libraries efficiently. Features tagging, sorting, and playlist creation.\"),\n    (\"DJ Carry Bag\", 59.99, 80, \"Durable carry bag designed to transport your DJ gear safely. Features padded compartments and adjustable straps.\"),\n    (\"DJ Effects Pedal\", 199.99, 20, \"Versatile effects pedal for adding unique sounds to your mixes. Perfect for live performances and studio recordings.\"),\n    (\"DJ LED Light Bar\", 349.99, 10, \"A dynamic LED light bar that adds excitement to any performance. Features multiple lighting modes and colors.\"),\n    (\"DJ Mixer Bag\", 79.99, 50, \"Protective bag for transporting your DJ mixer. Features padded interiors and durable materials.\"),\n    (\"DJ Performance App\", 49.99, 100, \"An innovative app designed to help DJs improve their skills and performances. Includes tutorials and practice tools.\"),\n    (\"DJ Sound Effects Library\", 29.99, 100, \"A collection of sound effects for enhancing your mixes. Perfect for adding unique elements to your performances.\"),\n    (\"DJ Scratch Pad\", 19.99, 150, \"A portable scratch pad designed for practicing DJ techniques. Features a smooth surface for easy scratching.\"),\n    (\"DJ Booth Lighting\", 99.99, 30, \"LED lighting designed specifically for DJ booths. Creates an engaging atmosphere during performances.\"),\n    (\"DJ MIDI Controller\", 199.99, 25, \"A versatile MIDI controller for controlling software and hardware. Perfect for live performances and studio work.\"),\n    (\"DJ Sound System\", 999.99, 8, \"A complete DJ sound system with speakers and mixer included. Ideal for large events and parties.\"),\n    (\"DJ Practice Turntable\", 299.99, 15, \"A practice turntable designed for learning and honing your skills. Features a realistic feel and sound.\"),\n    (\"DJ Multi-Effect Processor\", 399.99, 10, \"Advanced multi-effect processor for creating unique soundscapes. Perfect for DJs looking to experiment with their mixes.\"),\n    (\"DJ Vinyl Storage\", 49.99, 100, \"Stylish storage for organizing your vinyl records. Keeps your collection safe and easily accessible.\"),\n    (\"DJ Live Streaming Kit\", 299.99, 20, \"A complete kit for live streaming your DJ sets. Includes camera, microphone, and streaming software.\"),\n    (\"DJ Beat Pad\", 149.99, 40, \"A compact beat pad for triggering samples and loops. Ideal for live performances and studio production.\"),\n    (\"DJ USB Flash Drive\", 29.99, 100, \"High-speed USB flash drive for storing and transferring music. Perfect for DJs on the go.\"),\n    (\"DJ Performance T-Shirt\", 24.99, 80, \"Stylish t-shirt designed for DJs. Made from comfortable fabric, perfect for wearing during gigs.\"),\n    (\"DJ Lighting Effects\", 199.99, 25, \"Dynamic lighting effects designed to enhance your performances. Perfect for creating a memorable atmosphere.\"),\n    (\"DJ Sound Card\", 129.99, 50, \"High-quality sound card for connecting your DJ setup to a computer. Ensures low latency and high fidelity.\"),\n    (\"DJ Bag for Laptops\", 89.99, 70, \"Specialized bag designed to carry laptops and accessories safely. Features multiple compartments for organization.\"),\n    (\"DJ Cables Pack\", 39.99, 100, \"A comprehensive pack of cables for connecting your DJ equipment. Ensures reliable performance and sound quality.\"),\n    (\"DJ Sample Pack\", 19.99, 150, \"A collection of high-quality samples for music production. Perfect for DJs and producers looking to enhance their tracks.\"),\n    (\"DJ Microphone Stand\", 49.99, 60, \"Adjustable microphone stand designed for live performances. Provides stability and ease of use.\"),\n    (\"DJ Riser\", 99.99, 30, \"Portable riser designed to elevate your DJ setup. Ideal for improving visibility during performances.\"),\n    (\"DJ Speaker Stands\", 79.99, 40, \"Adjustable speaker stands for optimizing sound projection. Perfect for setting up at events and venues.\"),\n    (\"DJ Controller Case\", 149.99, 20, \"Durable case designed to protect your DJ controller during transport. Features padded interiors and sturdy construction.\"),\n    (\"DJ Sound Isolation Pads\", 29.99, 100, \"Sound isolation pads designed to reduce vibrations and improve sound quality. Perfect for studio setups.\"),\n    (\"DJ Wireless Adapter\", 49.99, 100, \"Compact wireless adapter for connecting devices without cables. Ensures clear audio transmission.\"),\n    (\"DJ Performance Stickers\", 9.99, 200, \"Fun stickers designed for DJs to personalize their gear. Perfect for adding a unique touch to your setup.\"),\n    (\"DJ Event Planner\", 34.99, 50, \"A guide for planning successful DJ events. Covers everything from logistics to promotion.\"),\n    (\"DJ Audio Splitter\", 19.99, 100, \"Compact audio splitter for connecting multiple devices. Ideal for sharing audio between different sources.\"),\n    (\"DJ Performance Notebook\", 14.99, 150, \"A notebook designed for DJs to jot down ideas and setlists. Perfect for staying organized during gigs.\"),\n    (\"DJ Soundproofing Foam\", 99.99, 20, \"Soundproofing foam designed to enhance studio acoustics. Ideal for creating a professional recording environment.\"),\n    (\"DJ Customizable LED Sign\", 79.99, 30, \"A customizable LED sign for displaying your DJ name. Perfect for branding during performances.\"),\n    (\"DJ Software Training Course\", 199.99, 10, \"Comprehensive online course for mastering DJ software. Perfect for beginners and experienced DJs alike.\"),\n    (\"DJ Performance Wristbands\", 12.99, 100, \"Stylish wristbands designed for DJs to wear during events. Perfect for adding a personal touch to your performance.\"),\n    (\"DJ Audio Mixer\", 299.99, 15, \"Professional audio mixer designed for live sound applications. Features multiple channels and effects for versatility.\"),\n    (\"DJ Performance Card\", 9.99, 200, \"Business cards designed for DJs to promote their services. Perfect for networking and gaining new clients.\"),\n    (\"DJ Sound Level Meter\", 39.99, 50, \"Compact sound level meter for monitoring audio levels during performances. Ensures optimal sound quality.\"),\n    (\"DJ Gear Rental Service\", 199.99, 10, \"Service for renting high-quality DJ equipment for events. Perfect for those who need gear for a short period.\"),\n    (\"DJ Performance DVD\", 24.99, 80, \"Educational DVD covering DJ techniques and performance tips. Ideal for learning new skills and improving your craft.\")\n]"