"products = [\n    (\"Aerial Explorer 3000\", 499.99, 30, \"The Aerial Explorer 3000 is designed for both beginners and experienced pilots. With a 4K camera and GPS capabilities, it captures stunning aerial footage.\"),\n    (\"SkyMaster Pro\", 799.99, 20, \"SkyMaster Pro offers advanced features like obstacle avoidance and real-time video transmission. Perfect for professional photographers and videographers.\"),\n    (\"RoboDrone X\", 299.99, 50, \"RoboDrone X is a compact drone that is easy to operate. It comes with a built-in HD camera and is great for casual flying and recording moments.\"),\n    (\"Stealth Flyer\", 599.99, 15, \"The Stealth Flyer is engineered for speed and agility. Its lightweight design allows for swift maneuvers, making it perfect for racing.\"),\n    (\"EcoDrone 100\", 199.99, 100, \"EcoDrone 100 is an environmentally friendly drone made from sustainable materials. It’s great for educational purposes and outdoor exploration.\"),\n    (\"ProCam Drone\", 899.99, 10, \"ProCam Drone features a high-resolution camera and gimbal stabilization for smooth video capture. Ideal for serious filmmakers and content creators.\"),\n    (\"Adventure Drone 250\", 349.99, 40, \"Adventure Drone 250 is built for rugged terrains and outdoor adventures. It includes a durable frame and enhanced battery life for extended flights.\"),\n    (\"Mini Drone 101\", 99.99, 150, \"Mini Drone 101 is a fun and easy-to-fly drone perfect for kids and beginners. It features colorful LED lights and a simple control system.\"),\n    (\"Racing Hawk\", 399.99, 25, \"Racing Hawk is designed for competitive racing enthusiasts. Its powerful motors and aerodynamic design provide unmatched speed and control.\"),\n    (\"DroneBuddy\", 249.99, 60, \"DroneBuddy is a user-friendly drone with smart features for novice pilots. It includes automatic takeoff and landing for hassle-free flying.\"),\n    (\"SkyGuardian 500\", 1,199.99, 5, \"SkyGuardian 500 offers unparalleled security features for surveillance. It includes night vision and long-range capabilities for comprehensive monitoring.\"),\n    (\"Photography Drone 4K\", 749.99, 12, \"Photography Drone 4K is tailored for photographers seeking high-quality aerial shots. Its 4K camera and adjustable gimbal ensure breathtaking images.\"),\n    (\"Family Fun Drone\", 149.99, 80, \"Family Fun Drone is perfect for creating lasting memories with loved ones. Easy to operate and equipped with fun features, it’s great for family outings.\"),\n    (\"Drone Racer 200\", 299.99, 35, \"Drone Racer 200 is built for speed and agility on the racing circuit. It features customizable settings for competitive flying.\"),\n    (\"SkySpy Drone\", 499.99, 20, \"SkySpy Drone is designed for surveillance and reconnaissance. Its quiet operation and high-definition camera make it ideal for discreet monitoring.\"),\n    (\"Explorer Drone 150\", 349.99, 45, \"Explorer Drone 150 is perfect for adventurers and explorers. It features rugged construction and a long flight time for extensive outdoor use.\"),\n    (\"Compact Drone 50\", 89.99, 120, \"Compact Drone 50 is a lightweight and portable option for casual users. Its simple controls make it easy to fly and capture fun moments.\"),\n    (\"HighFlyer 800\", 999.99, 8, \"HighFlyer 800 is a premium drone with advanced flight features. It includes a high-quality camera and an extended battery for professional use.\"),\n    (\"Dusk Flyer\", 349.99, 30, \"Dusk Flyer is designed for night-time flying with its LED lights. It offers a unique flying experience and captures stunning night shots.\"),\n    (\"AeroScout Drone\", 429.99, 22, \"AeroScout Drone is great for scouting and mapping areas. With its GPS functionality and high-resolution camera, it’s a valuable tool for outdoor activities.\"),\n    (\"DroneX Pro\", 799.99, 10, \"DroneX Pro combines professional-grade features with user-friendly controls. It is suitable for both hobbyists and professionals alike.\"),\n    (\"SkyChaser\", 299.99, 40, \"SkyChaser is perfect for those who love to capture breathtaking landscapes. Its stability and camera quality make it ideal for aerial photography.\"),\n    (\"Futuristic Drone\", 599.99, 15, \"Futuristic Drone boasts cutting-edge technology with autonomous flying capabilities. It’s perfect for tech enthusiasts looking to explore the skies.\"),\n    (\"Drone Explorer Lite\", 199.99, 70, \"Drone Explorer Lite is a budget-friendly option for casual flyers. It features a simple design and is great for learning the basics of flying.\"),\n    (\"SwiftFlyer 400\", 449.99, 25, \"SwiftFlyer 400 is engineered for fast-paced aerial maneuvers. Its responsive controls make it a favorite among racing enthusiasts.\"),\n    (\"Aerial Vision 200\", 599.99, 18, \"Aerial Vision 200 features a powerful camera and intelligent flight modes. It’s perfect for capturing stunning aerial footage with ease.\"),\n    (\"SkyView Drone\", 299.99, 50, \"SkyView Drone offers a panoramic view with its wide-angle camera. Ideal for capturing landscapes and events from above.\"),\n    (\"Drone Navigator\", 349.99, 30, \"Drone Navigator is equipped with advanced navigation features for precise flying. It’s perfect for mapping and surveying tasks.\"),\n    (\"VideoDrone 4K\", 799.99, 12, \"VideoDrone 4K delivers exceptional video quality for filmmakers. Its advanced stabilization system ensures smooth and professional footage.\"),\n    (\"Rugged Drone 300\", 499.99, 20, \"Rugged Drone 300 is built to withstand tough conditions. Its durable design and high-performance capabilities make it perfect for outdoor adventures.\"),\n    (\"Family Drone 200\", 249.99, 60, \"Family Drone 200 is designed for family fun and exploration. It includes easy controls and fun features for all ages.\"),\n    (\"Vortex Racing Drone\", 399.99, 25, \"Vortex Racing Drone is tailored for high-speed racing. Its lightweight frame and powerful motors provide an exhilarating experience.\"),\n    (\"Aerial Artist Drone\", 599.99, 15, \"Aerial Artist Drone is designed for creative videographers. Its unique flight modes allow for stunning cinematic shots.\"),\n    (\"Drone Explorer Pro\", 699.99, 10, \"Drone Explorer Pro is perfect for professionals seeking high-quality aerial footage. Its advanced features and durability make it a top choice.\"),\n    (\"SkyKing Drone\", 499.99, 20, \"SkyKing Drone offers superior flight stability and camera quality. Ideal for capturing breathtaking aerial views.\"),\n    (\"RoboFlyer\", 299.99, 45, \"RoboFlyer is a compact drone with smart features for easy flying. It’s perfect for beginners and casual users.\"),\n    (\"Drone Buddy\", 149.99, 80, \"Drone Buddy is a user-friendly option for kids and families. Its colorful design and simple controls make it a fun flying experience.\"),\n    (\"Professional Drone 1000\", 1,199.99, 5, \"Professional Drone 1000 is equipped with industry-leading technology for high-end filming. Ideal for filmmakers and content creators.\"),\n    (\"Drone Scout 150\", 349.99, 30, \"Drone Scout 150 is perfect for outdoor enthusiasts. It includes GPS tracking and a high-resolution camera for scouting adventures.\"),\n    (\"Air Explorer 200\", 399.99, 25, \"Air Explorer 200 is designed for those who love to explore. Its rugged design and long battery life make it perfect for outdoor use.\"),\n    (\"SkyDancer Drone\", 299.99, 50, \"SkyDancer Drone is perfect for aerial acrobatics and stunts. Its responsive controls allow for thrilling performances.\"),\n    (\"Ultra HD Drone\", 799.99, 12, \"Ultra HD Drone captures stunning 4K video and high-resolution images. Perfect for professionals seeking quality in their aerial footage.\"),\n    (\"Eco-Friendly Drone\", 199.99, 100, \"Eco-Friendly Drone is made from sustainable materials and is great for educational purposes. It’s perfect for teaching kids about technology.\"),\n    (\"Racing Pro Drone\", 499.99, 20, \"Racing Pro Drone is made for speed and agility in competitive racing. Its advanced features allow for customization and precision flying.\"),\n    (\"Adventure Drone 300\", 349.99, 40, \"Adventure Drone 300 is built for outdoor adventures with a rugged frame. It’s perfect for capturing breathtaking landscapes.\"),\n    (\"Night Flyer Drone\", 199.99, 75, \"Night Flyer Drone is designed for night-time flying with its LED lights. It offers a unique flying experience and captures stunning night shots.\"),\n    (\"Airborne Explorer\", 599.99, 15, \"Airborne Explorer is perfect for capturing stunning aerial views. Its advanced camera and flight features make it a top choice for photographers.\"),\n    (\"DroniX 500\", 799.99, 10, \"DroniX 500 combines high performance with advanced technology. Ideal for both hobbyists and professionals looking for quality.\"),\n    (\"SkyWatcher Drone\", 299.99, 50, \"SkyWatcher Drone features a built-in camera for capturing photos and videos. Perfect for beginners looking to explore aerial photography.\"),\n    (\"Drone Racer 300\", 349.99, 30, \"Drone Racer 300 is designed for speed and agility in racing. Its lightweight design and powerful motors provide an exhilarating experience.\"),\n    (\"Aerial Scout 100\", 199.99, 100, \"Aerial Scout 100 is a great entry-level drone for beginners. It features easy controls and a built-in camera for capturing fun moments.\"),\n    (\"ProFlyer Drone\", 499.99, 20, \"ProFlyer Drone is designed for professional photographers seeking high-quality aerial shots. Its advanced stabilization ensures smooth footage.\"),\n    (\"SkyGuardian 400\", 599.99, 15, \"SkyGuardian 400 offers advanced security features for surveillance. Its long-range capabilities make it ideal for monitoring large areas.\"),\n    (\"Rugged Explorer Drone\", 399.99, 25, \"Rugged Explorer Drone is built for tough terrains and outdoor adventures. Its durable design and extended battery life are perfect for exploration.\"),\n    (\"Family Fun Flyer\", 149.99, 80, \"Family Fun Flyer is perfect for family outings and creating memories. Easy to operate and equipped with fun features for all ages.\"),\n    (\"SkyRacer Drone\", 299.99, 40, \"SkyRacer Drone is built for speed and agility on the racing circuit. Its responsive controls make it a favorite among racing enthusiasts.\"),\n    (\"Drone Voyager 200\", 349.99, 30, \"Drone Voyager 200 is ideal for capturing stunning landscapes. Its stability and camera quality make it perfect for aerial photography.\"),\n    (\"Compact Explorer Drone\", 89.99, 120, \"Compact Explorer Drone is lightweight and portable, perfect for casual users. Its simple controls make it easy to fly and enjoy.\"),\n    (\"Aerial Vision Pro\", 799.99, 12, \"Aerial Vision Pro is tailored for photographers seeking high-quality aerial shots. Its advanced features ensure breathtaking images.\"),\n    (\"Dusk Explorer\", 349.99, 30, \"Dusk Explorer is designed for night-time flying with its LED lights. It captures stunning night shots and offers a unique flying experience.\"),\n    (\"Drone Racer X\", 399.99, 25, \"Drone Racer X is built for competitive racing enthusiasts. Its powerful motors and aerodynamic design provide unmatched speed and control.\"),\n    (\"Mini Aerial Drone\", 99.99, 150, \"Mini Aerial Drone is a fun and easy-to-fly option for kids and beginners. It features colorful LED lights and a simple control system.\"),\n    (\"SkySurfer Drone\", 499.99, 20, \"SkySurfer Drone offers superior flight stability and camera quality. Ideal for capturing breathtaking aerial views.\"),\n    (\"Drone Explorer 250\", 349.99, 40, \"Drone Explorer 250 is perfect for adventurers and explorers. It features rugged construction and a long flight time for extensive outdoor use.\"),\n    (\"ProCam Racer\", 899.99, 10, \"ProCam Racer combines speed with high-quality camera features. Perfect for racing enthusiasts who want to capture their experiences.\"),\n    (\"DroneBuddy 200\", 249.99, 60, \"DroneBuddy 200 is a user-friendly drone with smart features for novice pilots. It includes automatic takeoff and landing for hassle-free flying.\"),\n    (\"SkyChaser 300\", 299.99, 50, \"SkyChaser 300 is perfect for those who love to capture breathtaking landscapes. Its stability and camera quality make it ideal for aerial photography.\"),\n    (\"Ultra Drone 1000\", 1,199.99, 5, \"Ultra Drone 1000 is equipped with industry-leading technology for high-end filming. Ideal for filmmakers and content creators.\"),\n    (\"SkyDancer 400\", 299.99, 50, \"SkyDancer 400 is perfect for aerial acrobatics and stunts. Its responsive controls allow for thrilling performances.\"),\n    (\"Drone Navigator 150\", 349.99, 30, \"Drone Navigator 150 is equipped with advanced navigation features for precise flying. It’s perfect for mapping and surveying tasks.\"),\n    (\"Adventure Drone 200\", 399.99, 25, \"Adventure Drone 200 is built for outdoor adventures with a rugged frame. It’s perfect for capturing breathtaking landscapes.\"),\n    (\"Eco-Friendly Flyer\", 199.99, 100, \"Eco-Friendly Flyer is made from sustainable materials and is great for educational purposes. It’s perfect for teaching kids about technology.\"),\n    (\"Racing Hawk 300\", 499.99, 20, \"Racing Hawk 300 is designed for competitive racing enthusiasts. Its powerful motors and aerodynamic design provide unmatched speed and control.\"),\n    (\"SkyGuardian 600\", 699.99, 10, \"SkyGuardian 600 offers advanced security features for surveillance. Its long-range capabilities make it ideal for monitoring large areas.\"),\n    (\"Aerial Scout 200\", 199.99, 100, \"Aerial Scout 200 is a great entry-level drone for beginners. It features easy controls and a built-in camera for capturing fun moments.\"),\n    (\"Drone Racer 400\", 399.99, 25, \"Drone Racer 400 is designed for speed and agility in racing. Its lightweight design and powerful motors provide an exhilarating experience.\"),\n    (\"ProFlyer 300\", 499.99, 20, \"ProFlyer 300 is designed for professional photographers seeking high-quality aerial shots. Its advanced stabilization ensures smooth footage.\"),\n    (\"SkyWatcher 400\", 299.99, 50, \"SkyWatcher 400 features a built-in camera for capturing photos and videos. Perfect for beginners looking to explore aerial photography.\"),\n    (\"Drone Voyager 300\", 349.99, 30, \"Drone Voyager 300 is ideal for capturing stunning landscapes. Its stability and camera quality make it perfect for aerial photography.\"),\n    (\"Rugged Explorer 200\", 399.99, 25, \"Rugged Explorer 200 is built for tough terrains and outdoor adventures. Its durable design and extended battery life are perfect for exploration.\"),\n    (\"Family Fun Drone 300\", 149.99, 80, \"Family Fun Drone 300 is perfect for family outings and creating memories. Easy to operate and equipped with fun features for all ages.\")\n]"