"products = [\n    (\"Tesla Model S\", 89999.99, 10, \"The Tesla Model S is a luxury electric sedan known for its impressive range and performance. With cutting-edge technology and a minimalist interior, it's designed for the modern driver.\"),\n    (\"Nissan Leaf\", 34999.99, 25, \"The Nissan Leaf is an affordable electric hatchback that offers practicality and efficiency. It features a spacious interior and advanced safety features, making it perfect for city driving.\"),\n    (\"Chevrolet Bolt EV\", 36999.99, 15, \"The Chevrolet Bolt EV is a compact electric car that provides an impressive range on a single charge. With its roomy interior and tech-savvy features, it's ideal for everyday use.\"),\n    (\"Ford Mustang Mach-E\", 42999.99, 20, \"The Ford Mustang Mach-E combines the iconic Mustang spirit with electric performance. It boasts a stylish design and a spacious cabin, perfect for families and enthusiasts alike.\"),\n    (\"BMW i3\", 44999.99, 12, \"The BMW i3 is a unique electric vehicle that stands out with its distinctive design and sustainable materials. It offers agile handling and a premium feel, making it a fun urban car.\"),\n    (\"Audi e-tron\", 65999.99, 8, \"The Audi e-tron is a luxury electric SUV that delivers a smooth and powerful driving experience. With a spacious interior and advanced technology, it caters to both comfort and performance.\"),\n    (\"Hyundai Kona Electric\", 39999.99, 30, \"The Hyundai Kona Electric is a subcompact SUV that offers a great balance of range and affordability. Its stylish design and tech features make it a popular choice among electric vehicle buyers.\"),\n    (\"Kia Niro EV\", 39999.99, 18, \"The Kia Niro EV is a versatile crossover that combines electric efficiency with practicality. With a spacious interior and user-friendly technology, it's perfect for families on the go.\"),\n    (\"Porsche Taycan\", 103000.00, 5, \"The Porsche Taycan is a high-performance electric sports car that redefines what an electric vehicle can be. With stunning acceleration and a luxurious interior, it's built for enthusiasts.\"),\n    (\"Rivian R1T\", 67999.99, 7, \"The Rivian R1T is an all-electric pickup truck designed for adventure. With impressive off-road capabilities and a spacious interior, it's perfect for outdoor enthusiasts.\"),\n    (\"Lucid Air\", 169000.00, 3, \"The Lucid Air is a luxury electric sedan that offers exceptional range and cutting-edge technology. Its elegant design and spacious interior provide a premium driving experience.\"),\n    (\"Volkswagen ID.4\", 39999.99, 22, \"The Volkswagen ID.4 is an all-electric SUV that combines practicality with modern design. It offers a spacious interior and advanced safety features, making it a great family vehicle.\"),\n    (\"Mercedes-Benz EQC\", 69999.99, 9, \"The Mercedes-Benz EQC is a luxury electric SUV that delivers a refined driving experience. With high-quality materials and advanced technology, it embodies the brand's commitment to innovation.\"),\n    (\"Ford F-150 Lightning\", 59999.99, 14, \"The Ford F-150 Lightning is an electric version of America's best-selling truck. It offers impressive towing capacity and a range of smart features for work and play.\"),\n    (\"Polestar 2\", 59999.99, 11, \"The Polestar 2 is a stylish electric sedan that combines performance with sustainability. With a minimalist interior and cutting-edge tech, it's designed for the eco-conscious driver.\"),\n    (\"Mazda MX-30\", 34999.99, 16, \"The Mazda MX-30 is a compact electric crossover with a unique design and engaging driving dynamics. Its eco-friendly materials and tech features make it a standout choice.\"),\n    (\"BYD Han EV\", 59999.99, 6, \"The BYD Han EV is a luxury electric sedan that offers a spacious interior and impressive range. With advanced technology and a sleek design, it's perfect for those seeking comfort and performance.\"),\n    (\"Fisker Ocean\", 37999.99, 4, \"The Fisker Ocean is an electric SUV designed with sustainability in mind. Its eco-friendly materials and innovative features make it an attractive choice for environmentally conscious consumers.\"),\n    (\"Lotus Evija\", 200000.00, 2, \"The Lotus Evija is an all-electric hypercar that boasts breathtaking performance and cutting-edge technology. With a striking design and limited production, it's a collector's dream.\"),\n    (\"Canoo Lifestyle Vehicle\", 34900.00, 10, \"The Canoo Lifestyle Vehicle is a versatile electric vehicle designed for urban living. Its unique design and spacious interior make it perfect for families or adventure seekers.\"),\n    (\"Nissan Ariya\", 42999.99, 13, \"The Nissan Ariya is an all-electric crossover that combines style with practicality. With advanced technology and a spacious interior, it offers a comfortable ride for all passengers.\"),\n    (\"Tesla Model 3\", 39999.99, 27, \"The Tesla Model 3 is a compact electric sedan that offers impressive range and performance. With its minimalist design and advanced autopilot features, it's a favorite among EV enthusiasts.\"),\n    (\"BMW iX\", 84999.99, 5, \"The BMW iX is a luxury electric SUV that showcases the brand's commitment to sustainability. With a spacious interior and cutting-edge technology, it offers a premium driving experience.\"),\n    (\"Chevrolet Equinox EV\", 32999.99, 19, \"The Chevrolet Equinox EV is an all-electric compact SUV designed for everyday use. Its spacious interior and advanced safety features make it a great family vehicle.\"),\n    (\"Hyundai Ioniq 5\", 44999.99, 23, \"The Hyundai Ioniq 5 is a stylish electric crossover that offers a unique design and impressive range. With a spacious interior and advanced tech, it's perfect for modern drivers.\"),\n    (\"Kia EV6\", 49999.99, 15, \"The Kia EV6 is a sporty electric crossover that combines performance with practicality. Its sleek design and spacious cabin make it an appealing choice for families.\"),\n    (\"Mercedes-Benz EQS\", 102000.00, 3, \"The Mercedes-Benz EQS is a luxury electric sedan that redefines elegance and performance. With cutting-edge technology and a spacious interior, it offers a premium experience.\"),\n    (\"Tesla Model Y\", 49999.99, 20, \"The Tesla Model Y is a compact electric SUV that offers versatility and performance. With ample cargo space and advanced tech, it's perfect for families and adventurers alike.\"),\n    (\"Faraday Future FF 91\", 180000.00, 1, \"The Faraday Future FF 91 is a luxury electric SUV designed for the tech-savvy consumer. With futuristic design and advanced features, it aims to redefine the driving experience.\"),\n    (\"Audi Q4 e-tron\", 42999.99, 12, \"The Audi Q4 e-tron is a compact electric SUV that combines practicality with luxury. Its spacious interior and advanced technology make it a great choice for families.\"),\n    (\"Volvo XC40 Recharge\", 55999.99, 8, \"The Volvo XC40 Recharge is a stylish electric SUV that offers a premium driving experience. With safety features and a spacious interior, it's designed for modern families.\"),\n    (\"Rivian R1S\", 69999.99, 4, \"The Rivian R1S is an all-electric SUV built for adventure. With off-road capabilities and a spacious interior, it's perfect for those who love the great outdoors.\"),\n    (\"BMW i4\", 69999.99, 6, \"The BMW i4 is a sleek electric sedan that combines performance with luxury. Its powerful electric drivetrain and modern design make it a standout in its class.\"),\n    (\"Tesla Cybertruck\", 39999.99, 9, \"The Tesla Cybertruck is an all-electric pickup with a bold, futuristic design. Built for durability and utility, it offers impressive performance for work and play.\"),\n    (\"Kia Soul EV\", 32999.99, 17, \"The Kia Soul EV is a compact electric vehicle with a unique design and spacious interior. Its fun styling and tech features make it a popular choice among urban drivers.\"),\n    (\"Mercedes-Benz EQB\", 59999.99, 10, \"The Mercedes-Benz EQB is a compact electric SUV that offers luxury and practicality. With a spacious interior and state-of-the-art technology, it's perfect for families.\"),\n    (\"Jaguar I-PACE\", 69999.99, 7, \"The Jaguar I-PACE is a luxury electric SUV that delivers thrilling performance. With a stylish design and premium interior, it offers a dynamic driving experience.\"),\n    (\"Porsche Macan EV\", 79999.99, 2, \"The Porsche Macan EV is a compact electric SUV that combines sporty performance with luxury. Its agile handling and upscale interior make it a premium choice.\"),\n    (\"Ford Explorer EV\", 49999.99, 5, \"The Ford Explorer EV is an electric version of the popular SUV, designed for families. With ample space and advanced features, it's perfect for everyday adventures.\"),\n    (\"Toyota bZ4X\", 42999.99, 18, \"The Toyota bZ4X is a stylish electric SUV that offers a comfortable ride and advanced tech. Its spacious interior and eco-friendly design make it a great family vehicle.\"),\n    (\"Nissan Ariya e-4ORCE\", 45999.99, 11, \"The Nissan Ariya e-4ORCE is an all-electric SUV that features advanced all-wheel drive technology. With a roomy interior and high-tech features, it's perfect for any journey.\"),\n    (\"Chevrolet Silverado EV\", 59999.99, 3, \"The Chevrolet Silverado EV is an electric pickup truck that combines power with sustainability. With impressive towing capabilities and a spacious interior, it's designed for work and play.\"),\n    (\"Hyundai Ioniq 6\", 44999.99, 14, \"The Hyundai Ioniq 6 is a sleek electric sedan that offers a stylish design and impressive range. With advanced technology and a comfortable interior, it's perfect for daily commutes.\"),\n    (\"Volkswagen ID. Buzz\", 59999.99, 9, \"The Volkswagen ID. Buzz is an electric van that brings retro styling into the modern era. With a spacious interior and family-friendly features, it's perfect for road trips.\"),\n    (\"Tesla Roadster\", 200000.00, 1, \"The Tesla Roadster is a high-performance electric sports car that offers breathtaking speed and handling. With a sleek design and cutting-edge technology, it's built for thrill-seekers.\"),\n    (\"Fisker Pear\", 29999.99, 8, \"The Fisker Pear is an affordable electric vehicle designed for urban living. Its compact size and eco-friendly materials make it a great choice for city dwellers.\"),\n    (\"Polestar 3\", 69999.99, 4, \"The Polestar 3 is an electric SUV that combines performance with sustainability. With a spacious interior and advanced tech features, it's perfect for modern families.\"),\n    (\"Mercedes-Benz EQS SUV\", 120000.00, 2, \"The Mercedes-Benz EQS SUV is a luxury electric vehicle that offers unparalleled comfort and technology. Its spacious interior and premium materials make it a top-tier choice.\"),\n    (\"BMW iX3\", 59999.99, 5, \"The BMW iX3 is an all-electric SUV that combines the brand's signature performance with eco-friendly technology. With a spacious interior and advanced features, it's perfect for families.\"),\n    (\"Lucid Gravity\", 80000.00, 3, \"The Lucid Gravity is an upcoming luxury electric SUV that promises exceptional range and performance. With a focus on comfort and technology, it's designed for the discerning driver.\"),\n    (\"Rivian R1T Adventure\", 74999.99, 2, \"The Rivian R1T Adventure is an electric pickup designed for outdoor enthusiasts. With rugged capabilities and ample storage, it's perfect for camping and road trips.\"),\n    (\"Canoo Pickup\", 34900.00, 6, \"The Canoo Pickup is a versatile electric truck designed for utility and adventure. Its unique design and spacious bed make it perfect for work and play.\"),\n    (\"Tesla Model X\", 109999.99, 3, \"The Tesla Model X is a luxury electric SUV known for its distinctive falcon-wing doors and impressive performance. With a spacious interior and advanced technology, it's perfect for families.\"),\n    (\"Nissan Leaf Plus\", 36999.99, 9, \"The Nissan Leaf Plus offers an extended range and enhanced performance compared to its predecessor. It's an efficient and practical choice for eco-conscious drivers.\"),\n    (\"Hyundai Ioniq Electric\", 32999.99, 15, \"The Hyundai Ioniq Electric is a compact hatchback that offers a great balance of efficiency and practicality. With a comfortable interior and advanced tech, it's perfect for city driving.\"),\n    (\"Kia Niro Plug-In Hybrid\", 35999.99, 10, \"The Kia Niro Plug-In Hybrid combines electric efficiency with the convenience of a gasoline engine. Its spacious interior and versatile design make it a great family vehicle.\"),\n    (\"BMW i8\", 147500.00, 1, \"The BMW i8 is a plug-in hybrid sports car that offers stunning performance and futuristic design. With its powerful drivetrain and luxurious interior, it's a true driver's car.\"),\n    (\"Chevrolet Volt\", 32999.99, 12, \"The Chevrolet Volt is a plug-in hybrid that offers the flexibility of electric driving with a gasoline backup. Its spacious interior and advanced features make it a practical choice.\"),\n    (\"Toyota Prius Prime\", 28999.99, 20, \"The Toyota Prius Prime is a plug-in hybrid that combines efficiency with practicality. With a spacious interior and advanced safety features, it's perfect for eco-conscious families.\"),\n    (\"Ford Escape Plug-In Hybrid\", 35999.99, 11, \"The Ford Escape Plug-In Hybrid is a versatile SUV that offers the benefits of electric driving and traditional gasoline power. Its spacious interior and tech features make it family-friendly.\"),\n    (\"Volkswagen ID.3\", 39999.99, 10, \"The Volkswagen ID.3 is a compact electric hatchback that offers a spacious interior and modern design. With advanced technology and eco-friendly features, it's perfect for urban drivers.\"),\n    (\"Renault Zoe\", 29999.99, 15, \"The Renault Zoe is a compact electric car that offers practicality and efficiency for city driving. Its stylish design and advanced features make it a popular choice in Europe.\"),\n    (\"Peugeot e-208\", 32999.99, 12, \"The Peugeot e-208 is a stylish electric hatchback that combines performance with eco-friendliness. With a comfortable interior and modern tech, it's perfect for daily commutes.\"),\n    (\"Mini Electric\", 29999.99, 14, \"The Mini Electric is a compact car that offers the iconic Mini driving experience with electric efficiency. Its fun design and agile handling make it perfect for city driving.\"),\n    (\"Opel Mokka-e\", 34999.99, 9, \"The Opel Mokka-e is a stylish electric SUV that offers a spacious interior and modern design. With advanced technology and eco-friendly features, it's perfect for families.\"),\n    (\"Skoda Enyaq iV\", 39999.99, 8, \"The Skoda Enyaq iV is an all-electric SUV that combines practicality with modern design. Its spacious interior and advanced tech make it a great choice for families.\"),\n    (\"Fiat 500 Electric\", 29999.99, 20, \"The Fiat 500 Electric is a compact city car that offers a stylish design and electric efficiency. With its nimble handling and eco-friendly features, it's perfect for urban living.\"),\n    (\"Citroen e-C4\", 32999.99, 17, \"The Citroen e-C4 is a stylish electric hatchback that offers comfort and practicality. Its spacious interior and advanced technology make it a great choice for families.\"),\n    (\"Honda e\", 34999.99, 10, \"The Honda e is a compact electric car that blends retro styling with modern technology. Its agile handling and spacious interior make it perfect for city driving.\"),\n    (\"MG ZS EV\", 32999.99, 13, \"The MG ZS EV is an affordable electric SUV that offers practicality and modern design. With a spacious interior and advanced features, it's a great family vehicle.\"),\n    (\"Volkswagen ID.4 GTX\", 49999.99, 5, \"The Volkswagen ID.4 GTX is a sporty version of the popular ID.4 SUV. With enhanced performance and stylish design, it's perfect for those seeking a fun driving experience.\"),\n    (\"Renault Kangoo Z.E.\", 28999.99, 7, \"The Renault Kangoo Z.E. is an electric van designed for practicality and efficiency. With ample cargo space and eco-friendly features, it's ideal for businesses.\"),\n    (\"Peugeot e-Expert\", 35999.99, 4, \"The Peugeot e-Expert is an electric van that offers versatility and efficiency for business use. Its spacious interior and advanced tech features make it a practical choice.\"),\n    (\"Mercedes-Benz eSprinter\", 59999.99, 3, \"The Mercedes-Benz eSprinter is an electric van designed for urban deliveries. With a spacious cargo area and advanced technology, it's perfect for businesses aiming for sustainability.\"),\n    (\"Nissan Townstar EV\", 31999.99, 6, \"The Nissan Townstar EV is a compact electric van that offers practicality for urban use. Its efficient design and spacious cargo area make it ideal for small businesses.\"),\n    (\"Ford Transit Custom PHEV\", 49999.99, 2, \"The Ford Transit Custom PHEV is a plug-in hybrid van that combines electric efficiency with traditional power. Its spacious interior and advanced features make it a great work vehicle.\"),\n    (\"Fiat E-Ducato\", 39999.99, 5, \"The Fiat E-Ducato is an electric van designed for businesses seeking sustainability. With a spacious cargo area and efficient design, it's perfect for urban deliveries.\"),\n    (\"Volkswagen ID. Buzz Cargo\", 59999.99, 1, \"The Volkswagen ID. Buzz Cargo is an electric van that combines retro design with modern efficiency. Its spacious interior and eco-friendly features make it perfect for businesses.\"),\n    (\"Hyundai H350 FCEV\", 69999.99, 1, \"The Hyundai H350 FCEV is a fuel cell electric van that offers zero-emissions driving. With a spacious cargo area and advanced technology, it's ideal for businesses aiming for sustainability.\"),\n    (\"Canoo Lifestyle Vehicle Cargo\", 34900.00, 3, \"The Canoo Lifestyle Vehicle Cargo is a versatile electric vehicle designed for utility. Its spacious interior and unique design make it perfect for work and leisure.\"),\n    (\"Rivian R1T Explore\", 69999.99, 2, \"The Rivian R1T Explore is an electric pickup designed for outdoor adventures. With rugged capabilities and ample storage, it's perfect for camping and road trips.\"),\n    (\"Tesla Model 3 Performance\", 55999.99, 8, \"The Tesla Model 3 Performance is a high-performance version of the popular sedan. With enhanced acceleration and handling, it's perfect for driving enthusiasts.\"),\n    (\"Lucid Air Touring\", 94999.99, 3, \"The Lucid Air Touring is a luxury electric sedan that offers exceptional comfort and technology. Its spacious interior and impressive range make it a top-tier choice.\"),\n    (\"BMW iX M60\", 109999.99, 1, \"The BMW iX M60 is a high-performance electric SUV that combines luxury with exhilarating performance. With advanced technology and a spacious interior, it's perfect for the discerning driver.\"),\n    (\"Mercedes-Benz EQB 300 4MATIC\", 59999.99, 5, \"The Mercedes-Benz EQB 300 4MATIC is a compact electric SUV that offers luxury and versatility. With a spacious interior and advanced technology, it's perfect for families on the go.\"),\n    (\"Ford Mustang Mach-E California Route 1\", 54999.99, 2, \"The Ford Mustang Mach-E California Route 1 is a special edition electric SUV that offers extended range and performance. Its stylish design and spacious interior make it a great choice for families.\"),\n    (\"Porsche Taycan Cross Turismo\", 103000.00, 1, \"The Porsche Taycan Cross Turismo is a luxury electric wagon that combines performance with practicality. With a spacious interior and advanced technology, it's perfect for active lifestyles.\"),\n    (\"Chevrolet Bolt EUV\", 42999.99, 4, \"The Chevrolet Bolt EUV is an electric SUV that offers a roomy interior and advanced tech features. With its stylish design and practicality, it's a great family vehicle.\"),\n    (\"Hyundai Ioniq 5 N\", 59999.99, 3, \"The Hyundai Ioniq 5 N is a sporty electric crossover that offers thrilling performance and modern design. With advanced technology and a spacious interior, it's perfect for enthusiasts.\"),\n    (\"Nissan Leaf e+ 2023\", 38999.99, 6, \"The Nissan Leaf e+ 2023 offers an extended range and enhanced features. With its spacious interior and eco-friendly design, it's perfect for everyday driving.\"),\n    (\"Volkswagen ID. Buzz Family\", 59999.99, 2, \"The Volkswagen ID. Buzz Family is an electric van designed for family adventures. With a spacious interior and modern features, it's perfect for road trips.\"),\n    (\"Kia Soul EV 2023\", 34999.99, 8, \"The Kia Soul EV 2023 is a compact electric car that offers a unique design and spacious interior. Its fun styling and efficient performance make it a popular choice.\"),\n    (\"Fiat 500e\", 29999.99, 10, \"The Fiat 500e is an electric version of the iconic city car. Its compact size and stylish design make it perfect for urban driving.\"),\n    (\"MG Marvel R Electric\", 42999.99, 5, \"The MG Marvel R Electric is a stylish electric SUV that offers performance and practicality. With a spacious interior and advanced tech, it's perfect for families.\"),\n    (\"Peugeot e-2008\", 34999.99, 9, \"The Peugeot e-2008 is a compact electric SUV that combines modern design with practicality. Its spacious interior and advanced features make it a great choice for urban living.\"),\n    (\"Opel Mokka-e 2023\", 35999.99, 4, \"The Opel Mokka-e 2023 is an electric SUV that offers a stylish design and advanced technology. Its spacious interior and eco-friendly features make it perfect for families.\"),\n    (\"Citroen ë-C4\", 32999.99, 12, \"The Citroen ë-C4 is an electric hatchback that combines comfort with modern design. Its spacious interior and eco-friendly features make it a great choice for daily commutes.\"),\n    (\"Honda e 2023\", 34999.99, 7, \"The Honda e 2023 is a compact electric car that offers retro styling and modern technology. Its agile handling and spacious interior make it perfect for city driving.\"),\n    (\"Skoda Enyaq Coupe iV\", 44999.99, 3, \"The Skoda Enyaq Coupe iV is a stylish electric SUV that offers a sporty design and spacious interior. With advanced technology, it's perfect for modern families.\"),\n    (\"Tesla Model Y Long Range\", 54999.99, 8, \"The Tesla Model Y Long Range is a versatile electric SUV that offers extended range and performance. Its spacious interior and advanced tech make it perfect for families.\"),\n    (\"BMW i4 M50\", 69999.99, 2, \"The BMW i4 M50 is a high-performance electric sedan that combines luxury with thrilling performance. With its powerful drivetrain and modern design, it's perfect for enthusiasts.\"),\n    (\"Mercedes-Benz EQS 450+\", 102000.00, 1, \"The Mercedes-Benz EQS 450+ is a luxury electric sedan that offers exceptional comfort and technology. Its spacious interior and premium materials make it a top-tier choice.\"),\n    (\"Ford F-150 Lightning XLT\", 59999.99, 4, \"The Ford F-150 Lightning XLT is an electric pickup that combines power with sustainability. Its spacious interior and advanced features make it a great work vehicle.\"),\n    (\"Lucid Air Grand Touring\", 139000.00, 1, \"The Lucid Air Grand Touring is a luxury electric sedan that offers unparalleled performance and technology. Its spacious interior and stunning design make it a top-tier choice.\"),\n    (\"Hyundai Ioniq 6 N Line\", 49999.99, 3, \"The Hyundai Ioniq 6 N Line is a sporty electric sedan that combines performance with practicality. With its modern design and advanced features, it's perfect for enthusiasts.\"),\n    (\"Rivian R1S Adventure\", 74999.99, 2, \"The Rivian R1S Adventure is an electric SUV designed for outdoor adventures. With rugged capabilities and ample storage, it's perfect for camping and road trips.\"),\n    (\"Tesla Roadster 2023\", 200000.00, 1, \"The Tesla Roadster 2023 is a high-performance electric sports car that offers breathtaking speed and handling. With a sleek design and cutting-edge technology, it's built for thrill-seekers.\"),\n    (\"Canoo Lifestyle Vehicle Family\", 34900.00, 2, \"The Canoo Lifestyle Vehicle Family is a versatile electric vehicle designed for families. Its spacious interior and unique design make it perfect for road trips.\"),\n    (\"Nissan Ariya e-4ORCE 2023\", 45999.99, 3, \"The Nissan Ariya e-4ORCE 2023 is an all-electric SUV that features advanced all-wheel drive technology. With a roomy interior and high-tech features, it's perfect for any journey.\"),\n    (\"Volkswagen ID. Buzz Cargo 2023\", 59999.99, 2, \"The Volkswagen ID. Buzz Cargo 2023 is an electric van that combines retro design with modern efficiency. Its spacious interior and eco-friendly features make it perfect for businesses.\"),\n    (\"BMW iX3 2023\", 59999.99, 3, \"The BMW iX3 2023 is an all-electric SUV that combines the brand's signature performance with eco-friendly technology. With a spacious interior and advanced features, it's perfect for families.\"),\n    (\"Chevrolet Blazer EV\", 44999.99, 4, \"The Chevrolet Blazer EV is a stylish electric SUV that offers a spacious interior and modern design. With advanced technology and eco-friendly features, it's perfect for families.\"),\n    (\"Kia EV9\", 69999.99, 1, \"The Kia EV9 is a large electric SUV that combines space with modern design. With advanced technology and a comfortable interior, it's perfect for families.\"),\n    (\"Ford Explorer Electric\", 49999.99, 2, \"The Ford Explorer Electric is an electric version of the popular SUV, designed for families. With ample space and advanced features, it's perfect for everyday adventures.\"),\n    (\"Porsche Macan EV 2023\", 79999.99, 1, \"The Porsche Macan EV 2023 is a compact electric SUV that combines sporty performance with luxury. Its agile handling and upscale interior make it a premium choice.\"),\n    (\"Lucid Air Sapphire\", 169000.00, 1, \"The Lucid Air Sapphire is the ultimate luxury electric sedan that offers breathtaking performance. With a spacious and opulent interior, it's designed for those who demand the best.\"),\n    (\"Mercedes-Benz EQE\", 74999.99, 2, \"The Mercedes-Benz EQE is a luxury electric sedan that combines performance with advanced technology. Its spacious interior and premium materials make it a top-tier choice.\")\n]"