"[\n    (\"Cotton Fabric\", 5.99, 150, \"Soft and breathable cotton fabric, perfect for quilting, dressmaking, and home decor. Available in a variety of colors and patterns to suit any project.\"),\n    (\"Silk Satin\", 12.49, 80, \"Luxurious silk satin with a smooth finish, ideal for evening wear and special occasions. Its elegant drape adds a touch of sophistication to any garment.\"),\n    (\"Denim Fabric\", 8.99, 100, \"Durable denim fabric suitable for jeans, jackets, and skirts. Available in various washes, it combines style and functionality.\"),\n    (\"Linen Blend\", 7.49, 120, \"Lightweight linen blend fabric that is perfect for summer clothing. Its natural fibers provide breathability and comfort.\"),\n    (\"Fleece Fabric\", 6.99, 200, \"Cozy fleece fabric, ideal for making blankets, jackets, and loungewear. Soft and warm, it’s perfect for chilly days.\"),\n    (\"Tulle Netting\", 4.99, 180, \"Delicate tulle netting fabric, great for crafting, wedding decor, and costumes. It adds a whimsical touch to any project.\"),\n    (\"Canvas Fabric\", 9.99, 75, \"Heavyweight canvas fabric, perfect for bags, outdoor gear, and upholstery. Its sturdy construction ensures durability.\"),\n    (\"Polyester Poplin\", 5.49, 160, \"Versatile polyester poplin fabric, ideal for shirts, dresses, and linings. It is easy to care for and maintains its shape well.\"),\n    (\"Bamboo Fabric\", 10.99, 90, \"Eco-friendly bamboo fabric that is soft, breathable, and hypoallergenic. Perfect for clothing and home textiles.\"),\n    (\"Velvet Fabric\", 14.99, 50, \"Rich velvet fabric with a plush texture, perfect for evening gowns and upholstery. It adds a touch of luxury to any design.\"),\n    (\"Jersey Knit\", 7.99, 140, \"Soft jersey knit fabric, ideal for t-shirts, dresses, and activewear. Its stretch makes it comfortable and easy to wear.\"),\n    (\"Corduroy Fabric\", 8.49, 70, \"Classic corduroy fabric with a ribbed texture, perfect for pants and jackets. It offers warmth and style for cooler weather.\"),\n    (\"Satin Fabric\", 11.99, 60, \"Gleaming satin fabric that drapes beautifully, perfect for formal dresses and linings. Its luxurious feel elevates any design.\"),\n    (\"Terry Cloth\", 9.49, 130, \"Absorbent terry cloth fabric, perfect for towels and bathrobes. Soft and plush, it provides comfort and functionality.\"),\n    (\"Organza Fabric\", 5.99, 110, \"Lightweight organza fabric, ideal for overlays and decorations. Its crisp texture adds elegance to special occasions.\"),\n    (\"Ripstop Nylon\", 10.49, 85, \"Durable ripstop nylon fabric, great for outdoor gear and bags. Its tear-resistant properties make it a reliable choice.\"),\n    (\"Mesh Fabric\", 4.49, 200, \"Breathable mesh fabric, perfect for sportswear and linings. Its lightweight structure allows for ventilation and comfort.\"),\n    (\"Chiffon Fabric\", 8.99, 95, \"Flowy chiffon fabric, ideal for blouses and evening wear. Its sheer quality adds a romantic touch to any outfit.\"),\n    (\"Faux Leather\", 12.99, 40, \"Stylish faux leather fabric that mimics the look of real leather. Perfect for jackets, bags, and upholstery projects.\"),\n    (\"Quilting Cotton\", 6.49, 150, \"High-quality quilting cotton, perfect for patchwork and quilting projects. Available in a variety of prints and colors.\"),\n    (\"Burlap Fabric\", 3.99, 160, \"Natural burlap fabric, ideal for rustic decor and crafts. Its earthy texture adds a charming touch to any project.\"),\n    (\"Satin Organza\", 9.99, 75, \"Elegant satin organza fabric, perfect for formal wear and decorations. Its sheen and structure make it a favorite for events.\"),\n    (\"Faux Fur\", 15.99, 30, \"Luxurious faux fur fabric, ideal for coats and accessories. Soft and warm, it adds glamour to any piece.\"),\n    (\"Wool Blend\", 11.49, 55, \"Warm wool blend fabric, perfect for sweaters and outerwear. Its blend provides comfort and durability for cold weather.\"),\n    (\"Knit Fabric\", 6.99, 125, \"Stretchy knit fabric, perfect for activewear and casual clothing. Its comfort and flexibility make it a wardrobe staple.\"),\n    (\"Tartan Fabric\", 7.49, 90, \"Classic tartan fabric, ideal for skirts, shirts, and home decor. Its timeless pattern adds a touch of tradition.\"),\n    (\"Georgette Fabric\", 8.49, 65, \"Lightweight georgette fabric, perfect for flowing dresses and blouses. Its slightly crinkled texture adds interest to designs.\"),\n    (\"Printed Canvas\", 9.99, 45, \"Colorful printed canvas fabric, great for bags and home projects. Its durability and vibrant patterns make it a favorite.\"),\n    (\"Polyester Satin\", 10.49, 80, \"Shiny polyester satin fabric, ideal for evening gowns and linings. It offers a luxurious look at an affordable price.\"),\n    (\"Cotton Twill\", 7.99, 130, \"Sturdy cotton twill fabric, perfect for pants and jackets. Its diagonal weave provides durability and style.\"),\n    (\"Lace Fabric\", 12.99, 50, \"Intricate lace fabric, perfect for overlays and special occasions. It adds a delicate touch to any garment.\"),\n    (\"Stretch Velvet\", 14.49, 40, \"Soft stretch velvet fabric, ideal for form-fitting dresses and accessories. Its rich texture enhances any design.\"),\n    (\"Faux Suede\", 11.99, 60, \"Soft faux suede fabric, perfect for jackets and bags. Its luxurious feel and appearance make it a versatile choice.\"),\n    (\"Bamboo Jersey\", 9.49, 70, \"Eco-friendly bamboo jersey fabric, ideal for t-shirts and activewear. Its softness and breathability provide ultimate comfort.\"),\n    (\"Houndstooth Fabric\", 8.99, 55, \"Classic houndstooth fabric, perfect for jackets and skirts. Its timeless pattern adds sophistication to any outfit.\"),\n    (\"Silk Chiffon\", 13.99, 40, \"Delicate silk chiffon fabric, ideal for flowing dresses and scarves. Its lightweight nature creates a beautiful drape.\"),\n    (\"Cotton Sateen\", 7.49, 100, \"Smooth cotton sateen fabric, perfect for shirts and dresses. Its slight sheen adds elegance to everyday wear.\"),\n    (\"Embroidered Fabric\", 10.99, 45, \"Beautifully embroidered fabric, ideal for special occasion garments. It adds intricate detail and texture to designs.\"),\n    (\"Terry Cloth Knit\", 8.49, 85, \"Soft terry cloth knit fabric, perfect for loungewear and casual clothing. Its comfort makes it a favorite for relaxation.\"),\n    (\"Canvas Duck\", 9.99, 60, \"Heavy-duty canvas duck fabric, great for bags and outdoor gear. Its durability ensures it withstands wear and tear.\"),\n    (\"Faux Leather Suede\", 12.49, 50, \"Stylish faux leather suede fabric, ideal for jackets and accessories. It offers the look of real suede with easy care.\"),\n    (\"Gingham Fabric\", 6.99, 130, \"Classic gingham fabric, perfect for shirts, dresses, and home decor. Its checkered pattern adds a cheerful touch.\"),\n    (\"Silk Blend\", 14.99, 35, \"Luxurious silk blend fabric, perfect for high-end garments. Its softness and drape create stunning silhouettes.\"),\n    (\"Cotton Lawn\", 7.99, 90, \"Lightweight cotton lawn fabric, ideal for summer dresses and blouses. Its fine weave ensures breathability and comfort.\"),\n    (\"Neoprene Fabric\", 11.49, 45, \"Thick neoprene fabric, great for structured garments and accessories. Its unique texture adds dimension to designs.\"),\n    (\"Hemp Fabric\", 9.99, 70, \"Sustainable hemp fabric, perfect for eco-friendly clothing and accessories. Its durability and breathability make it a great choice.\"),\n    (\"Stretch Denim\", 8.49, 80, \"Comfortable stretch denim fabric, ideal for jeans and skirts. Its flexibility ensures a perfect fit and ease of movement.\"),\n    (\"Flannel Fabric\", 6.99, 110, \"Soft flannel fabric, perfect for shirts and pajamas. Its warmth and comfort make it ideal for cooler weather.\"),\n    (\"Satin Backed Crepe\", 12.99, 40, \"Elegant satin backed crepe fabric, great for dresses and blouses. Its smooth surface and drape create stunning designs.\"),\n    (\"Taffeta Fabric\", 10.49, 50, \"Crisp taffeta fabric, ideal for formal dresses and linings. Its structure adds volume and elegance to any garment.\"),\n    (\"Cotton Muslin\", 4.99, 140, \"Lightweight cotton muslin fabric, perfect for draping and mock-ups. Its versatility makes it a favorite among sewists.\"),\n    (\"Faux Fur Trim\", 7.49, 95, \"Luxurious faux fur trim, ideal for adding a touch of glamour to garments. Soft and stylish, it enhances any design.\"),\n    (\"Tropical Print Fabric\", 8.99, 70, \"Vibrant tropical print fabric, perfect for summer clothing and accessories. Its lively patterns bring a fun vibe to any project.\"),\n    (\"Bamboo Canvas\", 9.99, 60, \"Eco-friendly bamboo canvas fabric, ideal for bags and crafts. Its durability and natural fibers make it a sustainable choice.\"),\n    (\"Polyester Crepe\", 10.49, 80, \"Flowy polyester crepe fabric, great for dresses and skirts. Its lightweight nature provides comfort and elegance.\"),\n    (\"Jacquard Fabric\", 11.99, 40, \"Intricate jacquard fabric, perfect for upholstery and special garments. Its textured patterns add depth and style.\"),\n    (\"Cotton Ribbing\", 5.49, 150, \"Soft cotton ribbing fabric, ideal for cuffs and necklines. Its stretch provides comfort and a polished finish.\"),\n    (\"Silk Georgette\", 13.49, 35, \"Delicate silk georgette fabric, perfect for flowing dresses and blouses. Its lightweight quality adds elegance to any design.\"),\n    (\"Denim Chambray\", 7.99, 90, \"Lightweight chambray denim fabric, ideal for shirts and dresses. Its casual look is perfect for everyday wear.\"),\n    (\"Satin Stretch\", 12.99, 50, \"Shiny satin stretch fabric, perfect for form-fitting garments. It provides comfort and a sleek silhouette.\"),\n    (\"Cotton Canvas\", 8.49, 100, \"Sturdy cotton canvas fabric, great for bags and home decor. Its durability ensures it stands the test of time.\"),\n    (\"Woven Cotton\", 6.99, 120, \"Soft woven cotton fabric, ideal for shirts and dresses. Its breathable nature makes it perfect for warm weather.\"),\n    (\"Recycled Polyester\", 10.49, 75, \"Eco-friendly recycled polyester fabric, perfect for activewear and casual clothing. Its sustainable design promotes environmental responsibility.\"),\n    (\"Taffeta Organza\", 9.99, 50, \"Crisp taffeta organza fabric, ideal for overlays and formal wear. Its structure adds volume and elegance to any design.\"),\n    (\"Linen Cotton Blend\", 7.49, 80, \"Lightweight linen cotton blend fabric, perfect for summer clothing. Its breathable nature ensures comfort on warm days.\"),\n    (\"Modal Fabric\", 8.99, 70, \"Soft modal fabric, ideal for t-shirts and loungewear. Its silky feel and drape make it a favorite for casual wear.\"),\n    (\"Silk Organza\", 14.49, 30, \"Delicate silk organza fabric, perfect for formal wear and decorations. Its sheer quality adds a touch of elegance.\"),\n    (\"Lightweight Twill\", 6.49, 140, \"Soft lightweight twill fabric, ideal for shirts and dresses. Its smooth texture provides comfort and style.\"),\n    (\"Cotton Flannel\", 7.99, 90, \"Warm cotton flannel fabric, perfect for shirts and pajamas. Its softness makes it ideal for cozy clothing.\"),\n    (\"Knitted Fleece\", 8.49, 75, \"Soft knitted fleece fabric, perfect for blankets and loungewear. Its warmth and comfort make it a favorite for relaxation.\"),\n    (\"Printed Jersey\", 9.99, 60, \"Colorful printed jersey fabric, ideal for t-shirts and activewear. Its stretch provides comfort and ease of movement.\"),\n    (\"Tropical Rayon\", 10.49, 50, \"Lightweight tropical rayon fabric, perfect for summer dresses and skirts. Its flowy nature adds a breezy feel to any outfit.\"),\n    (\"Stretch Cotton\", 7.49, 100, \"Comfortable stretch cotton fabric, ideal for casual clothing. Its flexibility ensures a perfect fit for all body types.\"),\n    (\"Faux Leatherette\", 12.99, 40, \"Stylish faux leatherette fabric, great for bags and jackets. It offers a chic look with easy maintenance.\"),\n    (\"Cotton Voile\", 5.99, 130, \"Lightweight cotton voile fabric, perfect for blouses and summer dresses. Its sheer quality adds a delicate touch.\"),\n    (\"Silk Satin Blend\", 13.49, 35, \"Luxurious silk satin blend fabric, ideal for high-end garments. Its soft drape and sheen create stunning designs.\"),\n    (\"Heavyweight Canvas\", 9.99, 60, \"Durable heavyweight canvas fabric, perfect for bags and outdoor gear. Its sturdy construction ensures longevity.\"),\n    (\"Wool Felt\", 11.99, 45, \"Soft wool felt fabric, ideal for crafts and home decor. Its thickness provides warmth and structure for various projects.\"),\n    (\"Cotton Spandex\", 8.49, 80, \"Comfortable cotton spandex fabric, ideal for activewear and casual clothing. Its stretch ensures a perfect fit and ease of movement.\")\n]"