"[\n    (\"Adhesive Bandages\", 5.99, 200, \"A variety pack of adhesive bandages in different sizes and designs. Perfect for covering minor cuts and scrapes to promote healing.\"),\n    (\"Antiseptic Wipes\", 4.49, 150, \"Convenient antiseptic wipes for cleaning wounds and preventing infection. Each wipe is individually packaged for easy use on the go.\"),\n    (\"Gauze Pads\", 7.99, 100, \"Sterile gauze pads that provide effective wound coverage and absorbency. Ideal for larger cuts or surgical incisions.\"),\n    (\"Medical Tape\", 3.99, 120, \"Strong and durable medical tape for securing dressings and gauze. It is hypoallergenic and easy to tear for quick application.\"),\n    (\"Instant Cold Packs\", 9.99, 80, \"Single-use instant cold packs that provide immediate relief for sprains and bruises. Simply squeeze to activate and apply to the affected area.\"),\n    (\"Elastic Bandage\", 6.49, 75, \"A stretchy elastic bandage that provides support and compression for sprains and strains. It is reusable and adjustable for a comfortable fit.\"),\n    (\"Burn Cream\", 8.99, 60, \"Soothing burn cream designed to relieve pain and promote healing for minor burns. Contains aloe vera and other healing ingredients.\"),\n    (\"First Aid Kit\", 29.99, 50, \"A comprehensive first aid kit containing essential supplies for emergencies. Includes bandages, antiseptics, and a first aid manual.\"),\n    (\"Scissors\", 2.99, 100, \"Medical scissors designed for cutting gauze, tape, and clothing in emergencies. The blunt tip ensures safety while providing effective cutting.\"),\n    (\"Tweezers\", 3.49, 90, \"Precision tweezers for removing splinters and foreign objects. Ergonomically designed for comfort and control.\"),\n    (\"CPR Face Shield\", 12.99, 40, \"A CPR face shield with a one-way valve for safe mouth-to-mouth resuscitation. Compact and easy to carry in any first aid kit.\"),\n    (\"Hydrogen Peroxide\", 4.99, 60, \"A bottle of hydrogen peroxide for disinfecting wounds and cleaning surfaces. Effective for killing bacteria and promoting healing.\"),\n    (\"Thermometer\", 15.99, 30, \"A digital thermometer for quick and accurate temperature readings. Features a clear display and is suitable for all ages.\"),\n    (\"Eye Wash Solution\", 7.49, 70, \"Sterile eye wash solution for flushing out irritants and contaminants from the eyes. Comes in a convenient squeeze bottle.\"),\n    (\"Elastic Ankle Support\", 10.99, 50, \"An elastic ankle support that provides compression and stability for injured ankles. Adjustable for a secure fit.\"),\n    (\"Triangular Bandage\", 3.99, 80, \"A versatile triangular bandage for slings and securing splints. Made from soft, breathable material for comfort.\"),\n    (\"First Aid Manual\", 14.99, 20, \"An informative first aid manual covering essential techniques and procedures. A must-have for anyone interested in emergency preparedness.\"),\n    (\"Nitrile Gloves\", 11.99, 100, \"Disposable nitrile gloves that provide protection during medical procedures. Latex-free and suitable for sensitive skin.\"),\n    (\"Cotton Balls\", 2.49, 150, \"Soft cotton balls for applying ointments or cleaning wounds. A versatile addition to any first aid kit.\"),\n    (\"Ice Pack Wrap\", 9.49, 40, \"An ice pack wrap that secures cold packs comfortably around injuries. Ideal for sprains, strains, and post-surgery recovery.\"),\n    (\"Alcohol Swabs\", 3.29, 200, \"Individually packaged alcohol swabs for disinfecting skin before injections or procedures. Convenient and easy to carry.\"),\n    (\"First Aid Sticker\", 1.99, 300, \"Fun and colorful first aid stickers for kids to make healing more enjoyable. Perfect for covering bandages and encouraging healing.\"),\n    (\"Surgical Masks\", 12.99, 50, \"Disposable surgical masks to protect against germs and contamination. Essential for medical professionals and first responders.\"),\n    (\"Wound Closure Strips\", 6.99, 60, \"Sterile wound closure strips that provide support for minor cuts and lacerations. An alternative to stitches for small wounds.\"),\n    (\"First Aid Flashlight\", 15.49, 30, \"A compact flashlight for use in emergencies or low-light situations. It features a durable design and bright LED light.\"),\n    (\"Burn Dressing\", 10.49, 25, \"Specialized burn dressings that provide cooling relief and promote healing for burns. Sterile and easy to apply.\"),\n    (\"Finger Splint\", 4.99, 50, \"A finger splint designed to immobilize and support injured fingers. Adjustable for a comfortable fit and easy application.\"),\n    (\"Splinter Removal Kit\", 8.99, 30, \"A kit that includes tweezers and antiseptic wipes specifically for splinter removal. Convenient for home and travel.\"),\n    (\"Antibiotic Ointment\", 5.99, 80, \"An antibiotic ointment that helps prevent infection in minor cuts and scrapes. Easy to apply and effective for healing.\"),\n    (\"Safety Pins\", 2.99, 200, \"A pack of safety pins for securing bandages and dressings. A simple yet essential item for any first aid kit.\"),\n    (\"Cough Drops\", 4.49, 120, \"Soothing cough drops that provide relief for sore throats and coughs. A great addition to your first aid supplies.\"),\n    (\"Hydration Salts\", 7.99, 50, \"Electrolyte hydration salts for replenishing fluids during illness or dehydration. Easy to mix with water for quick relief.\"),\n    (\"Knee Brace\", 14.99, 40, \"A supportive knee brace that provides compression and stability for injured knees. Adjustable for a personalized fit.\"),\n    (\"Ear Plugs\", 3.49, 100, \"Soft ear plugs for reducing noise and protecting ears in loud environments. Ideal for sleeping, swimming, or travel.\"),\n    (\"Surgical Tape\", 4.99, 100, \"Gentle surgical tape designed for securing dressings without irritating the skin. Easy to tear and apply.\"),\n    (\"Heat Pack\", 9.99, 30, \"Reusable heat pack for soothing sore muscles and joints. Microwaveable for quick and convenient heat therapy.\"),\n    (\"First Aid Checklist\", 1.99, 200, \"A handy checklist for ensuring your first aid kit is fully stocked. Helps you keep track of essential supplies.\"),\n    (\"Vaseline\", 3.99, 80, \"Multi-purpose Vaseline for moisturizing skin and protecting minor cuts. A versatile product for first aid and skincare.\"),\n    (\"Insect Bite Relief\", 6.49, 50, \"A topical solution that provides relief from itching and swelling caused by insect bites. Fast-acting and soothing.\"),\n    (\"Nasal Spray\", 8.99, 40, \"Saline nasal spray for relieving nasal congestion and dryness. Safe for all ages and easy to use.\"),\n    (\"Finger Bandages\", 4.49, 100, \"Specially designed finger bandages for covering cuts and scrapes. Flexible and comfortable for everyday use.\"),\n    (\"Travel First Aid Kit\", 19.99, 25, \"A compact first aid kit designed for travel emergencies. Includes essential supplies in a portable case.\"),\n    (\"Antihistamine Tablets\", 7.99, 60, \"Over-the-counter antihistamine tablets for relieving allergy symptoms. Fast-acting and effective for seasonal allergies.\"),\n    (\"Burn Gel\", 8.49, 40, \"Cooling burn gel that soothes and protects minor burns. A must-have for kitchens and outdoor activities.\"),\n    (\"Hot/Cold Gel Pack\", 10.99, 50, \"Versatile gel pack that can be used hot or cold for pain relief. Ideal for injuries, cramps, and muscle soreness.\"),\n    (\"Chlorine Wipes\", 5.49, 80, \"Disinfectant wipes for cleaning surfaces and equipment. Effective against a wide range of germs and bacteria.\"),\n    (\"Finger Cots\", 2.99, 100, \"Disposable finger cots for protecting injured fingers while allowing mobility. Ideal for minor wounds and everyday use.\"),\n    (\"Pet First Aid Kit\", 24.99, 20, \"A specialized first aid kit for pets, including supplies for treating injuries and emergencies. Essential for pet owners.\"),\n    (\"Thermal Blankets\", 9.99, 50, \"Emergency thermal blankets designed to retain body heat in critical situations. Lightweight and compact for easy storage.\"),\n    (\"Mouthguard\", 12.99, 30, \"A protective mouthguard for sports and activities to prevent dental injuries. Customizable for a comfortable fit.\"),\n    (\"Suture Kit\", 19.99, 15, \"A professional-grade suture kit for emergency wound closure. Includes various sutures and tools for medical use.\"),\n    (\"Portable Defibrillator\", 999.99, 5, \"A life-saving portable defibrillator for use in cardiac emergencies. Equipped with voice prompts for easy operation.\"),\n    (\"Emergency Blanket\", 4.99, 100, \"Compact emergency blanket that provides warmth and protection. Perfect for outdoor activities and emergency kits.\"),\n    (\"Medical Dictionary\", 15.99, 20, \"A comprehensive medical dictionary for quick reference to medical terms and definitions. Ideal for students and professionals.\"),\n    (\"Ointment Applicator\", 3.49, 80, \"An ergonomic ointment applicator for easy application of creams and ointments. Helps maintain hygiene during use.\"),\n    (\"First Aid Training Manual\", 24.99, 15, \"A detailed manual for first aid training, covering essential techniques and protocols. Great for instructors and learners alike.\"),\n    (\"Nasal Swabs\", 4.99, 100, \"Sterile nasal swabs for collecting samples or cleaning nasal passages. Safe and easy to use for various applications.\"),\n    (\"Portable Ice Pack\", 7.99, 60, \"A portable ice pack that stays cold for hours, perfect for injuries on the go. Easy to store and carry.\"),\n    (\"Heat Therapy Wrap\", 15.49, 30, \"A heat therapy wrap designed for targeted pain relief in sore muscles and joints. Adjustable for comfort.\"),\n    (\"Emergency Whistle\", 2.49, 150, \"A loud emergency whistle for signaling for help in critical situations. Compact and lightweight for easy carrying.\"),\n    (\"Wound Care Kit\", 19.99, 25, \"A complete wound care kit with everything needed for treating cuts and abrasions. Perfect for home or travel.\"),\n    (\"Surgical Gloves\", 10.99, 100, \"Disposable surgical gloves for maintaining hygiene during medical procedures. Latex-free and comfortable for extended wear.\"),\n    (\"Portable First Aid Guide\", 5.99, 80, \"A pocket-sized first aid guide with essential information for emergencies. Easy to read and carry in any bag.\"),\n    (\"Emergency Contact Card\", 1.99, 200, \"A card for listing emergency contacts and medical information. Essential for quick access during emergencies.\"),\n    (\"Blood Pressure Monitor\", 49.99, 20, \"An automatic blood pressure monitor for tracking health at home. User-friendly with clear digital readings.\"),\n    (\"Wound Dressing\", 6.49, 100, \"Sterile wound dressings that provide protection and promote healing. Available in various sizes for different needs.\"),\n    (\"Portable Oxygen Kit\", 199.99, 10, \"A portable oxygen kit for individuals with respiratory conditions. Includes everything needed for emergency oxygen delivery.\"),\n    (\"Allergy Relief Spray\", 8.49, 40, \"A fast-acting allergy relief spray for nasal congestion and sneezing. Convenient and easy to use on the go.\"),\n    (\"Surgical Sponges\", 7.99, 50, \"Sterile surgical sponges for absorbing fluids during procedures. Essential for maintaining a clean environment.\"),\n    (\"Emergency Response Kit\", 79.99, 15, \"A comprehensive emergency response kit for natural disasters and emergencies. Includes food, water, and medical supplies.\"),\n    (\"Inhaler Spacer\", 12.99, 30, \"An inhaler spacer designed to improve medication delivery for asthma patients. Compatible with most inhalers for effective use.\"),\n    (\"Trauma Shears\", 5.99, 80, \"Heavy-duty trauma shears for cutting through clothing and bandages in emergencies. Essential for first responders.\"),\n    (\"Blood Glucose Monitor\", 39.99, 20, \"A digital blood glucose monitor for managing diabetes. Provides quick and accurate readings for daily monitoring.\"),\n    (\"Emergency Roadside Kit\", 49.99, 10, \"A roadside emergency kit that includes essential tools and supplies for car troubles. Perfect for keeping in your vehicle.\"),\n    (\"Portable Water Purifier\", 29.99, 25, \"A portable water purifier for ensuring safe drinking water in emergencies. Compact and easy to use for outdoor activities.\"),\n    (\"Medical ID Bracelet\", 19.99, 50, \"A medical ID bracelet that alerts others to your health conditions. Engraved with essential information for emergencies.\"),\n    (\"Essential Oil Roll-On\", 9.99, 40, \"A roll-on essential oil blend for soothing headaches and stress relief. Convenient size for on-the-go use.\"),\n    (\"First Aid Training Course\", 99.99, 10, \"A comprehensive first aid training course for individuals and groups. Teaches essential skills for emergency situations.\"),\n    (\"Portable AED Trainer\", 199.99, 5, \"A portable AED trainer for practicing CPR and defibrillation techniques. Ideal for training sessions and workshops.\"),\n    (\"Pediatric First Aid Kit\", 34.99, 20, \"A first aid kit specifically designed for children, including child-friendly supplies. Essential for parents and caregivers.\"),\n    (\"Emergency Survival Guide\", 12.99, 30, \"A survival guide covering essential skills and knowledge for emergencies. A valuable resource for preparedness.\"),\n    (\"Medical Supply Organizer\", 25.99, 15, \"A multi-compartment organizer for keeping medical supplies neat and accessible. Perfect for home or travel use.\"),\n    (\"Injury Recovery Journal\", 9.99, 40, \"A journal for tracking recovery progress and managing injuries. Helps you stay motivated and organized during healing.\"),\n    (\"Outdoor First Aid Kit\", 29.99, 20, \"A durable first aid kit designed for outdoor adventures and emergencies. Includes essential supplies for hiking and camping.\"),\n    (\"Emergency Blanket Roll\", 3.99, 100, \"A roll of emergency blankets for warmth in critical situations. Lightweight and compact for easy storage.\"),\n    (\"Portable First Aid Station\", 89.99, 10, \"A portable first aid station for workplaces and events. Includes a variety of supplies for treating injuries.\"),\n    (\"Cold Sore Treatment\", 8.49, 40, \"An effective treatment for cold sores that speeds healing and reduces discomfort. Easy to apply and fast-acting.\"),\n    (\"Portable First Aid App\", 0.00, 1, \"An app that provides first aid instructions and emergency contacts. A digital companion for health and safety.\"),\n    (\"Emergency Food Rations\", 19.99, 15, \"Calorie-dense emergency food rations for survival situations. Lightweight and long-lasting for easy storage.\"),\n    (\"Travel Medical Kit\", 39.99, 20, \"A travel medical kit with essential supplies for treating common ailments. Perfect for vacations and trips.\")\n]"