"products = [\n    (\"FitTrack Pro\", 129.99, 150, \"The FitTrack Pro offers advanced heart rate monitoring and sleep tracking features. Its sleek design makes it perfect for any fitness enthusiast.\"),\n    (\"PulseBand 2000\", 99.99, 200, \"Stay motivated with the PulseBand 2000, which tracks your steps, calories burned, and active minutes. Its waterproof design allows you to wear it while swimming.\"),\n    (\"HealthMate Tracker\", 89.99, 100, \"The HealthMate Tracker provides real-time health metrics and personalized fitness goals. Its user-friendly app syncs data seamlessly to your smartphone.\"),\n    (\"ActiveLife Watch\", 149.99, 80, \"The ActiveLife Watch is designed for those who love outdoor activities, featuring GPS tracking and weather updates. Its durable design withstands the toughest conditions.\"),\n    (\"SmartFit 360\", 79.99, 120, \"SmartFit 360 is a budget-friendly fitness tracker that monitors your activity levels and sleep patterns. Its simple interface makes it easy to use for everyone.\"),\n    (\"CardioMax Tracker\", 159.99, 70, \"With CardioMax Tracker, you can monitor your heart rate and get insights into your fitness levels. The stylish design ensures you look good while staying fit.\"),\n    (\"StepMaster Band\", 69.99, 90, \"The StepMaster Band tracks your daily steps and syncs with your favorite fitness apps. Its lightweight design ensures comfort throughout the day.\"),\n    (\"Wellness Watcher\", 199.99, 60, \"The Wellness Watcher combines fitness tracking with health monitoring features like blood oxygen levels. Its premium design and display make it a stylish accessory.\"),\n    (\"RunTrack Elite\", 139.99, 110, \"RunTrack Elite is perfect for runners, featuring advanced GPS and pace tracking. Its long battery life ensures it lasts through your longest runs.\"),\n    (\"FitBand X\", 89.99, 140, \"FitBand X tracks your workouts and provides personalized coaching tips. Its sleek design and various color options make it a fashionable choice.\"),\n    (\"HealthSync Pro\", 119.99, 75, \"HealthSync Pro offers comprehensive health tracking features, including stress levels and hydration reminders. Its intuitive app helps you stay on track.\"),\n    (\"SportyFit Tracker\", 109.99, 95, \"SportyFit Tracker is designed for athletes, featuring multiple sports modes and performance metrics. Its rugged build makes it suitable for any sport.\"),\n    (\"Lifestyle Tracker\", 69.99, 130, \"The Lifestyle Tracker monitors your daily activities and helps you set achievable fitness goals. Its stylish design ensures it fits any lifestyle.\"),\n    (\"FitPulse Smartwatch\", 159.99, 85, \"FitPulse Smartwatch combines fitness tracking with smartwatch features like notifications and music control. Its vibrant display makes it easy to use.\"),\n    (\"UltraFit Band\", 79.99, 150, \"UltraFit Band is a lightweight tracker that helps you monitor your fitness journey. Its long battery life ensures you stay connected all day.\"),\n    (\"TrackMyFitness\", 99.99, 100, \"TrackMyFitness provides detailed insights into your health metrics and activity levels. Its user-friendly app makes tracking progress a breeze.\"),\n    (\"VigorFit Watch\", 129.99, 80, \"VigorFit Watch features heart rate monitoring and sleep analysis to help improve your health. Its stylish design suits both workouts and everyday wear.\"),\n    (\"SmartStep Tracker\", 89.99, 120, \"SmartStep Tracker is designed for everyday fitness enthusiasts, offering step counting and calorie tracking. Its comfortable fit makes it ideal for all-day wear.\"),\n    (\"FitBuddy Band\", 69.99, 140, \"FitBuddy Band tracks your daily activities and provides reminders to keep you moving. Its fun colors add a pop of style to your fitness routine.\"),\n    (\"Endurance Tracker\", 139.99, 70, \"Endurance Tracker is perfect for serious athletes, providing advanced metrics and training plans. Its durable design ensures it withstands intense workouts.\"),\n    (\"FitLife Monitor\", 119.99, 90, \"FitLife Monitor offers comprehensive tracking for workouts, heart rate, and sleep patterns. Its sleek interface makes it easy to access your data.\"),\n    (\"RunBuddy Tracker\", 99.99, 110, \"RunBuddy Tracker is designed for runners, featuring real-time pace and distance tracking. Its lightweight design ensures comfort during long runs.\"),\n    (\"Wellness Band\", 79.99, 150, \"The Wellness Band monitors your activity and sleep, helping you achieve a healthier lifestyle. Its stylish design makes it perfect for everyday wear.\"),\n    (\"SmartFit Pro\", 149.99, 75, \"SmartFit Pro combines advanced fitness tracking with smartwatch functionality. Its customizable watch faces allow you to express your style.\"),\n    (\"TrackFit 2.0\", 89.99, 100, \"TrackFit 2.0 offers reliable fitness tracking and a heart rate monitor. Its user-friendly app helps you set and achieve your fitness goals.\"),\n    (\"Fitness Guru Watch\", 159.99, 60, \"Fitness Guru Watch provides comprehensive health metrics and personalized workout suggestions. Its premium look makes it suitable for any occasion.\"),\n    (\"Active Tracker\", 99.99, 120, \"Active Tracker keeps you motivated by tracking your daily activities and providing progress updates. Its sleek design fits seamlessly into your lifestyle.\"),\n    (\"FitWatch Lite\", 69.99, 130, \"FitWatch Lite is an affordable option for fitness tracking, featuring step counting and sleep monitoring. Its lightweight design ensures comfort all day.\"),\n    (\"CoreFit Tracker\", 129.99, 70, \"CoreFit Tracker is designed for serious fitness enthusiasts, offering detailed workout analysis. Its rugged build is perfect for challenging environments.\"),\n    (\"PulseFit Band\", 79.99, 140, \"PulseFit Band tracks your heart rate and activity levels, helping you stay on top of your fitness goals. Its stylish design makes it a great accessory.\"),\n    (\"FitSphere Watch\", 149.99, 85, \"FitSphere Watch combines fitness tracking with smart notifications for a seamless experience. Its vibrant display makes it easy to read in any light.\"),\n    (\"StepSync Tracker\", 99.99, 90, \"StepSync Tracker provides accurate step counting and calorie tracking to help you stay fit. Its comfortable fit makes it ideal for all-day wear.\"),\n    (\"HealthTrack Pro\", 119.99, 75, \"HealthTrack Pro offers in-depth health metrics, including heart rate and sleep quality. Its sleek design is perfect for both workouts and casual wear.\"),\n    (\"FitVision Band\", 89.99, 100, \"FitVision Band monitors your daily activities and provides insights into your fitness levels. Its vibrant colors add a fun touch to your fitness gear.\"),\n    (\"RunSmart Tracker\", 139.99, 70, \"RunSmart Tracker is ideal for runners, featuring GPS tracking and pace analysis. Its lightweight design ensures comfort during your runs.\"),\n    (\"Wellness Watch\", 159.99, 60, \"Wellness Watch combines fitness tracking with health monitoring features. Its elegant design makes it suitable for any occasion.\"),\n    (\"SmartFit Band\", 79.99, 150, \"SmartFit Band is a simple yet effective tracker for monitoring daily activities. Its stylish look ensures it complements any outfit.\"),\n    (\"UltraTrack Pro\", 129.99, 80, \"UltraTrack Pro offers advanced tracking features and a sleek design. Its durable construction makes it perfect for outdoor adventures.\"),\n    (\"Fitness Tracker X\", 99.99, 100, \"Fitness Tracker X tracks your steps, calories, and sleep patterns. Its easy-to-use app helps you stay motivated and reach your fitness goals.\"),\n    (\"ActiveLife Band\", 69.99, 120, \"ActiveLife Band is an affordable fitness tracker that monitors your daily activities. Its lightweight design ensures comfort throughout the day.\"),\n    (\"FitPulse Tracker\", 149.99, 70, \"FitPulse Tracker features heart rate monitoring and personalized fitness coaching. Its stylish design fits seamlessly into your lifestyle.\"),\n    (\"SportSync Watch\", 89.99, 90, \"SportSync Watch is designed for sports enthusiasts, offering multiple activity modes. Its durable design withstands the rigors of any workout.\"),\n    (\"HealthMate Pro\", 119.99, 75, \"HealthMate Pro provides comprehensive health tracking and insights. Its modern design makes it a stylish addition to your fitness gear.\"),\n    (\"FitTrack Lite\", 79.99, 150, \"FitTrack Lite is a budget-friendly option that tracks your daily steps and sleep. Its simple interface is perfect for beginners.\"),\n    (\"Endurance Band\", 99.99, 100, \"Endurance Band is perfect for athletes, featuring advanced metrics and training plans. Its rugged build is designed for intense workouts.\"),\n    (\"Wellness Tracker\", 139.99, 60, \"Wellness Tracker offers detailed insights into your health and fitness journey. Its elegant design makes it suitable for any occasion.\"),\n    (\"FitBuddy Pro\", 89.99, 120, \"FitBuddy Pro tracks your activity levels and provides reminders to keep you moving. Its stylish look adds flair to your fitness routine.\"),\n    (\"CoreFit Watch\", 159.99, 70, \"CoreFit Watch features advanced tracking capabilities and a sleek design. Its durable construction ensures it withstands any workout.\"),\n    (\"TrackFit Band\", 69.99, 140, \"TrackFit Band is a lightweight tracker that helps you monitor your fitness journey. Its long battery life ensures you stay connected all day.\"),\n    (\"SmartHealth Watch\", 129.99, 85, \"SmartHealth Watch combines fitness tracking with smart notifications. Its vibrant display makes it easy to use throughout the day.\"),\n    (\"FitTrack Max\", 99.99, 90, \"FitTrack Max offers reliable fitness tracking and heart rate monitoring. Its user-friendly app helps you set and achieve your fitness goals.\"),\n    (\"ActiveFit Band\", 79.99, 150, \"ActiveFit Band tracks your daily activities and provides insights into your fitness levels. Its stylish design makes it perfect for everyday wear.\"),\n    (\"PulseTrack Elite\", 149.99, 75, \"PulseTrack Elite is designed for serious fitness enthusiasts, offering detailed workout analysis. Its rugged build is perfect for challenging environments.\"),\n    (\"Fitness Buddy Tracker\", 89.99, 100, \"Fitness Buddy Tracker monitors your daily activities and helps you stay motivated. Its comfortable fit makes it ideal for all-day wear.\"),\n    (\"RunTrack Pro\", 139.99, 70, \"RunTrack Pro is perfect for runners, featuring GPS tracking and pace analysis. Its lightweight design ensures comfort during long runs.\"),\n    (\"Wellness Band Pro\", 159.99, 60, \"Wellness Band Pro combines fitness tracking with health monitoring features. Its elegant design makes it suitable for any occasion.\"),\n    (\"SmartFit Lite\", 79.99, 150, \"SmartFit Lite is a simple yet effective tracker for monitoring daily activities. Its stylish look ensures it complements any outfit.\"),\n    (\"UltraFit Tracker\", 129.99, 80, \"UltraFit Tracker offers advanced tracking features and a sleek design. Its durable construction makes it perfect for outdoor adventures.\"),\n    (\"Fitness Tracker Plus\", 99.99, 100, \"Fitness Tracker Plus tracks your steps, calories, and sleep patterns. Its easy-to-use app helps you stay motivated and reach your fitness goals.\"),\n    (\"ActiveLife Pro\", 69.99, 120, \"ActiveLife Pro is an affordable fitness tracker that monitors your daily activities. Its lightweight design ensures comfort throughout the day.\"),\n    (\"FitPulse Elite\", 149.99, 70, \"FitPulse Elite features heart rate monitoring and personalized fitness coaching. Its stylish design fits seamlessly into your lifestyle.\"),\n    (\"SportSync Band\", 89.99, 90, \"SportSync Band is designed for sports enthusiasts, offering multiple activity modes. Its durable design withstands the rigors of any workout.\"),\n    (\"HealthMate Lite\", 119.99, 75, \"HealthMate Lite provides comprehensive health tracking and insights. Its modern design makes it a stylish addition to your fitness gear.\"),\n    (\"FitTrack Mini\", 79.99, 150, \"FitTrack Mini is a compact tracker that monitors your daily steps and sleep. Its simple interface is perfect for beginners.\"),\n    (\"Endurance Watch\", 99.99, 100, \"Endurance Watch is perfect for athletes, featuring advanced metrics and training plans. Its rugged build is designed for intense workouts.\"),\n    (\"Wellness Tracker Pro\", 139.99, 60, \"Wellness Tracker Pro offers detailed insights into your health and fitness journey. Its elegant design makes it suitable for any occasion.\")\n]"