"products = [\n    (\"Dumbbell Set\", 49.99, 30, \"This adjustable dumbbell set allows you to customize your weight for various exercises. Perfect for strength training at home.\"),\n    (\"Yoga Mat\", 29.99, 100, \"A high-quality yoga mat that provides excellent grip and cushioning. Ideal for yoga, Pilates, or any floor workout.\"),\n    (\"Resistance Bands\", 19.99, 75, \"These resistance bands are perfect for strength training and rehabilitation. They come in different resistance levels to suit all fitness levels.\"),\n    (\"Kettlebell\", 39.99, 40, \"A versatile kettlebell that can be used for a variety of exercises. Great for building strength and endurance.\"),\n    (\"Jump Rope\", 14.99, 60, \"A lightweight jump rope that is perfect for cardio workouts. It helps improve coordination and burns calories effectively.\"),\n    (\"Exercise Ball\", 24.99, 50, \"This exercise ball is great for core workouts and improving balance. It can also be used for stretching and rehabilitation.\"),\n    (\"Foam Roller\", 19.99, 45, \"A foam roller designed to relieve muscle tension and improve flexibility. Perfect for pre- and post-workout recovery.\"),\n    (\"Pull-Up Bar\", 34.99, 25, \"This pull-up bar can be easily installed in your doorway. It's perfect for upper body strength training.\"),\n    (\"Ab Roller\", 22.99, 35, \"An ab roller that helps you strengthen your core and improve stability. Compact and easy to use at home.\"),\n    (\"Treadmill\", 599.99, 10, \"A high-quality treadmill with multiple workout programs. Ideal for running and walking indoors, regardless of the weather.\"),\n    (\"Stationary Bike\", 399.99, 15, \"A durable stationary bike that provides an intense cardio workout. Features adjustable resistance levels for all fitness levels.\"),\n    (\"Weight Bench\", 149.99, 20, \"A sturdy weight bench designed for various strength training exercises. Adjustable settings allow for a wide range of workouts.\"),\n    (\"Medicine Ball\", 29.99, 50, \"This medicine ball is perfect for strength training and stability exercises. It comes in various weights to suit your fitness needs.\"),\n    (\"Yoga Block\", 14.99, 80, \"A lightweight yoga block that provides support and stability during your practice. Helps enhance flexibility and alignment.\"),\n    (\"Balance Board\", 39.99, 30, \"This balance board is excellent for improving stability and core strength. Great for a fun and challenging workout.\"),\n    (\"Weighted Vest\", 59.99, 20, \"A comfortable weighted vest that adds resistance to your workouts. Ideal for running, walking, or bodyweight exercises.\"),\n    (\"Power Rack\", 499.99, 5, \"A heavy-duty power rack for serious weightlifting enthusiasts. It provides safety and versatility for various exercises.\"),\n    (\"Skipping Rope\", 12.99, 70, \"A durable skipping rope that is perfect for high-intensity cardio workouts. Lightweight and portable for easy use anywhere.\"),\n    (\"Fitness Tracker\", 99.99, 25, \"A sleek fitness tracker that monitors your activity levels and heart rate. Helps you stay motivated and reach your fitness goals.\"),\n    (\"Sandbag\", 34.99, 40, \"A versatile sandbag that can be used for strength training and conditioning workouts. Adjustable weight for a customizable workout.\"),\n    (\"Pilates Ring\", 19.99, 55, \"This Pilates ring adds resistance to your workouts, enhancing strength and flexibility. Ideal for home fitness routines.\"),\n    (\"Suspension Trainer\", 89.99, 15, \"A suspension trainer that allows you to perform bodyweight exercises anywhere. Great for building strength and stability.\"),\n    (\"Chin-Up Assist Band\", 24.99, 30, \"This chin-up assist band helps you build strength for pull-ups. Perfect for beginners and those looking to improve their upper body strength.\"),\n    (\"Yoga Wheel\", 39.99, 25, \"A yoga wheel that helps deepen stretches and improve flexibility. Ideal for enhancing your yoga practice.\"),\n    (\"Weighted Jump Rope\", 29.99, 40, \"This weighted jump rope adds resistance to your cardio workouts. Perfect for building endurance and strength.\"),\n    (\"Smart Scale\", 79.99, 20, \"A smart scale that tracks your weight, body fat, and muscle mass. Syncs with your smartphone for easy monitoring.\"),\n    (\"Barbell Set\", 199.99, 10, \"A complete barbell set that includes weights and a barbell. Perfect for strength training at home.\"),\n    (\"Core Sliders\", 19.99, 50, \"These core sliders are perfect for enhancing your workout routine. They allow for a wide range of exercises targeting the core.\"),\n    (\"Agility Ladder\", 24.99, 35, \"An agility ladder designed to improve speed and coordination. Great for athletic training and fitness enthusiasts.\"),\n    (\"Compression Socks\", 19.99, 60, \"These compression socks promote circulation and reduce muscle fatigue. Ideal for athletes and those on their feet all day.\"),\n    (\"Exercise Bike Mat\", 29.99, 30, \"A durable exercise bike mat that protects your floors and reduces noise. Essential for any indoor cycling setup.\"),\n    (\"Pull-Up Assist Machine\", 299.99, 8, \"A pull-up assist machine that helps users build strength for pull-ups. Ideal for home gyms and fitness studios.\"),\n    (\"Mini Trampoline\", 69.99, 20, \"A mini trampoline that provides a fun way to get your cardio workout. Great for low-impact exercise at home.\"),\n    (\"Hand Gripper\", 9.99, 100, \"A hand gripper that strengthens your grip and forearm muscles. Compact and easy to use anywhere.\"),\n    (\"Stability Ball Chair\", 89.99, 15, \"A stability ball chair that promotes good posture while sitting. Perfect for home offices or workspaces.\"),\n    (\"Resistance Loop Bands\", 14.99, 70, \"These loop bands are great for resistance training and rehabilitation. Lightweight and portable for easy use.\"),\n    (\"Weighted Hula Hoop\", 39.99, 25, \"A weighted hula hoop that adds fun to your fitness routine. Helps tone your core while improving coordination.\"),\n    (\"Outdoor Fitness Equipment\", 499.99, 5, \"A complete outdoor fitness station designed for various exercises. Perfect for parks or backyard workouts.\"),\n    (\"Smart Jump Rope\", 49.99, 15, \"A smart jump rope that tracks your jumps and calories burned. Perfect for fitness enthusiasts looking to level up their cardio.\"),\n    (\"Yoga Strap\", 12.99, 50, \"A yoga strap that helps deepen stretches and improve flexibility. Ideal for beginners and advanced practitioners alike.\"),\n    (\"Bumper Plates\", 89.99, 20, \"A set of bumper plates designed for weightlifting. Durable and perfect for home or gym use.\"),\n    (\"Sling Trainer\", 69.99, 15, \"A sling trainer that allows for versatile bodyweight training. Great for building strength and endurance.\"),\n    (\"Balance Trainer\", 49.99, 20, \"A balance trainer that enhances stability and coordination. Perfect for a fun and challenging workout.\"),\n    (\"Elliptical Machine\", 499.99, 10, \"A smooth elliptical machine that provides a full-body workout. Ideal for low-impact cardiovascular training.\"),\n    (\"Fitness Dice\", 19.99, 45, \"Fitness dice that add variety to your workouts. Roll the dice for a fun and challenging exercise routine.\"),\n    (\"Weighted Bar\", 39.99, 35, \"A weighted bar that is perfect for strength training and cardio workouts. Great for adding resistance to your routine.\"),\n    (\"Resistance Training Bands\", 29.99, 50, \"These training bands provide resistance for a variety of exercises. Ideal for strength training and rehabilitation.\"),\n    (\"Power Bands\", 24.99, 40, \"Power bands that are perfect for strength training and stretching. Lightweight and portable for easy use.\"),\n    (\"Rowing Machine\", 399.99, 10, \"A high-quality rowing machine that provides a full-body workout. Ideal for building endurance and strength.\"),\n    (\"Fitness Jump Rope\", 14.99, 60, \"A durable fitness jump rope that is perfect for cardio workouts. Lightweight and easy to store.\"),\n    (\"Boxing Gloves\", 39.99, 30, \"High-quality boxing gloves designed for training and sparring. Provides excellent protection and comfort.\"),\n    (\"Speed Ladder\", 19.99, 55, \"A speed ladder that improves agility and coordination. Perfect for athletes and fitness enthusiasts.\"),\n    (\"Calisthenics Equipment\", 79.99, 15, \"A set of calisthenics equipment designed for bodyweight training. Great for building strength and flexibility.\"),\n    (\"Outdoor Resistance Bands\", 29.99, 40, \"These outdoor resistance bands are perfect for strength training anywhere. Lightweight and portable for easy use.\"),\n    (\"Fitness Ball\", 34.99, 25, \"A fitness ball that enhances core workouts and stability exercises. Ideal for home workouts.\"),\n    (\"Weighted Blanket\", 59.99, 20, \"A weighted blanket that promotes relaxation and better sleep. Ideal for recovery after workouts.\"),\n    (\"Jumping Jacks Trainer\", 24.99, 35, \"An innovative trainer designed to enhance your jumping jacks workout. Perfect for cardio and conditioning.\"),\n    (\"Agility Cones\", 19.99, 50, \"Agility cones that are perfect for training drills and exercises. Lightweight and portable for easy setup.\"),\n    (\"Fitness Resistance Tube\", 19.99, 60, \"A resistance tube that enhances your strength training routine. Lightweight and easy to use anywhere.\"),\n    (\"Kettlebell Set\", 89.99, 15, \"A complete kettlebell set that allows for versatile workouts. Great for building strength and endurance.\"),\n    (\"Smart Water Bottle\", 39.99, 20, \"A smart water bottle that tracks your hydration levels. Perfect for fitness enthusiasts looking to stay hydrated.\"),\n    (\"Balance Cushion\", 29.99, 30, \"A balance cushion that enhances stability and core strength. Ideal for home workouts or rehabilitation.\"),\n    (\"Resistance Training Kit\", 49.99, 25, \"A complete resistance training kit that includes bands and accessories. Perfect for at-home workouts.\"),\n    (\"Yoga Towel\", 19.99, 50, \"A quick-drying yoga towel that provides grip and comfort during practice. Ideal for hot yoga and studio classes.\"),\n    (\"Home Gym System\", 699.99, 5, \"A complete home gym system that offers a variety of workout options. Perfect for strength training and cardio.\"),\n    (\"Fitness Planner\", 14.99, 100, \"A fitness planner that helps you track your workouts and goals. Ideal for staying organized and motivated.\"),\n    (\"Stair Climber\", 299.99, 8, \"A stair climber machine that provides an intense cardio workout. Great for building strength and endurance.\"),\n    (\"Boxing Training Pads\", 29.99, 40, \"These training pads are perfect for boxing practice. Durable and designed for optimal performance.\"),\n    (\"Outdoor Yoga Mat\", 34.99, 20, \"A durable outdoor yoga mat designed for all surfaces. Perfect for practicing yoga in nature.\"),\n    (\"Fitness Resistance Chair\", 199.99, 10, \"A resistance chair that provides a unique workout experience. Ideal for strength training and rehabilitation.\"),\n    (\"Adjustable Weight Dumbbells\", 79.99, 15, \"These adjustable dumbbells allow for quick weight changes. Perfect for home strength training.\"),\n    (\"Fitness Boot Camp Kit\", 89.99, 10, \"A complete boot camp kit that includes equipment for various workouts. Perfect for group training sessions.\"),\n    (\"Bodyweight Training Guide\", 19.99, 50, \"A comprehensive guide to bodyweight training exercises. Ideal for beginners and advanced fitness enthusiasts.\"),\n    (\"Portable Gym\", 199.99, 5, \"A portable gym that allows for a full-body workout anywhere. Great for travel and outdoor fitness.\"),\n    (\"Exercise Resistance Bands Set\", 34.99, 30, \"A set of exercise resistance bands that are perfect for strength training. Lightweight and easy to store.\"),\n    (\"Fitness Massage Gun\", 79.99, 20, \"A massage gun designed to relieve muscle soreness and tension. Ideal for post-workout recovery.\"),\n    (\"Outdoor Fitness Station\", 499.99, 5, \"An outdoor fitness station designed for various exercises. Perfect for parks or community fitness areas.\"),\n    (\"Athletic Tape\", 9.99, 100, \"Athletic tape that provides support and stability during workouts. Ideal for injury prevention and recovery.\"),\n    (\"Resistance Band Set\", 39.99, 25, \"A complete resistance band set that includes various resistance levels. Perfect for strength training at home.\"),\n    (\"Stability Ball Chair\", 89.99, 15, \"A stability ball chair that promotes good posture while sitting. Ideal for home offices or workspaces.\"),\n    (\"Smart Fitness Mirror\", 999.99, 2, \"A smart fitness mirror that offers interactive workout classes. Perfect for a high-tech home gym experience.\"),\n    (\"Compact Elliptical\", 299.99, 10, \"A compact elliptical machine that fits in small spaces. Great for low-impact cardiovascular workouts.\")\n]"