"[(\"Sneakers\", 79.99, 150, \"Comfortable and stylish sneakers perfect for daily wear. They feature a breathable mesh upper and cushioned sole for all-day support.\"), \n(\"Leather Boots\", 129.99, 75, \"Classic leather boots that combine durability with timeless style. Ideal for both casual outings and more formal occasions.\"), \n(\"Running Shoes\", 89.99, 100, \"Lightweight running shoes designed for maximum performance. They provide excellent cushioning and support for your feet.\"), \n(\"Flip Flops\", 19.99, 200, \"Casual flip flops perfect for warm weather and beach outings. They are lightweight and easy to slip on and off.\"), \n(\"High-Top Sneakers\", 99.99, 80, \"Trendy high-top sneakers that offer ankle support and a fashionable look. Great for both sports and casual wear.\"), \n(\"Sandals\", 39.99, 120, \"Comfortable sandals with adjustable straps for a perfect fit. Ideal for summer days and outdoor activities.\"), \n(\"Hiking Boots\", 149.99, 50, \"Rugged hiking boots designed for tough terrains. They offer excellent grip and ankle support for outdoor adventures.\"), \n(\"Ballet Flats\", 49.99, 90, \"Elegant ballet flats that are versatile for any occasion. They are lightweight and provide a comfortable fit.\"), \n(\"Work Boots\", 109.99, 60, \"Sturdy work boots built for safety and durability. They feature steel toes and slip-resistant soles for job site protection.\"), \n(\"Waterproof Sneakers\", 89.99, 70, \"Waterproof sneakers designed to keep your feet dry in wet conditions. Perfect for outdoor activities in unpredictable weather.\"), \n(\"Chelsea Boots\", 119.99, 65, \"Chic Chelsea boots that add sophistication to any outfit. They are easy to slip on and off with a sleek silhouette.\"), \n(\"Canvas Shoes\", 29.99, 150, \"Casual canvas shoes that are lightweight and breathable. Great for everyday wear and available in various colors.\"), \n(\"Ankle Boots\", 89.99, 55, \"Stylish ankle boots that can be dressed up or down. They feature a comfortable heel height for all-day wear.\"), \n(\"Sport Sandals\", 49.99, 100, \"Durable sport sandals designed for active lifestyles. They provide excellent traction and support for outdoor adventures.\"), \n(\"Dress Shoes\", 89.99, 40, \"Formal dress shoes that complete any business or formal outfit. They offer a polished look and comfortable fit.\"), \n(\"Platform Sneakers\", 69.99, 85, \"Fashionable platform sneakers that add height and style. They are perfect for those looking to make a statement.\"), \n(\"Clogs\", 39.99, 110, \"Comfortable clogs that are easy to wear and clean. Ideal for casual outings and gardening.\"), \n(\"Winter Boots\", 139.99, 45, \"Insulated winter boots designed to keep your feet warm in cold weather. They feature a waterproof exterior and sturdy soles.\"), \n(\"Moccasins\", 59.99, 75, \"Soft and cozy moccasins perfect for lounging at home. They provide warmth and comfort with a stylish design.\"), \n(\"Skate Shoes\", 79.99, 60, \"Durable skate shoes designed for performance on the board. They offer excellent grip and support for tricks.\"), \n(\"Orthopedic Shoes\", 99.99, 30, \"Comfort-focused orthopedic shoes designed to support foot health. They feature cushioned insoles and arch support.\"), \n(\"Espadrilles\", 49.99, 90, \"Stylish espadrilles perfect for summer outings. They are lightweight and made with breathable materials.\"), \n(\"Combat Boots\", 109.99, 50, \"Rugged combat boots that combine style and functionality. They are perfect for both casual and adventurous looks.\"), \n(\"Brogues\", 89.99, 40, \"Classic brogue shoes that add sophistication to any outfit. They feature intricate detailing and a comfortable fit.\"), \n(\"Slip-On Sneakers\", 59.99, 70, \"Convenient slip-on sneakers that are easy to wear. They provide comfort and style for everyday activities.\"), \n(\"Tennis Shoes\", 79.99, 100, \"Versatile tennis shoes designed for court performance. They offer stability and cushioning for active play.\"), \n(\"Rain Boots\", 49.99, 80, \"Functional rain boots that keep your feet dry in wet conditions. They are stylish and easy to clean.\"), \n(\"Mary Janes\", 39.99, 90, \"Charming Mary Jane shoes that are perfect for dressy occasions. They feature a classic strap design for added style.\"), \n(\"Sock Sneakers\", 69.99, 65, \"Innovative sock sneakers that offer a snug fit and modern look. They are lightweight and breathable for comfort.\"), \n(\"Trail Running Shoes\", 99.99, 50, \"Specialized trail running shoes designed for off-road performance. They provide excellent traction and support.\"), \n(\"Biker Boots\", 129.99, 40, \"Sturdy biker boots that exude a rugged style. They are perfect for motorcycle enthusiasts and casual wear.\"), \n(\"House Slippers\", 29.99, 150, \"Cozy house slippers designed for comfort at home. They feature soft materials and a non-slip sole.\"), \n(\"Slingback Sandals\", 39.99, 100, \"Elegant slingback sandals perfect for summer events. They offer a stylish look with adjustable straps.\"), \n(\"Chukka Boots\", 99.99, 55, \"Classic chukka boots that are versatile for any occasion. They feature a timeless design and comfortable fit.\"), \n(\"Fisherman Sandals\", 49.99, 80, \"Durable fisherman sandals designed for outdoor activities. They provide excellent support and ventilation.\"), \n(\"Knee-High Boots\", 129.99, 45, \"Fashionable knee-high boots that elevate any outfit. They feature a sleek design and comfortable heel.\"), \n(\"T-Strap Sandals\", 39.99, 100, \"Stylish T-strap sandals that are perfect for casual outings. They offer a comfortable fit with a trendy design.\"), \n(\"Wedge Shoes\", 69.99, 70, \"Chic wedge shoes that add height without sacrificing comfort. They are perfect for both casual and dressy occasions.\"), \n(\"Bungee Sneakers\", 59.99, 60, \"Convenient bungee sneakers that are easy to wear. They provide comfort and support for everyday activities.\"), \n(\"Rugged Sandals\", 49.99, 85, \"Sturdy rugged sandals designed for outdoor adventures. They offer excellent grip and support for all terrains.\"), \n(\"Pumps\", 79.99, 50, \"Elegant pumps that are perfect for formal occasions. They feature a stylish design and comfortable heel height.\"), \n(\"Lightweight Trainers\", 89.99, 75, \"Lightweight trainers designed for fitness enthusiasts. They provide excellent support and cushioning for workouts.\"), \n(\"Vintage Sneakers\", 69.99, 80, \"Retro-style vintage sneakers that add a classic touch to your wardrobe. They are comfortable and stylish for everyday wear.\"), \n(\"Saddle Shoes\", 59.99, 40, \"Classic saddle shoes that are perfect for a retro look. They feature a unique design and comfortable fit.\"), \n(\"Platform Sandals\", 49.99, 90, \"Trendy platform sandals that add height and flair to any outfit. They are comfortable and stylish for summer wear.\"), \n(\"Trekking Shoes\", 99.99, 50, \"Robust trekking shoes designed for serious hikers. They provide excellent support and traction on rugged trails.\"), \n(\"Casual Loafers\", 69.99, 75, \"Comfortable casual loafers that are perfect for everyday wear. They offer a sleek design and easy slip-on style.\"), \n(\"Ballet Booties\", 39.99, 100, \"Cute ballet booties that provide comfort and style. They are perfect for casual outings and lounging at home.\"), \n(\"Creepers\", 79.99, 60, \"Edgy creepers that add a unique twist to your footwear collection. They feature a chunky sole and stylish design.\"), \n(\"Satin Slippers\", 29.99, 150, \"Luxurious satin slippers perfect for lounging at home. They offer a soft feel and elegant look.\"), \n(\"Gladiator Sandals\", 59.99, 80, \"Stylish gladiator sandals that are perfect for summer. They feature adjustable straps for a comfortable fit.\"), \n(\"Chic Flats\", 49.99, 90, \"Fashionable chic flats that can be worn for any occasion. They are comfortable and versatile for daily wear.\"), \n(\"Outdoor Shoes\", 89.99, 50, \"Durable outdoor shoes designed for hiking and trekking. They provide excellent support and grip for various terrains.\"), \n(\"Dressy Ankle Boots\", 99.99, 40, \"Stylish dressy ankle boots that elevate your outfit. They feature a sleek design with a comfortable heel.\"), \n(\"Slip-On Loafers\", 59.99, 70, \"Convenient slip-on loafers that are perfect for casual wear. They offer comfort and style in one package.\"), \n(\"Seaside Sandals\", 39.99, 100, \"Casual seaside sandals that are perfect for beach outings. They are lightweight and easy to wear.\"), \n(\"Retro Running Shoes\", 79.99, 60, \"Vintage-inspired running shoes that combine style and performance. They provide excellent cushioning for your runs.\"), \n(\"Faux Fur Slippers\", 29.99, 150, \"Cozy faux fur slippers designed for comfort at home. They offer warmth and a stylish look.\"), \n(\"Platform Sneakers\", 69.99, 80, \"Trendy platform sneakers that add a fashionable touch to any outfit. They are comfortable and versatile for daily wear.\"), \n(\"Classic Oxfords\", 89.99, 40, \"Timeless Oxford shoes that are perfect for formal occasions. They feature a polished look and comfortable fit.\"), \n(\"Slingback Heels\", 79.99, 50, \"Elegant slingback heels that are perfect for dressy events. They offer a stylish design with a comfortable fit.\"), \n(\"Faux Leather Boots\", 99.99, 45, \"Stylish faux leather boots that provide a chic look. They are versatile for both casual and formal wear.\"), \n(\"Casual Sneakers\", 59.99, 70, \"Comfortable casual sneakers that are perfect for everyday activities. They offer a stylish design and great support.\"), \n(\"Winter Slippers\", 39.99, 100, \"Warm winter slippers designed for comfort at home. They feature soft materials and a cozy feel.\"), \n(\"Vintage Loafers\", 69.99, 55, \"Classic vintage loafers that add a retro touch to your wardrobe. They are comfortable and stylish for any occasion.\"), \n(\"Sporty Sandals\", 49.99, 80, \"Functional sporty sandals designed for active lifestyles. They provide excellent support and traction for outdoor activities.\"), \n(\"Chic Heels\", 89.99, 40, \"Fashionable chic heels that elevate your outfit for special occasions. They offer a stylish design and comfortable fit.\"), \n(\"Casual Ankle Boots\", 79.99, 70, \"Trendy casual ankle boots that are perfect for everyday wear. They feature a stylish design and comfortable fit.\"), \n(\"Classic Sneakers\", 59.99, 60, \"Timeless classic sneakers that are perfect for casual outings. They provide comfort and style in one package.\"), \n(\"Outdoor Sandals\", 49.99, 90, \"Durable outdoor sandals designed for summer adventures. They offer excellent grip and support for all terrains.\"), \n(\"Dressy Flats\", 39.99, 100, \"Elegant dressy flats that are perfect for formal occasions. They provide a comfortable fit with a stylish design.\"), \n(\"Hiking Sandals\", 59.99, 80, \"Sturdy hiking sandals designed for outdoor exploration. They offer excellent support and ventilation for your feet.\"), \n(\"Chic Wedges\", 79.99, 50, \"Fashionable chic wedges that add height and style. They are perfect for both casual and dressy occasions.\"), \n(\"Cute Booties\", 69.99, 70, \"Adorable booties that provide comfort and style. They are perfect for casual outings and everyday wear.\"), \n(\"Retro Sneakers\", 59.99, 60, \"Vintage-style sneakers that add a classic touch to your wardrobe. They are comfortable and stylish for everyday wear.\"), \n(\"Casual Clogs\", 39.99, 100, \"Comfortable casual clogs that are easy to wear. They are perfect for lounging at home or casual outings.\"), \n(\"Lightweight Sandals\", 49.99, 90, \"Lightweight sandals designed for summer comfort. They offer a stylish look and easy slip-on design.\"), \n(\"Classic Heels\", 89.99, 40, \"Timeless classic heels that are perfect for formal events. They provide a polished look and comfortable fit.\"), \n(\"Sporty Sneakers\", 69.99, 70, \"Athletic sneakers designed for performance and comfort. They are perfect for workouts and casual wear.\"), \n(\"Elegant Slippers\", 29.99, 150, \"Stylish slippers that offer comfort and elegance at home. They are soft and cozy for lounging.\"), \n(\"Trendy Sandals\", 49.99, 80, \"Fashion-forward sandals that are perfect for summer outings. They feature a stylish design and comfortable fit.\"), \n(\"Chic Combat Boots\", 109.99, 50, \"Stylish combat boots that add an edgy touch to your outfit. They are perfect for casual and adventurous looks.\"), \n(\"Casual Sneakers\", 59.99, 60, \"Comfortable casual sneakers that are perfect for everyday activities. They offer a stylish design and great support.\"), \n(\"Summer Sandals\", 39.99, 100, \"Lightweight summer sandals designed for comfort and style. They are easy to wear and perfect for warm weather.\"), \n(\"Classic Lace-Ups\", 89.99, 40, \"Timeless lace-up shoes that are perfect for formal occasions. They provide a polished look and comfortable fit.\"), \n(\"Sport Sandals\", 49.99, 90, \"Durable sport sandals designed for outdoor activities. They provide excellent grip and support for all terrains.\"), \n(\"Chic Booties\", 79.99, 70, \"Fashionable booties that are perfect for casual outings. They offer a stylish design and comfortable fit.\"), \n(\"Retro Running Shoes\", 69.99, 60, \"Vintage-inspired running shoes that combine style and performance. They provide excellent cushioning for your runs.\"), \n(\"House Slippers\", 29.99, 150, \"Cozy house slippers designed for comfort at home. They offer warmth and a stylish look.\"), \n(\"Faux Fur Boots\", 99.99, 45, \"Stylish faux fur boots that provide a chic look. They are versatile for both casual and formal wear.\")]"