"products = [\n    (\"PlayStation 5\", 499.99, 30, \"The PlayStation 5 offers stunning graphics and lightning-fast load times. Experience next-gen gaming with immersive gameplay and an extensive library of titles.\"),\n    (\"Xbox Series X\", 499.99, 25, \"The Xbox Series X delivers unparalleled performance and speed. With a vast game library and backward compatibility, it's perfect for gamers of all kinds.\"),\n    (\"Nintendo Switch\", 299.99, 40, \"The Nintendo Switch is a hybrid console that allows you to play at home or on the go. Enjoy a wide range of exclusive games and innovative features.\"),\n    (\"Xbox Series S\", 299.99, 35, \"The Xbox Series S is a compact and affordable next-gen console. It offers impressive performance and access to the Xbox Game Pass library.\"),\n    (\"PlayStation 4 Pro\", 399.99, 20, \"The PlayStation 4 Pro enhances your gaming experience with 4K gaming and HDR support. Enjoy a vast selection of games with improved graphics.\"),\n    (\"Nintendo Switch Lite\", 199.99, 50, \"The Nintendo Switch Lite is a handheld-only version of the popular console. It's lightweight and perfect for gaming on the go, with a great selection of titles.\"),\n    (\"Sega Genesis Mini\", 79.99, 15, \"The Sega Genesis Mini brings back classic gaming with 42 pre-loaded games. It's a perfect nostalgia trip for fans of retro gaming.\"),\n    (\"Atari Flashback 8 Gold\", 59.99, 10, \"The Atari Flashback 8 Gold features 120 built-in classic games. Relive the golden age of gaming with this plug-and-play console.\"),\n    (\"RetroN 5\", 139.99, 5, \"The RetroN 5 allows you to play games from multiple retro consoles. It supports cartridges from NES, SNES, Genesis, and more, all in one device.\"),\n    (\"Oculus Quest 2\", 299.99, 45, \"The Oculus Quest 2 is a standalone VR headset that offers an immersive gaming experience. With a vast library of VR games, it's perfect for both new and seasoned players.\"),\n    (\"Razer Forge TV\", 99.99, 12, \"The Razer Forge TV is a micro-console designed for gaming and streaming. It supports 4K streaming and has a variety of games available for download.\"),\n    (\"NVIDIA Shield TV\", 199.99, 20, \"The NVIDIA Shield TV is a powerful streaming and gaming device. It offers access to a wide range of games and supports 4K HDR streaming.\"),\n    (\"Game Boy Advance SP\", 79.99, 25, \"The Game Boy Advance SP is a beloved handheld console with a clamshell design. It features a backlit screen and a library of classic games.\"),\n    (\"Sony PlayStation Classic\", 99.99, 18, \"The PlayStation Classic is a mini console that comes pre-loaded with 20 classic games. It's a great way to experience the early days of PlayStation.\"),\n    (\"Neo Geo Mini\", 109.99, 8, \"The Neo Geo Mini is a compact arcade console that includes 40 classic games. It features a built-in screen and joystick for an authentic arcade experience.\"),\n    (\"Microsoft Xbox One X\", 499.99, 15, \"The Xbox One X is the most powerful console in the Xbox family. Enjoy stunning 4K graphics and a vast library of games with this premium console.\"),\n    (\"Nintendo Wii U\", 249.99, 10, \"The Nintendo Wii U features dual-screen gameplay with its unique GamePad. Enjoy a range of exclusive titles and innovative multiplayer experiences.\"),\n    (\"Hyperkin Retron HD\", 59.99, 22, \"The Hyperkin Retron HD allows you to play your favorite NES games in high definition. It's a great way to revisit classic titles with modern technology.\"),\n    (\"PSP Go\", 149.99, 5, \"The PSP Go is a portable gaming device that offers a library of downloadable games. Its compact design makes it easy to take your gaming anywhere.\"),\n    (\"ColecoVision Flashback\", 79.99, 7, \"The ColecoVision Flashback is a plug-and-play console with 60 built-in games. It's perfect for fans of retro gaming and nostalgia.\"),\n    (\"N64 Classic Edition\", 99.99, 10, \"The N64 Classic Edition features a selection of classic Nintendo 64 games. Relive the magic of 3D gaming with this mini console.\"),\n    (\"GameCube\", 149.99, 12, \"The Nintendo GameCube is known for its unique design and a strong library of exclusive titles. It's a great addition for retro gaming enthusiasts.\"),\n    (\"Sony PlayStation VR\", 399.99, 15, \"The PlayStation VR offers an immersive virtual reality experience for PlayStation 4 users. Dive into a new world of gaming with its extensive library.\"),\n    (\"Xbox One S\", 299.99, 20, \"The Xbox One S is a versatile console that supports 4K video streaming. It also features a large game library and backward compatibility with Xbox 360 games.\"),\n    (\"Raspberry Pi 4\", 55.99, 40, \"The Raspberry Pi 4 can be used as a retro gaming console with the right software. It's a fun DIY project for tech enthusiasts and gamers alike.\"),\n    (\"Steam Deck\", 399.99, 30, \"The Steam Deck is a handheld gaming device that lets you play your Steam library on the go. It features a powerful processor and a versatile control scheme.\"),\n    (\"Zelda: Ocarina of Time Collector's Edition\", 49.99, 50, \"This collector's edition includes the classic game along with special extras. A must-have for fans of the Zelda franchise.\"),\n    (\"Game Boy Color\", 59.99, 25, \"The Game Boy Color is a classic handheld console with a vibrant color screen. It's compatible with a vast library of Game Boy and Game Boy Color games.\"),\n    (\"PlayStation Vita\", 199.99, 15, \"The PlayStation Vita is a portable console with a rich library of games. It features a touch screen and dual analog sticks for enhanced gameplay.\"),\n    (\"Xbox 360\", 199.99, 10, \"The Xbox 360 is a classic console that revolutionized online gaming. Enjoy a wide range of games with its extensive library and Xbox Live service.\"),\n    (\"Nintendo 3DS\", 199.99, 20, \"The Nintendo 3DS offers a unique 3D gaming experience without glasses. With a vast library of games, it's perfect for both casual and hardcore gamers.\"),\n    (\"Sega Dreamcast\", 149.99, 8, \"The Sega Dreamcast is a cult classic known for its innovative features and strong library. It's a great console for retro gaming enthusiasts.\"),\n    (\"Xbox One Elite Controller\", 149.99, 25, \"The Xbox One Elite Controller offers customizable controls and premium build quality. Perfect for serious gamers looking for an edge.\"),\n    (\"PlayStation DualSense Controller\", 69.99, 50, \"The DualSense Controller features haptic feedback and adaptive triggers for a more immersive gaming experience. Compatible with PlayStation 5 and 4.\"),\n    (\"Nintendo Classic Mini: NES\", 59.99, 30, \"The NES Classic Mini comes pre-loaded with 30 classic games. It's a great way to experience retro gaming in a compact design.\"),\n    (\"Logitech G923 Racing Wheel\", 399.99, 10, \"The Logitech G923 Racing Wheel offers realistic driving simulation for racing games. It features TrueForce force feedback technology for enhanced immersion.\"),\n    (\"Xbox Adaptive Controller\", 99.99, 15, \"The Xbox Adaptive Controller is designed for gamers with limited mobility. It offers customizable options to create a personalized gaming setup.\"),\n    (\"Nintendo Labo\", 69.99, 20, \"Nintendo Labo combines gaming with creativity by allowing players to build their own cardboard accessories. It's an innovative way to experience gaming.\"),\n    (\"Razer Raiju Tournament Edition\", 149.99, 10, \"The Razer Raiju Tournament Edition is a customizable gaming controller for PlayStation. It features programmable buttons and a comfortable grip.\"),\n    (\"Thrustmaster T300 RS GT\", 499.99, 5, \"The Thrustmaster T300 RS GT is a high-end racing wheel for serious gamers. It offers precise force feedback and a realistic driving experience.\"),\n    (\"Hori Fighting Commander\", 49.99, 30, \"The Hori Fighting Commander is a gamepad designed for fighting games. It features a six-button layout and customizable options for competitive play.\"),\n    (\"Xbox Game Pass Ultimate\", 14.99, 100, \"Xbox Game Pass Ultimate offers access to hundreds of games for a monthly fee. Enjoy gaming on console, PC, and cloud with a single subscription.\"),\n    (\"PlayStation Plus Subscription\", 9.99, 100, \"PlayStation Plus provides online multiplayer access and monthly free games. It's essential for any PlayStation gamer looking to enhance their experience.\"),\n    (\"Nintendo Online Subscription\", 19.99, 100, \"The Nintendo Online Subscription offers online multiplayer and access to classic NES and SNES games. It's a great value for Nintendo fans.\"),\n    (\"SteelSeries Arctis 7\", 149.99, 25, \"The SteelSeries Arctis 7 is a wireless gaming headset with immersive sound. It features a comfortable design and long battery life for extended gaming sessions.\"),\n    (\"HyperX Cloud II\", 99.99, 30, \"The HyperX Cloud II is a popular gaming headset known for its comfort and sound quality. It features virtual 7.1 surround sound for an immersive experience.\"),\n    (\"Logitech G Pro X\", 129.99, 20, \"The Logitech G Pro X is a professional-grade gaming headset with customizable sound profiles. It's designed for competitive gamers looking for an edge.\"),\n    (\"Corsair Virtuoso RGB Wireless\", 199.99, 15, \"The Corsair Virtuoso RGB Wireless headset offers high-fidelity audio and customizable RGB lighting. Perfect for gamers who value both style and performance.\"),\n    (\"Razer BlackShark V2\", 99.99, 30, \"The Razer BlackShark V2 is a versatile gaming headset with excellent sound quality. It features a comfortable design and advanced microphone technology.\"),\n    (\"Astro A50 Wireless\", 299.99, 10, \"The Astro A50 Wireless headset offers premium sound quality and a comfortable fit. It's designed for gamers who demand the best audio experience.\"),\n    (\"Turtle Beach Stealth 700\", 149.99, 25, \"The Turtle Beach Stealth 700 is a wireless gaming headset with immersive sound. It features a comfortable design and long battery life for extended play.\"),\n    (\"Sony Pulse 3D Wireless Headset\", 99.99, 50, \"The Sony Pulse 3D Wireless Headset is designed for PlayStation 5, offering 3D audio. Enjoy an immersive gaming experience with its sleek design.\"),\n    (\"Razer Naga X\", 79.99, 40, \"The Razer Naga X is a lightweight gaming mouse designed for MMO gamers. It features customizable buttons and an ergonomic design for comfort.\"),\n    (\"Logitech G502 HERO\", 79.99, 30, \"The Logitech G502 HERO is a versatile gaming mouse with customizable RGB lighting. It offers precise tracking and a comfortable grip for long gaming sessions.\"),\n    (\"Corsair Scimitar RGB Elite\", 89.99, 20, \"The Corsair Scimitar RGB Elite is an MMO gaming mouse with programmable buttons. It's designed for gamers who need quick access to multiple commands.\"),\n    (\"SteelSeries Rival 600\", 99.99, 15, \"The SteelSeries Rival 600 is a high-performance gaming mouse with dual sensor technology. It offers customizable weight and RGB lighting for a personalized experience.\"),\n    (\"Glorious Model O\", 49.99, 50, \"The Glorious Model O is an ultra-lightweight gaming mouse designed for speed and precision. Its honeycomb design ensures comfort during long gaming sessions.\"),\n    (\"Razer Huntsman Elite\", 199.99, 10, \"The Razer Huntsman Elite is a premium gaming keyboard with customizable RGB lighting. It features Razer's innovative optical switches for fast response times.\"),\n    (\"Corsair K95 RGB Platinum\", 199.99, 5, \"The Corsair K95 RGB Platinum is a high-end mechanical gaming keyboard. It offers customizable macros and dynamic RGB lighting for a personalized setup.\"),\n    (\"Logitech G Pro Mechanical Keyboard\", 129.99, 15, \"The Logitech G Pro is a compact mechanical keyboard designed for esports. It features customizable RGB lighting and durable switches for long-lasting performance.\"),\n    (\"HyperX Alloy FPS Pro\", 99.99, 20, \"The HyperX Alloy FPS Pro is a tenkeyless mechanical gaming keyboard. Its compact design makes it perfect for gamers on the go.\"),\n    (\"Razer BlackWidow V3\", 139.99, 25, \"The Razer BlackWidow V3 is a mechanical gaming keyboard with customizable RGB lighting. It features Razer's Green switches for tactile feedback.\"),\n    (\"Corsair K55 RGB Gaming Keyboard\", 59.99, 40, \"The Corsair K55 RGB is an affordable gaming keyboard with customizable lighting. It features quiet keys and programmable macros for enhanced gameplay.\"),\n    (\"Logitech G915 TKL\", 249.99, 10, \"The Logitech G915 TKL is a high-performance wireless mechanical keyboard. It offers low-profile keys and customizable RGB lighting for a sleek look.\"),\n    (\"Razer Cynosa V2\", 69.99, 30, \"The Razer Cynosa V2 is a budget-friendly gaming keyboard with customizable RGB lighting. It's designed for gamers who want quality without breaking the bank.\"),\n    (\"Corsair K70 RGB MK.2\", 159.99, 15, \"The Corsair K70 RGB MK.2 is a premium mechanical gaming keyboard with customizable RGB lighting. It features a durable design and responsive keys for competitive play.\"),\n    (\"SteelSeries Apex Pro\", 199.99, 5, \"The SteelSeries Apex Pro is a customizable mechanical keyboard with adjustable actuation points. It's perfect for gamers who want to tailor their experience.\"),\n    (\"ASUS ROG Strix Scope\", 129.99, 10, \"The ASUS ROG Strix Scope is a mechanical gaming keyboard designed for FPS gamers. It features customizable lighting and durable construction for long-lasting use.\")\n]"