"products = [\n    (\"Smart Home Security System\", 299.99, 30, \"This comprehensive security system includes cameras, motion detectors, and a smart hub. Control everything from your smartphone for peace of mind.\"),\n    (\"Wireless Security Camera\", 129.99, 75, \"A high-definition wireless security camera that offers night vision and motion alerts. Keep an eye on your home from anywhere with the mobile app.\"),\n    (\"Smart Doorbell Camera\", 199.99, 50, \"This smart doorbell features a built-in camera and two-way audio. See and speak to visitors at your door from your smartphone.\"),\n    (\"Home Security Alarm System\", 249.99, 40, \"An easy-to-install alarm system with door/window sensors and a loud siren. Protect your home with real-time alerts sent to your phone.\"),\n    (\"Indoor Security Camera\", 89.99, 100, \"A compact indoor camera with 1080p HD video and motion detection. Perfect for monitoring pets and ensuring the safety of your home.\"),\n    (\"Outdoor Security Floodlight Camera\", 159.99, 25, \"This floodlight camera combines bright lighting with HD video surveillance. Deter intruders while keeping your property well-lit.\"),\n    (\"Smart Lock\", 199.99, 60, \"A keyless smart lock that allows you to control access to your home via smartphone. Grant temporary access to guests and monitor entry activity.\"),\n    (\"Motion Sensor Light\", 49.99, 80, \"An energy-efficient motion sensor light that activates when it detects movement. Ideal for enhancing security around your home.\"),\n    (\"Home Security Monitoring Service\", 19.99, 120, \"A monthly subscription service providing 24/7 monitoring of your home security system. Get instant alerts and peace of mind.\"),\n    (\"Panic Button System\", 89.99, 45, \"A simple panic button that connects to your security system for emergencies. Press it to alert authorities immediately.\"),\n    (\"Smart Security Hub\", 129.99, 55, \"This hub connects all your smart security devices into one easy-to-use platform. Control everything from your smartphone or tablet.\"),\n    (\"Surveillance DVR System\", 249.99, 25, \"A digital video recorder that stores footage from your security cameras. Review past events and enhance your home security.\"),\n    (\"Window Security Film\", 39.99, 150, \"A protective film that strengthens windows against break-ins. Easy to apply and helps keep your home safe.\"),\n    (\"Wireless Motion Detector\", 69.99, 70, \"A wireless motion detector that alerts you to movement in your home. Perfect for securing entry points and monitoring activity.\"),\n    (\"Home Security Yard Sign\", 19.99, 200, \"A visible yard sign that warns potential intruders of your security system. A simple yet effective deterrent.\"),\n    (\"Smart Garage Door Opener\", 129.99, 40, \"Control your garage door remotely with this smart opener. Provides alerts when the door is opened or closed.\"),\n    (\"Security Camera with Cloud Storage\", 159.99, 35, \"This security camera offers cloud storage for recorded footage. Access your videos from anywhere at any time.\"),\n    (\"Glass Break Sensor\", 59.99, 90, \"A sensor that detects the sound of breaking glass, alerting you to potential intrusions. Enhance your home security with this essential device.\"),\n    (\"Home Security System Starter Kit\", 349.99, 20, \"A complete starter kit that includes a hub, sensors, and a camera. Get everything you need to secure your home in one package.\"),\n    (\"Smart Smoke Detector\", 79.99, 65, \"This smoke detector alerts you to smoke and carbon monoxide via your smartphone. Stay safe and informed, even when you're away.\"),\n    (\"Pet-Friendly Motion Sensor\", 49.99, 100, \"A motion sensor designed to ignore pets while detecting human movement. Ideal for homes with furry friends.\"),\n    (\"Video Doorbell with Night Vision\", 229.99, 30, \"This video doorbell provides high-quality video and night vision capabilities. Monitor your front door with ease, day or night.\"),\n    (\"Home Security System with Facial Recognition\", 399.99, 15, \"An advanced security system that uses facial recognition technology to identify visitors. Enhance your home security with cutting-edge features.\"),\n    (\"Smart Home Security App\", 0.00, 500, \"Download our free app to monitor your home security system from anywhere. Receive alerts and control your devices with ease.\"),\n    (\"Keypad Door Lock\", 99.99, 80, \"A secure keypad door lock that eliminates the need for physical keys. Easily manage access codes for family and friends.\"),\n    (\"Battery-Powered Security Camera\", 119.99, 45, \"A battery-operated security camera that can be placed anywhere without the need for wiring. Ideal for outdoor monitoring.\"),\n    (\"Smart Gateway for Security Devices\", 89.99, 60, \"This gateway connects various smart security devices for seamless operation. Control your home security from one central hub.\"),\n    (\"Home Security System with Smart Sensors\", 299.99, 25, \"A security system equipped with smart sensors that detect unusual activity. Receive alerts directly to your smartphone.\"),\n    (\"Portable Security Alarm\", 39.99, 100, \"A compact, portable alarm that can be used anywhere. Perfect for travel or temporary security needs.\"),\n    (\"Floodlight Security Camera\", 179.99, 30, \"This floodlight camera combines bright lighting with surveillance capabilities. Deter intruders while keeping your property well-lit.\"),\n    (\"Smart Home Security Starter Kit\", 249.99, 20, \"Everything you need to start your smart home security journey, including cameras and sensors. Easy to install and manage.\"),\n    (\"Wireless Security System\", 199.99, 50, \"A complete wireless security system that is easy to install. Monitor your home from anywhere with mobile connectivity.\"),\n    (\"Smart Door Lock with App Control\", 149.99, 40, \"This smart door lock allows you to control access via a mobile app. Grant access to guests and monitor entry activity.\"),\n    (\"Home Security Camera with Two-Way Audio\", 109.99, 55, \"A security camera that allows for two-way communication. See and speak to anyone in your home from your smartphone.\"),\n    (\"Outdoor Motion Sensor Light\", 59.99, 70, \"An outdoor light that activates with motion detection. Perfect for enhancing security around your property.\"),\n    (\"Smart Home Security System with App\", 299.99, 30, \"This system allows you to control and monitor your home security through a dedicated app. Stay connected to your home, no matter where you are.\"),\n    (\"Home Security System with Remote Access\", 249.99, 25, \"A robust security system that offers remote access to your home. Monitor live feeds and receive alerts on your devices.\"),\n    (\"Security Window Sensors\", 49.99, 90, \"These sensors alert you when windows are opened or broken. Enhance your home's security with this easy-to-install solution.\"),\n    (\"Smart Security Camera with AI Detection\", 199.99, 35, \"An AI-powered security camera that distinguishes between people and pets. Reduce false alarms while ensuring your home is protected.\"),\n    (\"Home Security System with 24/7 Monitoring\", 349.99, 20, \"Enjoy peace of mind with a security system backed by professional 24/7 monitoring. Receive immediate alerts and assistance during emergencies.\"),\n    (\"Wireless Keypad Alarm\", 79.99, 80, \"A wireless alarm system that features a keypad for easy access. Perfect for families looking for a simple security solution.\"),\n    (\"Smart Light Bulbs with Security Features\", 49.99, 100, \"These smart bulbs can be programmed to mimic your presence at home. Enhance security by creating the illusion that someone is always home.\"),\n    (\"Home Security System with Smart Integration\", 299.99, 25, \"This system integrates with other smart home devices for seamless control. Monitor and manage your security from anywhere.\"),\n    (\"Emergency Alert System\", 99.99, 50, \"A compact emergency alert system that connects to your smartphone. Stay safe and alert authorities in case of emergencies.\"),\n    (\"Smart Home Security Sensors\", 129.99, 40, \"These sensors detect movement and environmental changes, sending alerts to your phone. Keep your home safe with smart technology.\"),\n    (\"Wi-Fi Security Camera\", 129.99, 60, \"A Wi-Fi-enabled security camera that streams live video to your smartphone. Perfect for monitoring your home while you're away.\"),\n    (\"Home Security System with Video Monitoring\", 399.99, 15, \"A comprehensive security system featuring video monitoring capabilities. Stay connected to your home with real-time alerts and recordings.\"),\n    (\"Smart Security Alarm with App Control\", 199.99, 30, \"This alarm system can be controlled via a dedicated app on your smartphone. Get alerts and manage your security from anywhere.\"),\n    (\"Smart Door Sensor\", 39.99, 90, \"A smart sensor that alerts you when doors are opened or closed. Enhance your home security effortlessly.\"),\n    (\"Home Security System with Remote Monitoring\", 349.99, 20, \"A robust system that allows for remote monitoring via your smartphone. Stay informed about your home's safety, no matter where you are.\"),\n    (\"Smart Wireless Security Camera\", 159.99, 35, \"A wireless security camera that provides high-definition video and night vision. Monitor your home from anywhere with the mobile app.\"),\n    (\"Home Security System with Smart Alerts\", 249.99, 25, \"This system sends smart alerts directly to your phone when unusual activity is detected. Stay connected to your home at all times.\"),\n    (\"Smart Garage Security System\", 199.99, 40, \"Protect your garage with a smart security system that includes cameras and sensors. Monitor access and receive alerts instantly.\"),\n    (\"Wireless Security System with App Control\", 199.99, 50, \"A wireless security system that can be controlled via a mobile app. Keep your home secure with real-time alerts.\"),\n    (\"Home Security System with Environmental Monitoring\", 299.99, 30, \"This system monitors for smoke, carbon monoxide, and intrusions. Stay safe with comprehensive environmental monitoring.\"),\n    (\"Smart Outdoor Security Camera\", 179.99, 25, \"An outdoor camera that offers high-definition video and weather resistance. Perfect for monitoring the exterior of your home.\"),\n    (\"Home Security System with Remote Access\", 249.99, 20, \"A security system that allows remote access to live feeds and alerts. Stay connected to your home from anywhere.\"),\n    (\"Smart Window Sensors\", 49.99, 90, \"These sensors alert you when windows are opened or broken. Enhance your home's security with this easy-to-install solution.\"),\n    (\"Home Security Camera with Cloud Storage\", 159.99, 35, \"This security camera offers cloud storage for recorded footage. Access your videos from anywhere at any time.\"),\n    (\"Smart Motion-Activated Camera\", 159.99, 30, \"A smart camera that activates when it detects motion, sending alerts to your phone. Perfect for monitoring your home while you're away.\"),\n    (\"Home Security System with Facial Recognition\", 399.99, 15, \"An advanced security system that uses facial recognition technology to identify visitors. Enhance your home security with cutting-edge features.\"),\n    (\"Smart Home Security Hub\", 129.99, 55, \"This hub connects all your smart security devices into one easy-to-use platform. Control everything from your smartphone or tablet.\"),\n    (\"Home Security System with Smart Sensors\", 299.99, 25, \"A security system equipped with smart sensors that detect unusual activity. Receive alerts directly to your smartphone.\"),\n    (\"Smart Smoke Detector with App Notifications\", 79.99, 65, \"This smoke detector alerts you to smoke and carbon monoxide via your smartphone. Stay safe and informed, even when you're away.\"),\n    (\"Emergency Panic Button\", 39.99, 100, \"A panic button that connects to your security system for emergencies. Press it to alert authorities immediately.\"),\n    (\"Home Security System with Smart Integration\", 299.99, 25, \"This system integrates with other smart home devices for seamless control. Monitor and manage your security from anywhere.\"),\n    (\"Wireless Security System with Remote Access\", 199.99, 50, \"A wireless security system that provides remote access to your home. Monitor your property from anywhere in the world.\"),\n    (\"Smart Home Security Sensors\", 129.99, 40, \"These sensors detect movement and environmental changes, sending alerts to your phone. Keep your home safe with smart technology.\"),\n    (\"Smart Door Sensor with App Control\", 39.99, 90, \"A smart door sensor that alerts you when doors are opened or closed. Enhance your home security effortlessly.\"),\n    (\"Home Security System with 24/7 Monitoring\", 349.99, 20, \"Enjoy peace of mind with a security system backed by professional 24/7 monitoring. Receive immediate alerts and assistance during emergencies.\"),\n    (\"Wi-Fi Security Camera with Night Vision\", 129.99, 60, \"A Wi-Fi-enabled security camera that streams live video to your smartphone. Perfect for monitoring your home while you're away.\"),\n    (\"Smart Garage Door Opener with App Control\", 129.99, 40, \"Control your garage door remotely with this smart opener. Provides alerts when the door is opened or closed.\"),\n    (\"Home Security System with Smart Alerts\", 249.99, 25, \"This system sends smart alerts directly to your phone when unusual activity is detected. Stay connected to your home at all times.\"),\n    (\"Smart Floodlight with Security Camera\", 179.99, 30, \"A floodlight that integrates a security camera for enhanced monitoring. Deter intruders while keeping your property well-lit.\"),\n    (\"Smart Home Security System with Facial Recognition\", 399.99, 15, \"An advanced security system that uses facial recognition technology to identify visitors. Enhance your home security with cutting-edge features.\"),\n    (\"Smart Light Bulbs with Security Features\", 49.99, 100, \"These smart bulbs can be programmed to mimic your presence at home. Enhance security by creating the illusion that someone is always home.\"),\n    (\"Home Security System with Remote Monitoring\", 349.99, 20, \"A robust system that allows for remote monitoring via your smartphone. Stay informed about your home's safety, no matter where you are.\"),\n    (\"Smart Wireless Security Camera with Night Vision\", 159.99, 35, \"A wireless security camera that provides high-definition video and night vision. Monitor your home from anywhere with the mobile app.\"),\n    (\"Home Security System with Smart Integration\", 299.99, 25, \"This system integrates with other smart home devices for seamless control. Monitor and manage your security from anywhere.\"),\n    (\"Emergency Alert System with Mobile Notifications\", 99.99, 50, \"A compact emergency alert system that connects to your smartphone. Stay safe and alert authorities in case of emergencies.\"),\n    (\"Smart Wireless Doorbell Camera\", 199.99, 30, \"This wireless doorbell camera features HD video and two-way audio. Monitor your front door with ease, day or night.\"),\n    (\"Home Security System with Remote Access\", 249.99, 20, \"A security system that allows remote access to live feeds and alerts. Stay connected to your home from anywhere.\"),\n    (\"Smart Garage Security System with Alerts\", 199.99, 40, \"Protect your garage with a smart security system that includes cameras and sensors. Monitor access and receive alerts instantly.\"),\n    (\"Wireless Security System with App Control\", 199.99, 50, \"A wireless security system that can be controlled via a mobile app. Keep your home secure with real-time alerts.\")\n]"