"products = [\n    (\"Acer Aspire 5\", 549.99, 30, \"The Acer Aspire 5 blends performance and portability with its lightweight design. It features a Full HD display and a powerful Intel processor, making it ideal for everyday tasks.\"),\n    (\"Dell XPS 13\", 999.99, 25, \"The Dell XPS 13 is known for its stunning InfinityEdge display and premium build quality. With its powerful internals, it's perfect for professionals and creatives alike.\"),\n    (\"HP Pavilion 15\", 699.99, 40, \"The HP Pavilion 15 offers a great balance of performance and affordability. Its sleek design and robust features make it suitable for both work and leisure.\"),\n    (\"Lenovo ThinkPad X1 Carbon\", 1399.99, 15, \"The ThinkPad X1 Carbon is a premium business laptop known for its durability and exceptional keyboard. It's lightweight and offers impressive battery life, perfect for on-the-go professionals.\"),\n    (\"ASUS ZenBook 14\", 899.99, 20, \"The ASUS ZenBook 14 combines elegance with performance in a compact form factor. With its stunning display and powerful components, it’s ideal for both work and entertainment.\"),\n    (\"Microsoft Surface Laptop 4\", 1299.99, 10, \"The Surface Laptop 4 features a beautiful touchscreen display and a sleek design. It offers excellent performance with a long-lasting battery, making it perfect for students and professionals.\"),\n    (\"Razer Blade 15\", 1999.99, 5, \"The Razer Blade 15 is a high-end gaming laptop with a sleek design and powerful graphics. It's built for gamers who demand the best performance and aesthetics.\"),\n    (\"LG Gram 17\", 1699.99, 8, \"The LG Gram 17 is incredibly lightweight for a 17-inch laptop, making it perfect for portability. It boasts impressive battery life and a large display for productivity.\"),\n    (\"Apple MacBook Air M1\", 999.99, 12, \"The MacBook Air with M1 chip offers exceptional performance and battery life in a lightweight design. It's perfect for users who prefer macOS and need a reliable laptop.\"),\n    (\"Acer Predator Helios 300\", 1299.99, 7, \"The Predator Helios 300 is designed for gamers, featuring a high refresh rate display and powerful graphics. It balances performance and affordability for an immersive gaming experience.\"),\n    (\"HP Omen 15\", 1499.99, 6, \"The HP Omen 15 is a powerful gaming laptop with customizable RGB lighting and a high-performance GPU. It’s designed for serious gamers who demand top-notch performance.\"),\n    (\"Dell Inspiron 15\", 599.99, 35, \"The Dell Inspiron 15 is a versatile laptop that caters to everyday computing needs. It features a spacious display and a comfortable keyboard for productivity.\"),\n    (\"Lenovo IdeaPad 3\", 499.99, 50, \"The Lenovo IdeaPad 3 is an affordable laptop that offers solid performance for basic tasks. Its lightweight design makes it easy to carry around.\"),\n    (\"MSI GS66 Stealth\", 2499.99, 3, \"The MSI GS66 Stealth is a premium gaming laptop with a sleek design and high-end specs. It features advanced cooling technology for optimal performance during intense gaming sessions.\"),\n    (\"Samsung Galaxy Book Pro\", 1099.99, 9, \"The Galaxy Book Pro offers a stunning AMOLED display and ultra-slim design. It’s perfect for users who need a stylish and portable device for work and play.\"),\n    (\"ASUS ROG Zephyrus G14\", 1499.99, 4, \"The ROG Zephyrus G14 is a compact gaming laptop that delivers powerful performance in a portable package. It features a unique AniMe Matrix display for a personalized touch.\"),\n    (\"Toshiba Dynabook Tecra\", 899.99, 11, \"The Dynabook Tecra series is designed for business professionals, offering durability and security features. It’s equipped with a reliable performance for everyday tasks.\"),\n    (\"Apple MacBook Pro 13\", 1299.99, 14, \"The MacBook Pro 13 combines power and portability, featuring the latest Apple silicon. It’s ideal for creative professionals who need a reliable and efficient laptop.\"),\n    (\"Acer Swift 3\", 699.99, 22, \"The Acer Swift 3 is a lightweight laptop that offers impressive performance and battery life. Its sleek design and solid build make it perfect for students and professionals.\"),\n    (\"Dell Latitude 7420\", 1399.99, 6, \"The Dell Latitude 7420 is a business-class laptop with robust security features and excellent performance. It’s designed for professionals who need reliability and portability.\"),\n    (\"HP Elite Dragonfly\", 1599.99, 5, \"The HP Elite Dragonfly is a premium convertible laptop that combines style with functionality. It features a lightweight design and long battery life, perfect for business users.\"),\n    (\"Lenovo Yoga 7i\", 899.99, 10, \"The Lenovo Yoga 7i is a versatile 2-in-1 laptop with a stunning touchscreen display. Its flexible design allows for seamless transitions between laptop and tablet modes.\"),\n    (\"Microsoft Surface Book 3\", 1599.99, 4, \"The Surface Book 3 is a powerful detachable laptop with a stunning display and versatile design. It’s perfect for creative professionals who need a flexible device.\"),\n    (\"Razer Blade Stealth 13\", 1799.99, 3, \"The Razer Blade Stealth 13 is one of the most powerful ultrabooks on the market. It combines portability with high-performance gaming capabilities.\"),\n    (\"HP Spectre x360\", 1399.99, 8, \"The HP Spectre x360 is a premium convertible laptop with a sleek design and powerful performance. Its long battery life and vibrant display make it perfect for creatives.\"),\n    (\"ASUS VivoBook 15\", 599.99, 27, \"The ASUS VivoBook 15 offers a stylish design and solid performance at an affordable price. It’s equipped with a full-sized keyboard and a vibrant display for productivity.\"),\n    (\"Acer Chromebook Spin 713\", 629.99, 15, \"The Acer Chromebook Spin 713 is a versatile 2-in-1 laptop that runs on Chrome OS. Its lightweight design and long battery life make it great for students and casual users.\"),\n    (\"Dell G5 15\", 1199.99, 6, \"The Dell G5 15 is a gaming laptop that offers excellent performance for the price. It features a sleek design and powerful graphics for an immersive gaming experience.\"),\n    (\"Lenovo Legion 5\", 1299.99, 5, \"The Lenovo Legion 5 is built for gamers, featuring a high refresh rate display and customizable RGB lighting. It balances performance and affordability for gaming enthusiasts.\"),\n    (\"HP Envy 13\", 999.99, 10, \"The HP Envy 13 combines a sleek design with powerful performance. It features a stunning display and long battery life, making it perfect for professionals.\"),\n    (\"Apple MacBook Pro 16\", 2399.99, 2, \"The MacBook Pro 16 offers a powerful performance with its advanced hardware. It's designed for creative professionals who need a high-performance machine for demanding tasks.\"),\n    (\"Acer Aspire 7\", 899.99, 11, \"The Acer Aspire 7 is a budget-friendly gaming laptop that offers solid performance. It features a sleek design and a dedicated graphics card for gaming enthusiasts.\"),\n    (\"Dell Vostro 15\", 699.99, 18, \"The Dell Vostro 15 is a reliable laptop designed for small businesses. It offers solid performance and security features for professionals on the go.\"),\n    (\"Lenovo ThinkBook 14\", 749.99, 14, \"The Lenovo ThinkBook 14 is built for business professionals who need a reliable laptop. It features a sleek design and robust security features for peace of mind.\"),\n    (\"ASUS TUF Gaming A15\", 1299.99, 7, \"The ASUS TUF Gaming A15 is a durable gaming laptop that can handle intense gaming sessions. It features advanced cooling and a high refresh rate display for smooth gameplay.\"),\n    (\"Microsoft Surface Laptop Go\", 699.99, 20, \"The Surface Laptop Go is a lightweight and portable device with a premium feel. It offers solid performance for everyday tasks and is perfect for students.\"),\n    (\"Acer Predator Triton 500\", 1999.99, 3, \"The Predator Triton 500 is a high-performance gaming laptop with a sleek design. It features advanced cooling technology and powerful graphics for an immersive gaming experience.\"),\n    (\"HP ProBook 450\", 849.99, 9, \"The HP ProBook 450 is designed for business users, offering solid performance and security features. Its durable design makes it ideal for professionals on the go.\"),\n    (\"Dell Inspiron 14\", 549.99, 35, \"The Dell Inspiron 14 is a versatile laptop that offers a good balance of performance and affordability. It's perfect for students and everyday users.\"),\n    (\"Lenovo Flex 5\", 649.99, 12, \"The Lenovo Flex 5 is a 2-in-1 laptop that combines performance and flexibility. Its touchscreen display and lightweight design make it perfect for on-the-go productivity.\"),\n    (\"ASUS Chromebook Flip\", 499.99, 25, \"The ASUS Chromebook Flip is a versatile 2-in-1 laptop that runs on Chrome OS. Its lightweight design and long battery life make it great for casual users.\"),\n    (\"Razer Blade 17\", 2499.99, 2, \"The Razer Blade 17 is a powerful gaming laptop that delivers high-end performance in a sleek design. It's perfect for gamers who demand the best.\"),\n    (\"Samsung Notebook 9 Pro\", 1099.99, 6, \"The Samsung Notebook 9 Pro is a premium 2-in-1 laptop with a vibrant display and powerful performance. Its versatile design makes it ideal for both work and play.\"),\n    (\"HP EliteBook 840\", 1399.99, 4, \"The HP EliteBook 840 is a business-class laptop known for its durability and performance. It features advanced security features and a sleek design for professionals.\"),\n    (\"Apple MacBook 12\", 1299.99, 5, \"The MacBook 12 is a lightweight laptop with a stunning Retina display. It offers solid performance for everyday tasks, perfect for users on the go.\"),\n    (\"Acer Swift 5\", 899.99, 10, \"The Acer Swift 5 is a lightweight laptop that offers powerful performance and long battery life. Its sleek design makes it perfect for students and professionals.\"),\n    (\"Dell XPS 15\", 1999.99, 3, \"The Dell XPS 15 combines a stunning display with powerful internals. It's ideal for creatives who need a high-performance machine for editing and design.\"),\n    (\"Lenovo IdeaPad Flex 5\", 749.99, 8, \"The Lenovo IdeaPad Flex 5 is a versatile 2-in-1 laptop with a responsive touchscreen. Its flexible design makes it perfect for productivity and entertainment.\"),\n    (\"MSI GF65 Thin\", 1099.99, 5, \"The MSI GF65 Thin is a gaming laptop that offers a balance of performance and portability. It features a sleek design and powerful graphics for an immersive gaming experience.\"),\n    (\"HP Pavilion x360\", 699.99, 12, \"The HP Pavilion x360 is a flexible 2-in-1 laptop that offers solid performance. Its touchscreen display and convertible design make it great for entertainment and productivity.\"),\n    (\"ASUS ROG Strix Scar 15\", 1999.99, 2, \"The ROG Strix Scar 15 is designed for gamers who demand high performance. It features customizable RGB lighting and a high refresh rate display for smooth gameplay.\"),\n    (\"Apple MacBook Air 13\", 999.99, 9, \"The MacBook Air 13 offers a lightweight design with powerful performance. It's perfect for users who need a reliable laptop for everyday tasks.\"),\n    (\"Acer Aspire 1\", 399.99, 40, \"The Acer Aspire 1 is an affordable laptop that offers basic functionality for everyday tasks. Its compact design makes it easy to carry around.\"),\n    (\"Dell Latitude 5400\", 1099.99, 6, \"The Dell Latitude 5400 is a business-class laptop known for its durability and security features. It’s designed for professionals who need reliable performance.\"),\n    (\"Lenovo ThinkPad L14\", 849.99, 7, \"The Lenovo ThinkPad L14 is built for business users, offering solid performance and robust security features. Its durable design is perfect for professionals on the go.\"),\n    (\"HP 14-dq2020nr\", 499.99, 20, \"The HP 14-dq2020nr is a budget-friendly laptop that provides solid performance for everyday tasks. Its lightweight design makes it perfect for students and casual users.\"),\n    (\"ASUS Chromebook C423\", 349.99, 30, \"The ASUS Chromebook C423 is an affordable and lightweight laptop that runs on Chrome OS. It's perfect for web browsing and basic productivity tasks.\"),\n    (\"Dell G3 15\", 899.99, 15, \"The Dell G3 15 is a gaming laptop that offers solid performance for the price. Its sleek design and powerful graphics make it great for gamers on a budget.\"),\n    (\"Lenovo Yoga 9i\", 1399.99, 5, \"The Lenovo Yoga 9i is a premium convertible laptop with a stunning display and powerful performance. Its flexible design makes it perfect for both work and entertainment.\"),\n    (\"Microsoft Surface Laptop Studio\", 1799.99, 4, \"The Surface Laptop Studio features a unique design that adapts to your needs. It's perfect for creatives who require versatility and high performance.\"),\n    (\"Razer Blade Stealth 15\", 1999.99, 3, \"The Razer Blade Stealth 15 combines portability with high-performance gaming capabilities. It's designed for gamers who want a sleek and powerful device.\"),\n    (\"HP ProBook 445\", 849.99, 10, \"The HP ProBook 445 is designed for business users, offering solid performance and security features. Its durable design is ideal for professionals on the go.\"),\n    (\"ASUS ZenBook Flip 14\", 999.99, 5, \"The ASUS ZenBook Flip 14 is a versatile 2-in-1 laptop that offers a stunning display and powerful performance. Its flexible design is perfect for productivity and entertainment.\"),\n    (\"Lenovo IdeaPad Gaming 3\", 899.99, 8, \"The Lenovo IdeaPad Gaming 3 is a budget-friendly gaming laptop that offers solid performance. Its sleek design and dedicated graphics card make it great for gamers.\"),\n    (\"Acer Swift 7\", 1699.99, 2, \"The Acer Swift 7 is one of the thinnest laptops available, offering powerful performance in a sleek design. It's perfect for users who prioritize portability.\"),\n    (\"Dell XPS 17\", 2299.99, 2, \"The Dell XPS 17 features a stunning 4K display and powerful internals. It's ideal for creatives who need a high-performance laptop for demanding tasks.\"),\n    (\"HP Spectre Folio\", 1399.99, 4, \"The HP Spectre Folio is a unique 2-in-1 laptop crafted from premium materials. Its flexible design and powerful performance make it perfect for professionals.\"),\n    (\"Apple MacBook Pro 14\", 1999.99, 3, \"The MacBook Pro 14 offers powerful performance with its advanced hardware. It's designed for creative professionals who need a high-performance machine for demanding tasks.\"),\n    (\"ASUS VivoBook S15\", 699.99, 15, \"The ASUS VivoBook S15 features a stylish design and solid performance at an affordable price. It's equipped with a full-sized keyboard and a vibrant display for productivity.\"),\n    (\"Lenovo ThinkPad P15\", 1999.99, 2, \"The ThinkPad P15 is a mobile workstation designed for professionals who need high performance. It features robust security and excellent display options.\"),\n    (\"HP Pavilion Gaming 15\", 999.99, 6, \"The HP Pavilion Gaming 15 is a budget-friendly gaming laptop that offers solid performance. It features a sleek design and dedicated graphics for immersive gaming.\"),\n    (\"Dell Latitude 9510\", 1799.99, 3, \"The Dell Latitude 9510 is a premium business laptop known for its durability and performance. It features advanced security features and a sleek design for professionals.\"),\n    (\"Acer Aspire 3\", 499.99, 20, \"The Acer Aspire 3 is an affordable laptop that offers basic functionality for everyday tasks. Its compact design makes it easy to carry around.\"),\n    (\"ASUS ROG Flow X13\", 1499.99, 3, \"The ROG Flow X13 is a versatile gaming laptop with a unique convertible design. It offers powerful performance and a stunning display for gaming and productivity.\"),\n    (\"Microsoft Surface Pro 7\", 749.99, 10, \"The Surface Pro 7 is a versatile 2-in-1 device that offers the power of a laptop in a tablet form factor. It's perfect for users who need flexibility and portability.\"),\n    (\"HP EliteBook x360 1040\", 1799.99, 3, \"The HP EliteBook x360 1040 is a premium convertible laptop designed for business professionals. It features a sleek design and powerful performance for productivity.\"),\n    (\"Lenovo Legion 7i\", 1999.99, 2, \"The Lenovo Legion 7i is a high-performance gaming laptop with a sleek design. It's built for gamers who demand top-notch performance and aesthetics.\"),\n    (\"Acer Chromebook 14\", 499.99, 25, \"The Acer Chromebook 14 is an affordable and lightweight laptop that runs on Chrome OS. It's perfect for web browsing and basic productivity tasks.\"),\n    (\"Dell Inspiron 16\", 649.99, 15, \"The Dell Inspiron 16 is a versatile laptop that offers a good balance of performance and affordability. It's perfect for students and everyday users.\"),\n    (\"HP 15-dy2021nr\", 549.99, 20, \"The HP 15-dy2021nr is a budget-friendly laptop that provides solid performance for everyday tasks. Its lightweight design makes it perfect for students and casual users.\"),\n    (\"ASUS ExpertBook B9\", 1999.99, 2, \"The ASUS ExpertBook B9 is a premium business laptop that offers exceptional performance and portability. It's designed for professionals who need a reliable device for work.\"),\n    (\"Apple MacBook Pro 16 M1\", 2399.99, 2, \"The MacBook Pro 16 M1 offers a powerful performance with its advanced hardware. It's designed for creative professionals who need a high-performance machine for demanding tasks.\")\n]"