"[(\"Liquid Foundation\", 29.99, 150, \"This liquid foundation provides a flawless finish with a lightweight feel. It is perfect for all skin types and offers buildable coverage for a natural look.\"),\n (\"Matte Lipstick\", 19.99, 200, \"A rich, matte lipstick that delivers intense color and long-lasting wear. Its creamy formula glides on smoothly and keeps lips hydrated.\"),\n (\"Eyeshadow Palette\", 39.99, 80, \"This eyeshadow palette features a range of vibrant shades for endless makeup looks. The highly pigmented formula blends effortlessly for a professional finish.\"),\n (\"Mascara\", 24.99, 120, \"Achieve dramatic lashes with this volumizing mascara. Its unique brush lifts and separates each lash for a bold, eye-opening effect.\"),\n (\"Blush\", 22.99, 90, \"This silky blush adds a natural flush to your cheeks. Its buildable formula allows you to customize your look from subtle to vibrant.\"),\n (\"Highlighter\", 27.99, 75, \"Illuminate your complexion with this stunning highlighter. Its lightweight formula creates a radiant glow without looking glittery.\"),\n (\"Brow Gel\", 18.99, 100, \"This brow gel tames and defines your brows for a polished look. Its long-wearing formula ensures your brows stay in place all day.\"),\n (\"Makeup Remover\", 15.99, 150, \"Gently remove makeup with this soothing makeup remover. It effectively dissolves even waterproof products without irritating the skin.\"),\n (\"Setting Spray\", 23.99, 110, \"Lock in your makeup with this refreshing setting spray. It helps to keep your look intact throughout the day while providing a dewy finish.\"),\n (\"Lip Gloss\", 16.99, 130, \"This lip gloss delivers a high-shine finish with a non-sticky feel. It is infused with moisturizing ingredients to keep your lips soft and supple.\"),\n (\"Concealer\", 21.99, 140, \"This creamy concealer effectively hides blemishes and dark circles. Its blendable formula provides full coverage without feeling heavy.\"),\n (\"Face Primer\", 25.99, 85, \"Prepare your skin for makeup with this smoothing face primer. It creates a perfect canvas, minimizing the appearance of pores and fine lines.\"),\n (\"Nail Polish\", 12.99, 200, \"Add a pop of color to your nails with this long-lasting nail polish. Its quick-drying formula ensures a smooth, chip-resistant finish.\"),\n (\"Makeup Brush Set\", 34.99, 60, \"This makeup brush set includes all the essential brushes for flawless application. The soft bristles ensure a comfortable and precise makeup experience.\"),\n (\"Lip Liner\", 17.99, 150, \"Define your lips with this creamy lip liner. Its long-lasting formula prevents feathering and enhances the longevity of your lipstick.\"),\n (\"Eyeshadow Stick\", 14.99, 100, \"This eyeshadow stick offers a quick and easy way to add color to your eyes. Its creamy formula glides on smoothly and blends easily.\"),\n (\"Face Mask\", 9.99, 250, \"Pamper your skin with this rejuvenating face mask. It hydrates and revitalizes, leaving your complexion fresh and glowing.\"),\n (\"Tinted Moisturizer\", 27.99, 70, \"This tinted moisturizer provides light coverage while hydrating your skin. It is perfect for a natural, everyday look.\"),\n (\"Setting Powder\", 20.99, 95, \"Keep your makeup in place with this translucent setting powder. It helps to control shine while giving your skin a soft-focus finish.\"),\n (\"False Eyelashes\", 12.99, 180, \"Enhance your eyes with these stunning false eyelashes. They are lightweight and reusable, perfect for any occasion.\"),\n (\"Color Corrector\", 19.99, 110, \"This color corrector neutralizes redness and dark circles for a flawless complexion. Its creamy texture blends seamlessly into the skin.\"),\n (\"Body Glitter\", 15.99, 130, \"Add some sparkle to your look with this body glitter. Perfect for festivals or nights out, it can be applied anywhere for a fun touch.\"),\n (\"Eye Cream\", 29.99, 80, \"This eye cream helps to reduce the appearance of dark circles and puffiness. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Lip Balm\", 9.99, 200, \"Keep your lips moisturized with this nourishing lip balm. It provides long-lasting hydration and a hint of shine.\"),\n (\"Baking Powder\", 18.99, 90, \"Set your concealer with this lightweight baking powder. It helps to brighten and lock in your makeup for all-day wear.\"),\n (\"Facial Mist\", 14.99, 150, \"Refresh your skin throughout the day with this hydrating facial mist. It provides a boost of moisture and sets makeup for a dewy finish.\"),\n (\"Eyebrow Pencil\", 19.99, 120, \"This eyebrow pencil allows for precise application to fill and define your brows. It features a spoolie brush for blending and a long-lasting formula.\"),\n (\"Liquid Eyeliner\", 16.99, 110, \"Create bold lines with this quick-drying liquid eyeliner. Its precise applicator allows for easy application and a long-lasting finish.\"),\n (\"Cream Blush\", 22.99, 85, \"This cream blush provides a natural flush of color that blends seamlessly into the skin. It is perfect for achieving a dewy, youthful look.\"),\n (\"Nail Care Set\", 29.99, 70, \"This nail care set includes everything you need for healthy nails. It features a cuticle oil, nail strengthener, and buffer for a salon-quality finish.\"),\n (\"Face Oil\", 34.99, 60, \"This nourishing face oil hydrates and rejuvenates your skin. Its lightweight formula absorbs quickly, leaving your complexion radiant.\"),\n (\"Lip Scrub\", 12.99, 150, \"Exfoliate and soften your lips with this delicious lip scrub. It helps to remove dry skin, leaving your lips smooth and ready for color.\"),\n (\"Bronzer\", 24.99, 100, \"This bronzer adds warmth and dimension to your face. Its blendable formula allows for a natural sun-kissed glow.\"),\n (\"Makeup Bag\", 19.99, 130, \"Keep your makeup organized with this stylish makeup bag. It features multiple compartments for easy storage and travel.\"),\n (\"Peel-Off Mask\", 15.99, 90, \"Pamper yourself with this peel-off mask that removes impurities and unclogs pores. It leaves your skin feeling fresh and revitalized.\"),\n (\"Hydrating Primer\", 27.99, 75, \"This hydrating primer preps your skin for makeup application. It smooths out imperfections while providing all-day moisture.\"),\n (\"Colorful Eyeliner\", 16.99, 140, \"Make a statement with this colorful eyeliner. Its vibrant shades allow for creative looks that stand out.\"),\n (\"Body Lotion\", 19.99, 100, \"Moisturize your skin with this luxurious body lotion. It absorbs quickly and leaves your skin feeling soft and nourished.\"),\n (\"Gel Eyeliner\", 18.99, 110, \"This gel eyeliner glides on smoothly for a precise line. Its long-lasting formula ensures your look stays put all day.\"),\n (\"Face Wash\", 14.99, 150, \"Cleanse your skin with this gentle face wash. It removes makeup and impurities without stripping your skin of its natural moisture.\"),\n (\"Hair Removal Cream\", 12.99, 130, \"This hair removal cream provides a quick and easy solution for smooth skin. It is suitable for sensitive areas and leaves skin feeling soft.\"),\n (\"Lip Stain\", 19.99, 140, \"This lip stain delivers a long-lasting pop of color with a lightweight feel. Its formula is perfect for those who want a low-maintenance lip look.\"),\n (\"Setting Powder Spray\", 23.99, 80, \"This setting powder spray provides a matte finish and keeps your makeup in place. It is ideal for oily skin and provides a soft-focus effect.\"),\n (\"Makeup Wipes\", 9.99, 200, \"These makeup wipes make removing makeup a breeze. They are gentle on the skin and effectively remove all traces of makeup.\"),\n (\"Face Serum\", 34.99, 70, \"This rejuvenating face serum targets fine lines and improves skin texture. It is packed with antioxidants for a youthful glow.\"),\n (\"Shimmering Body Oil\", 24.99, 90, \"Add a touch of glam with this shimmering body oil. It hydrates the skin while leaving a beautiful, luminous finish.\"),\n (\"Lip Plumper\", 19.99, 120, \"Achieve fuller lips with this lip plumper. Its unique formula provides a tingling sensation and enhances your natural lip shape.\"),\n (\"Cuticle Remover\", 12.99, 150, \"This cuticle remover softens and dissolves dry cuticles for a neat manicure. It's easy to use and leaves nails looking polished.\"),\n (\"Moisturizing Hand Cream\", 15.99, 130, \"Keep your hands soft and hydrated with this moisturizing hand cream. It absorbs quickly and provides long-lasting moisture.\"),\n (\"Face Peel\", 29.99, 80, \"Revitalize your skin with this exfoliating face peel. It removes dead skin cells and promotes a smoother complexion.\"),\n (\"Brow Highlighter\", 18.99, 100, \"Define your brows with this brow highlighter. It brightens the brow bone and enhances your overall eye makeup.\"),\n (\"Hydrating Lip Mask\", 14.99, 150, \"Pamper your lips with this hydrating lip mask. It provides intense moisture and helps to repair dry, chapped lips.\"),\n (\"Facial Cleanser\", 22.99, 90, \"This facial cleanser gently removes dirt and makeup while maintaining your skin's natural balance. It's perfect for daily use.\"),\n (\"Gel Face Mask\", 15.99, 130, \"This gel face mask provides a cooling effect while deeply hydrating your skin. It leaves your complexion feeling refreshed and revitalized.\"),\n (\"Nail Strengthener\", 18.99, 100, \"Strengthen your nails with this nourishing nail strengthener. It helps to prevent breakage and promotes healthy growth.\"),\n (\"Lip Oil\", 16.99, 140, \"This nourishing lip oil provides hydration and a glossy finish. It's perfect for everyday wear and keeps lips looking plump.\"),\n (\"Colorful Nail Art Kit\", 29.99, 70, \"Create stunning nail art with this colorful nail art kit. It includes everything you need to express your creativity.\"),\n (\"Facial Exfoliator\", 24.99, 90, \"This facial exfoliator gently removes dead skin cells for a brighter complexion. It reveals smoother, healthier-looking skin.\"),\n (\"Body Scrub\", 19.99, 120, \"This body scrub exfoliates and hydrates your skin, leaving it soft and smooth. It's perfect for a spa-like experience at home.\"),\n (\"Blemish Treatment\", 22.99, 80, \"This blemish treatment helps to reduce the appearance of breakouts. Its targeted formula works quickly to clear skin.\"),\n (\"Lip Tint\", 17.99, 150, \"This lip tint provides a sheer wash of color that lasts all day. Its lightweight formula feels comfortable on the lips.\"),\n (\"Makeup Organizer\", 34.99, 60, \"Keep your makeup collection tidy with this stylish makeup organizer. It features compartments for easy access to all your products.\"),\n (\"Hydrating Face Mist\", 14.99, 200, \"Refresh and hydrate your skin with this face mist. It's perfect for setting makeup or giving your skin a boost of moisture.\"),\n (\"Brow Gel with Tint\", 19.99, 110, \"This tinted brow gel adds color and holds your brows in place. Its formula is lightweight and easy to apply.\"),\n (\"Lipstick Set\", 39.99, 50, \"This lipstick set includes a variety of shades for any occasion. Each formula is creamy and long-lasting, ensuring your lips look fabulous.\"),\n (\"Under Eye Patches\", 12.99, 130, \"These under-eye patches help to reduce puffiness and dark circles. They are infused with hydrating ingredients for a refreshing effect.\"),\n (\"Makeup Brush Cleaner\", 16.99, 100, \"Keep your brushes clean and in top condition with this makeup brush cleaner. It effectively removes makeup residue and bacteria.\"),\n (\"Self-Tanning Mousse\", 27.99, 70, \"Achieve a sun-kissed glow with this self-tanning mousse. Its lightweight formula applies evenly for a natural-looking tan.\"),\n (\"Face Contour Kit\", 34.99, 60, \"Sculpt and define your features with this face contour kit. It includes shades for highlighting and contouring for a flawless finish.\"),\n (\"Body Butter\", 19.99, 100, \"This rich body butter deeply nourishes and hydrates the skin. It leaves your skin feeling soft and smelling delightful.\"),\n (\"Nail Art Stickers\", 9.99, 200, \"Add fun designs to your nails with these easy-to-use nail art stickers. They are perfect for customizing your manicure.\"),\n (\"Hydrating Night Cream\", 29.99, 80, \"This hydrating night cream works overnight to nourish and repair your skin. Wake up to a refreshed and radiant complexion.\"),\n (\"Cleansing Oil\", 24.99, 90, \"This cleansing oil effectively removes makeup and impurities without stripping your skin. It's perfect for all skin types.\"),\n (\"Makeup Setting Powder\", 22.99, 75, \"This setting powder helps to control shine and set your makeup for all-day wear. Its lightweight formula provides a smooth finish.\"),\n (\"Face Primer Stick\", 18.99, 100, \"This face primer stick is perfect for on-the-go touch-ups. It smooths the skin and preps it for makeup application.\"),\n (\"Brow Wax\", 16.99, 140, \"This brow wax helps to shape and hold your brows in place. Its long-lasting formula ensures a polished look all day.\"),\n (\"Brightening Serum\", 34.99, 60, \"This brightening serum helps to even skin tone and reduce dark spots. It is packed with antioxidants for a radiant glow.\"),\n (\"Pore Minimizing Primer\", 27.99, 70, \"This pore minimizing primer creates a smooth base for makeup application. It helps to blur imperfections and control shine.\"),\n (\"Shimmer Eyeshadow\", 19.99, 100, \"This shimmer eyeshadow adds a touch of sparkle to your eye look. Its highly pigmented formula applies smoothly and lasts all day.\"),\n (\"Face Mist with SPF\", 14.99, 150, \"Protect your skin from the sun with this face mist that includes SPF. It's perfect for refreshing your makeup and providing sun protection.\"),\n (\"Foot Cream\", 15.99, 130, \"This foot cream hydrates and softens dry, rough feet. It provides a soothing sensation and is perfect for pampering after a long day.\"),\n (\"Nail File\", 7.99, 250, \"This durable nail file shapes and smooths nails with ease. Its compact design makes it perfect for travel.\"),\n (\"Makeup Remover Balm\", 22.99, 90, \"This makeup remover balm melts away makeup effortlessly. Its nourishing formula leaves the skin clean and hydrated.\"),\n (\"Cleansing Wipes\", 10.99, 200, \"These cleansing wipes are perfect for quick makeup removal. They are gentle on the skin and leave it feeling refreshed.\"),\n (\"Facial Toner\", 19.99, 100, \"This facial toner helps to balance your skin's pH and remove leftover impurities. It prepares your skin for the next steps in your skincare routine.\"),\n (\"Moisturizing Foot Mask\", 12.99, 150, \"Pamper your feet with this moisturizing foot mask. It hydrates and rejuvenates tired feet for a spa-like experience at home.\"),\n (\"Lip Balm with SPF\", 9.99, 200, \"Keep your lips protected from the sun with this lip balm that includes SPF. It provides hydration while shielding your lips from UV rays.\"),\n (\"Face Oil with Vitamin C\", 34.99, 70, \"This face oil is infused with Vitamin C for a brightening effect. It hydrates and revitalizes the skin for a healthy glow.\"),\n (\"Hair Styling Gel\", 16.99, 120, \"This hair styling gel provides strong hold and shine without flaking. It's perfect for creating sleek styles that last all day.\"),\n (\"Nail Polish Remover\", 8.99, 200, \"This nail polish remover effectively removes polish without drying out your nails. It's gentle yet powerful for quick and easy use.\"),\n (\"Brightening Eye Cream\", 22.99, 90, \"This brightening eye cream helps to reduce the appearance of dark circles and puffiness. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Hydrating Gel Mask\", 15.99, 130, \"This hydrating gel mask provides intense moisture and revitalizes tired skin. It leaves your complexion looking plump and radiant.\"),\n (\"Body Wash\", 14.99, 150, \"This luxurious body wash cleanses and hydrates your skin. Its rich lather leaves you feeling refreshed and rejuvenated.\"),\n (\"Brow Stencil Kit\", 19.99, 100, \"This brow stencil kit helps you achieve perfectly shaped brows. It's easy to use and perfect for brow beginners.\"),\n (\"Lipstick Organizer\", 29.99, 60, \"Organize your lipstick collection with this stylish lipstick organizer. It holds multiple lipsticks and keeps them easily accessible.\"),\n (\"Exfoliating Foot Scrub\", 12.99, 150, \"This exfoliating foot scrub removes dead skin and leaves your feet feeling soft. It's perfect for pampering yourself after a long day.\"),\n (\"Nail Art Brush Set\", 24.99, 80, \"Create intricate nail designs with this nail art brush set. It includes various brush sizes for detailed artwork.\"),\n (\"Facial Sheet Masks\", 19.99, 100, \"These facial sheet masks provide a boost of hydration and nutrients to your skin. They are perfect for a quick skincare treatment.\"),\n (\"Makeup Removing Cloth\", 15.99, 130, \"This reusable makeup removing cloth effectively removes makeup with just water. It's eco-friendly and gentle on the skin.\"),\n (\"Scented Body Spray\", 12.99, 200, \"This scented body spray leaves you feeling fresh and fragrant throughout the day. It's perfect for a quick spritz on the go.\"),\n (\"Hydrating Gel Cream\", 24.99, 70, \"This hydrating gel cream provides intense moisture without feeling heavy. It's perfect for all skin types and absorbs quickly.\"),\n (\"Eyelash Curler\", 16.99, 120, \"This eyelash curler creates beautifully curled lashes that last all day. Its ergonomic design makes it easy to use.\"),\n (\"Moisturizing Shampoo\", 19.99, 90, \"This moisturizing shampoo cleanses and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Hair Conditioner\", 18.99, 100, \"This hair conditioner nourishes and detangles your hair, leaving it silky smooth. It's perfect for daily use.\"),\n (\"Hair Mask\", 22.99, 80, \"This hair mask provides deep conditioning for dry, damaged hair. It restores moisture and shine for healthier-looking locks.\"),\n (\"Body Oil\", 29.99, 70, \"This luxurious body oil hydrates and nourishes your skin. It leaves a subtle sheen and a delightful scent.\"),\n (\"Facial Cleanser Foam\", 14.99, 150, \"This foaming facial cleanser gently removes impurities and makeup. Its lightweight formula leaves your skin feeling clean and refreshed.\"),\n (\"Nail Growth Serum\", 17.99, 100, \"This nail growth serum promotes healthy nail growth and strengthens nails. It's perfect for those looking to improve their nail health.\"),\n (\"Face Mask Set\", 34.99, 60, \"This face mask set includes a variety of masks for different skin concerns. Pamper yourself with a spa-like experience at home.\"),\n (\"Lip Gloss Set\", 29.99, 70, \"This lip gloss set features a range of shades for any occasion. Each gloss provides a high-shine finish and moisturizing benefits.\"),\n (\"Makeup Sponges\", 12.99, 200, \"These makeup sponges are perfect for blending foundation and concealer. They provide a smooth, airbrushed finish.\"),\n (\"Nail Art Dotting Tools\", 14.99, 130, \"Create stunning nail designs with these dotting tools. They are perfect for adding intricate details to your nail art.\"),\n (\"Hydrating Face Cream\", 22.99, 90, \"This hydrating face cream provides long-lasting moisture and improves skin texture. It's suitable for all skin types.\"),\n (\"Body Shimmer\", 19.99, 100, \"Add a touch of shimmer to your body with this body shimmer lotion. It hydrates the skin while providing a radiant glow.\"),\n (\"Facial Cleansing Brush\", 34.99, 60, \"This facial cleansing brush deeply cleanses and exfoliates your skin. It helps to remove makeup and impurities for a fresh complexion.\"),\n (\"Lash Serum\", 27.99, 70, \"This lash serum promotes the appearance of longer, fuller lashes. Its nourishing formula is perfect for enhancing your natural lashes.\"),\n (\"Moisturizing Conditioner\", 18.99, 100, \"This moisturizing conditioner hydrates and detangles hair, leaving it soft and manageable. It's perfect for daily use.\"),\n (\"Shimmer Body Mist\", 15.99, 130, \"This shimmer body mist adds a touch of sparkle while hydrating your skin. It's perfect for a night out or special occasion.\"),\n (\"Facial Peeling Gel\", 22.99, 80, \"This facial peeling gel gently exfoliates and removes dead skin cells. It leaves your skin feeling smooth and refreshed.\"),\n (\"Nail Art Stamping Kit\", 29.99, 70, \"Create beautiful nail designs with this stamping kit. It includes everything you need for stunning nail art.\"),\n (\"Hydrating Overnight Mask\", 24.99, 60, \"This hydrating overnight mask works while you sleep to nourish and repair your skin. Wake up with a refreshed complexion.\"),\n (\"Moisturizing Lipstick\", 19.99, 100, \"This moisturizing lipstick provides rich color while keeping your lips hydrated. Its creamy formula glides on smoothly.\"),\n (\"Brow Tint\", 16.99, 140, \"This brow tint adds color and definition to your brows. Its long-lasting formula ensures your brows stay perfect all day.\"),\n (\"Face Oil with Rosehip\", 34.99, 70, \"This face oil is infused with rosehip oil for a nourishing effect. It helps to improve skin texture and tone.\"),\n (\"Scented Hand Cream\", 15.99, 130, \"This scented hand cream provides hydration and a delightful fragrance. It's perfect for keeping your hands soft and smooth.\"),\n (\"Nail Art Glitter\", 12.99, 200, \"Add sparkle to your nails with this nail art glitter. It's perfect for creating dazzling designs.\"),\n (\"Hydrating Lip Mask\", 14.99, 150, \"This hydrating lip mask provides intense moisture and helps to repair dry lips. It's perfect for use overnight.\"),\n (\"Facial Brightening Mask\", 19.99, 100, \"This facial brightening mask helps to even skin tone and improve radiance. It's perfect for a quick boost of glow.\"),\n (\"Moisturizing Foot Spray\", 12.99, 150, \"This moisturizing foot spray hydrates and refreshes tired feet. It's perfect for a quick pick-me-up.\"),\n (\"Facial Cleansing Wipes\", 10.99, 200, \"These facial cleansing wipes remove makeup and impurities with ease. They are gentle on the skin and perfect for on-the-go.\"),\n (\"Nail Buffer\", 9.99, 250, \"This nail buffer smooths and shines your nails for a polished look. It's perfect for maintaining healthy nails.\"),\n (\"Body Scrub with Coconut\", 19.99, 100, \"This body scrub features coconut for a tropical scent and gentle exfoliation. It leaves your skin feeling soft and refreshed.\"),\n (\"Moisturizing Body Lotion\", 14.99, 150, \"This moisturizing body lotion hydrates and nourishes your skin. Its lightweight formula absorbs quickly for all-day moisture.\"),\n (\"Facial Moisturizer with SPF\", 22.99, 90, \"This facial moisturizer includes SPF for sun protection while hydrating your skin. It's perfect for daily use.\"),\n (\"Nail Art Pen\", 16.99, 120, \"Create intricate designs with this nail art pen. It's perfect for adding details and patterns to your manicure.\"),\n (\"Hydrating Serum with Hyaluronic Acid\", 24.99, 70, \"This hydrating serum contains hyaluronic acid for intense moisture. It plumps the skin and improves elasticity.\"),\n (\"Cleansing Foam\", 14.99, 150, \"This cleansing foam gently removes makeup and impurities. Its lightweight formula leaves your skin feeling clean and refreshed.\"),\n (\"Moisturizing Face Mask\", 19.99, 100, \"This moisturizing face mask provides deep hydration and nourishment. It's perfect for a spa-like experience at home.\"),\n (\"Nail Art Foils\", 12.99, 200, \"Add a touch of elegance to your nails with these nail art foils. They are easy to apply and create stunning designs.\"),\n (\"Brightening Facial Oil\", 27.99, 70, \"This brightening facial oil helps to improve skin tone and texture. It's perfect for achieving a radiant complexion.\"),\n (\"Hydrating Body Wash\", 14.99, 150, \"This hydrating body wash cleanses and moisturizes your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Moisturizing Hand Sanitizer\", 12.99, 200, \"This moisturizing hand sanitizer cleanses while keeping your hands hydrated. It's perfect for on-the-go use.\"),\n (\"Exfoliating Hand Cream\", 15.99, 130, \"This exfoliating hand cream gently removes dead skin and nourishes your hands. It's perfect for pampering yourself.\"),\n (\"Nail Care Kit\", 29.99, 60, \"This nail care kit includes everything you need for healthy nails. It features a nail file, cuticle oil, and strengthening serum.\"),\n (\"Hydrating Lip Gloss\", 19.99, 100, \"This hydrating lip gloss provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Foot Cream with Peppermint\", 15.99, 130, \"This moisturizing foot cream with peppermint refreshes and hydrates tired feet. It's perfect for a soothing treatment.\"),\n (\"Brightening Eye Gel\", 22.99, 90, \"This brightening eye gel helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Moisturizing Shampoo and Conditioner Set\", 34.99, 60, \"This moisturizing shampoo and conditioner set nourishes and hydrates dry hair. It's perfect for daily use for soft, manageable locks.\"),\n (\"Hydrating Gel Eye Mask\", 14.99, 150, \"This hydrating gel eye mask soothes and refreshes tired eyes. It's perfect for reducing puffiness and dark circles.\"),\n (\"Nail Art Stamping Plates\", 19.99, 100, \"Create stunning nail designs with these stamping plates. They are perfect for achieving intricate patterns with ease.\"),\n (\"Moisturizing Lip Scrub\", 12.99, 200, \"This moisturizing lip scrub gently exfoliates and hydrates your lips. It's perfect for prepping your lips for color.\"),\n (\"Brightening Facial Scrub\", 24.99, 90, \"This brightening facial scrub helps to remove dead skin cells and improve radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Hydrating Face Cream with Aloe Vera\", 22.99, 100, \"This hydrating face cream with aloe vera provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Nail Polish Set\", 29.99, 70, \"This nail polish set features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Moisturizing Body Butter with Shea\", 19.99, 100, \"This moisturizing body butter with shea hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Hydrating Overnight Lip Mask\", 14.99, 150, \"This hydrating overnight lip mask provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Nail Art Brush Set for Beginners\", 24.99, 80, \"This nail art brush set is perfect for beginners looking to create beautiful designs. It includes various brush sizes for different techniques.\"),\n (\"Moisturizing Facial Mist\", 15.99, 130, \"This moisturizing facial mist hydrates and refreshes your skin throughout the day. It's perfect for setting makeup or a quick pick-me-up.\"),\n (\"Brightening Serum with Vitamin C\", 27.99, 70, \"This brightening serum with vitamin C helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut\", 12.99, 200, \"This moisturizing hand cream with coconut hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Polish Remover Pads\", 10.99, 150, \"These nail polish remover pads are convenient and effective for quick polish removal. They are gentle on the nails and easy to use.\"),\n (\"Exfoliating Body Scrub\", 19.99, 100, \"This exfoliating body scrub removes dead skin cells and leaves your skin feeling smooth. It's perfect for a spa-like experience at home.\"),\n (\"Hydrating Body Lotion with Aloe Vera\", 14.99, 150, \"This hydrating body lotion with aloe vera provides moisture and soothes the skin. It's perfect for daily use.\"),\n (\"Nail Art Stencils\", 12.99, 200, \"Create stunning nail designs with these nail art stencils. They are easy to use and perfect for beginners.\"),\n (\"Moisturizing Lip Balm with Coconut\", 9.99, 200, \"This moisturizing lip balm with coconut hydrates and nourishes your lips. It's perfect for keeping your lips soft and smooth.\"),\n (\"Brightening Eye Cream with Caffeine\", 22.99, 90, \"This brightening eye cream with caffeine helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Moisturizing Foot Mask with Lavender\", 15.99, 130, \"This moisturizing foot mask with lavender soothes and hydrates tired feet. It's perfect for a relaxing treatment.\"),\n (\"Nail Strengthening Base Coat\", 16.99, 100, \"This nail strengthening base coat helps to prevent breakage and promotes healthy nail growth. It's perfect for a strong manicure.\"),\n (\"Hydrating Lip Oil with Vitamin E\", 19.99, 100, \"This hydrating lip oil with vitamin E provides nourishment and a glossy finish. It's perfect for everyday wear.\"),\n (\"Exfoliating Facial Scrub with Charcoal\", 24.99, 90, \"This exfoliating facial scrub with charcoal helps to detoxify and purify the skin. It's perfect for achieving a clearer complexion.\"),\n (\"Moisturizing Body Wash with Coconut\", 14.99, 150, \"This moisturizing body wash with coconut cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Nail Art Dotting Tools Set\", 12.99, 200, \"Create intricate designs with this nail art dotting tools set. It's perfect for adding details to your nail art.\"),\n (\"Brightening Facial Mist\", 15.99, 130, \"This brightening facial mist provides a boost of hydration and radiance. It's perfect for refreshing your skin throughout the day.\"),\n (\"Moisturizing Shampoo with Argan Oil\", 19.99, 100, \"This moisturizing shampoo with argan oil nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Hydrating Face Serum with Vitamin E\", 22.99, 90, \"This hydrating face serum with vitamin E provides intense moisture and helps to improve skin texture. It's perfect for all skin types.\"),\n (\"Nail Art Foil Transfer Kit\", 29.99, 70, \"Create stunning nail designs with this foil transfer kit. It's easy to use and perfect for adding a touch of glamour.\"),\n (\"Moisturizing Body Butter with Almond\", 19.99, 100, \"This moisturizing body butter with almond hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Hydrating Gel Face Mask with Aloe Vera\", 15.99, 150, \"This hydrating gel face mask with aloe vera soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Serum with Licorice Extract\", 27.99, 70, \"This brightening serum with licorice extract helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Shea Butter\", 12.99, 200, \"This moisturizing hand cream with shea butter hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Polish Set with Glitter\", 29.99, 70, \"This nail polish set with glitter features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Honey\", 14.99, 150, \"This hydrating lip mask with honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Foot Cream with Tea Tree\", 15.99, 130, \"This moisturizing foot cream with tea tree oil refreshes and hydrates tired feet. It's perfect for a soothing treatment.\"),\n (\"Brightening Eye Gel with Vitamin C\", 22.99, 90, \"This brightening eye gel with vitamin C helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Moisturizing Shampoo with Coconut Oil\", 19.99, 100, \"This moisturizing shampoo with coconut oil cleanses and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Care Set with Cuticle Oil\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and strengthening serum.\"),\n (\"Hydrating Lip Gloss with Vitamin E\", 19.99, 100, \"This hydrating lip gloss with vitamin E provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Lavender\", 14.99, 150, \"This moisturizing body lotion with lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Exfoliating Facial Scrub with Sugar\", 24.99, 90, \"This exfoliating facial scrub with sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Brightening Facial Wash\", 19.99, 100, \"This brightening facial wash cleanses and revitalizes your skin. It helps to improve skin tone and texture.\"),\n (\"Moisturizing Foot Spray with Peppermint\", 12.99, 150, \"This moisturizing foot spray with peppermint hydrates and refreshes tired feet. It's perfect for a quick pick-me-up.\"),\n (\"Nail Art Kit with Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Cucumber\", 22.99, 90, \"This hydrating gel cream with cucumber provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Shampoo with Aloe Vera\", 19.99, 100, \"This moisturizing shampoo with aloe vera nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Brightening Eye Cream with Green Tea\", 22.99, 90, \"This brightening eye cream with green tea helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Art Stamping Kit with Plates\", 24.99, 80, \"Create stunning nail designs with this stamping kit that includes plates. It's easy to use and perfect for intricate patterns.\"),\n (\"Hydrating Overnight Cream with Retinol\", 34.99, 60, \"This hydrating overnight cream with retinol works while you sleep to improve skin texture. Wake up with a refreshed complexion.\"),\n (\"Moisturizing Body Wash with Aloe Vera\", 14.99, 150, \"This moisturizing body wash with aloe vera cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Nail Polish Set with Pastel Colors\", 29.99, 70, \"This nail polish set with pastel colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Balm with Vitamin E\", 12.99, 200, \"This hydrating lip balm with vitamin E keeps your lips soft and moisturized. It's perfect for everyday use.\"),\n (\"Moisturizing Body Butter with Coconut\", 19.99, 100, \"This moisturizing body butter with coconut hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Brightening Facial Serum with Niacinamide\", 27.99, 70, \"This brightening facial serum with niacinamide helps to improve skin tone and texture. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Almond\", 12.99, 200, \"This moisturizing hand cream with almond hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Kit with Strengthener\", 29.99, 60, \"This nail care kit includes everything you need for healthy nails. It features a nail file, cuticle oil, and strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut Oil\", 19.99, 100, \"This hydrating lip gloss with coconut oil provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut Oil\", 14.99, 150, \"This moisturizing body lotion with coconut oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Aloe Vera\", 22.99, 90, \"This brightening eye gel with aloe vera helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coffee\", 19.99, 100, \"This exfoliating body scrub with coffee gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Shea Butter\", 19.99, 100, \"This moisturizing shampoo with shea butter nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter. It's perfect for adding sparkle to your manicure.\"),\n (\"Hydrating Gel Face Mask with Honey\", 15.99, 150, \"This hydrating gel face mask with honey soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Scrub with Coffee\", 24.99, 90, \"This brightening facial scrub with coffee helps to remove dead skin cells and improve radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut\", 15.99, 130, \"This moisturizing foot cream with coconut hydrates and nourishes your feet. It's perfect for a soothing treatment.\"),\n (\"Nail Polish Set with Neon Colors\", 29.99, 70, \"This nail polish set with neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Aloe Vera\", 14.99, 150, \"This hydrating lip mask with aloe vera provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Lavender\", 19.99, 100, \"This moisturizing body butter with lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Cream with Cucumber\", 22.99, 90, \"This brightening eye cream with cucumber helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Art Stamping Kit with Designs\", 24.99, 80, \"Create stunning nail designs with this stamping kit that includes various designs. It's easy to use and perfect for intricate patterns.\"),\n (\"Hydrating Overnight Mask with Coconut\", 34.99, 60, \"This hydrating overnight mask with coconut works while you sleep to nourish and repair your skin. Wake up with a refreshed complexion.\"),\n (\"Moisturizing Body Wash with Lavender\", 14.99, 150, \"This moisturizing body wash with lavender cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Nail Polish Set with Bold Colors\", 29.99, 70, \"This nail polish set with bold colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Balm with Aloe Vera\", 12.99, 200, \"This hydrating lip balm with aloe vera keeps your lips soft and moisturized. It's perfect for everyday use.\"),\n (\"Moisturizing Body Lotion with Argan Oil\", 14.99, 150, \"This moisturizing body lotion with argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Green Tea\", 22.99, 90, \"This brightening eye gel with green tea helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Oatmeal\", 24.99, 90, \"This exfoliating facial scrub with oatmeal gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Spray with Lavender\", 12.99, 150, \"This moisturizing foot spray with lavender hydrates and refreshes tired feet. It's perfect for a quick pick-me-up.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Green Tea\", 22.99, 90, \"This hydrating gel cream with green tea provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Shampoo with Coconut Milk\", 19.99, 100, \"This moisturizing shampoo with coconut milk nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Brightening Eye Cream with Licorice\", 22.99, 90, \"This brightening eye cream with licorice helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Art Kit with Rhinestones\", 29.99, 70, \"Create stunning nail designs with this nail art kit that includes rhinestones. It's perfect for adding sparkle to your manicure.\"),\n (\"Hydrating Overnight Cream with Aloe Vera\", 34.99, 60, \"This hydrating overnight cream with aloe vera works while you sleep to improve skin texture. Wake up with a refreshed complexion.\"),\n (\"Moisturizing Body Wash with Almond Oil\", 14.99, 150, \"This moisturizing body wash with almond oil cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Nail Polish Set with Metallic Colors\", 29.99, 70, \"This nail polish set with metallic colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Strawberry\", 14.99, 150, \"This hydrating lip mask with strawberry provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Olive Oil\", 19.99, 100, \"This moisturizing body butter with olive oil hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Brightening Eye Gel with Rose Extract\", 22.99, 90, \"This brightening eye gel with rose extract helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Walnut\", 24.99, 90, \"This exfoliating facial scrub with walnut gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Chamomile\", 15.99, 130, \"This moisturizing foot cream with chamomile hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Foil\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes foil. It's perfect for adding a touch of glamour.\"),\n (\"Hydrating Gel Face Mask with Papaya\", 15.99, 150, \"This hydrating gel face mask with papaya soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Papaya\", 27.99, 70, \"This brightening facial serum with papaya helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Grapefruit\", 12.99, 200, \"This moisturizing hand cream with grapefruit hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Nail Strengthener\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and strengthening serum.\"),\n (\"Hydrating Lip Gloss with Peach\", 19.99, 100, \"This hydrating lip gloss with peach provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut Water\", 14.99, 150, \"This moisturizing body lotion with coconut water hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Passionfruit\", 22.99, 90, \"This brightening eye gel with passionfruit helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Sea Salt\", 19.99, 100, \"This exfoliating body scrub with sea salt gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Honey\", 19.99, 100, \"This moisturizing shampoo with honey nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Stencils and Foil\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and foil. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Aloe Vera and Cucumber\", 22.99, 90, \"This hydrating gel cream with aloe vera and cucumber provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Olive Oil\", 14.99, 150, \"This moisturizing body wash with olive oil cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Argan Oil\", 22.99, 90, \"This brightening eye cream with argan oil helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon\", 29.99, 70, \"This nail polish set with glitter and neon features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut Oil\", 14.99, 150, \"This hydrating lip mask with coconut oil provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Mango\", 19.99, 100, \"This moisturizing body butter with mango hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Brightening Eye Gel with Mint\", 22.99, 90, \"This brightening eye gel with mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Rice\", 24.99, 90, \"This exfoliating facial scrub with rice gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Mint\", 15.99, 130, \"This moisturizing foot cream with mint hydrates and refreshes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Rhinestones and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes rhinestones and glitter. It's perfect for adding sparkle to your manicure.\"),\n (\"Hydrating Gel Face Mask with Cucumber and Aloe\", 15.99, 150, \"This hydrating gel face mask with cucumber and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Green Tea\", 27.99, 70, \"This brightening facial serum with green tea helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Almond\", 12.99, 200, \"This moisturizing hand cream with coconut and almond hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Nail Polish\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a nail polish.\"),\n (\"Hydrating Lip Gloss with Coconut and Aloe\", 19.99, 100, \"This hydrating lip gloss with coconut and aloe provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Honey\", 14.99, 150, \"This moisturizing body lotion with coconut and honey hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Cucumber and Aloe\", 22.99, 90, \"This brightening eye gel with cucumber and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coffee and Sugar\", 19.99, 100, \"This exfoliating body scrub with coffee and sugar gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Rhinestones\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and rhinestones. It's perfect for adding sparkle to your manicure.\"),\n (\"Hydrating Gel Cream with Aloe and Cucumber\", 22.99, 90, \"This hydrating gel cream with aloe and cucumber provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Honey\", 14.99, 150, \"This moisturizing body wash with coconut and honey cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut\", 22.99, 90, \"This brightening eye cream with coconut helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Pastel and Glitter\", 29.99, 70, \"This nail polish set with pastel and glitter features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Aloe and Coconut\", 14.99, 150, \"This hydrating lip mask with aloe and coconut provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Almond\", 19.99, 100, \"This moisturizing body butter with coconut and almond hydrates and nourishes your skin. Its rich formula leaves your skin feeling soft and smooth.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut\", 24.99, 90, \"This exfoliating facial scrub with coconut gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Mint\", 15.99, 130, \"This moisturizing foot cream with coconut and mint hydrates and refreshes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Rhinestones\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and rhinestones. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Honey\", 15.99, 150, \"This hydrating gel face mask with coconut and honey soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut\", 27.99, 70, \"This brightening facial serum with coconut helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Honey\", 12.99, 200, \"This moisturizing hand cream with coconut and honey hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Base Coat\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a base coat.\"),\n (\"Hydrating Lip Gloss with Coconut and Mint\", 19.99, 100, \"This hydrating lip gloss with coconut and mint provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Lavender\", 14.99, 150, \"This moisturizing body lotion with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Coffee\", 19.99, 100, \"This exfoliating body scrub with coconut and coffee gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Honey\", 19.99, 100, \"This moisturizing shampoo with coconut and honey nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Coconut and Aloe\", 22.99, 90, \"This hydrating gel cream with coconut and aloe provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Lavender\", 14.99, 150, \"This moisturizing body wash with coconut and lavender cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut and Mint\", 22.99, 90, \"This brightening eye cream with coconut and mint helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon Colors\", 29.99, 70, \"This nail polish set with glitter and neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut and Honey\", 14.99, 150, \"This hydrating lip mask with coconut and honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Lavender\", 19.99, 100, \"This moisturizing body butter with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut and Sugar\", 24.99, 90, \"This exfoliating facial scrub with coconut and sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Lavender\", 15.99, 130, \"This moisturizing foot cream with coconut and lavender hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Aloe\", 15.99, 150, \"This hydrating gel face mask with coconut and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut and Honey\", 27.99, 70, \"This brightening facial serum with coconut and honey helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Mint\", 12.99, 200, \"This moisturizing hand cream with coconut and mint hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Strengthening Serum\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut and Honey\", 19.99, 100, \"This hydrating lip gloss with coconut and honey provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Argan Oil\", 14.99, 150, \"This moisturizing body lotion with coconut and argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Oatmeal\", 19.99, 100, \"This exfoliating body scrub with coconut and oatmeal gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Coconut and Honey\", 22.99, 90, \"This hydrating gel cream with coconut and honey provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Honey\", 14.99, 150, \"This moisturizing body wash with coconut and honey cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut and Mint\", 22.99, 90, \"This brightening eye cream with coconut and mint helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon Colors\", 29.99, 70, \"This nail polish set with glitter and neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut and Honey\", 14.99, 150, \"This hydrating lip mask with coconut and honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Lavender\", 19.99, 100, \"This moisturizing body butter with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut and Sugar\", 24.99, 90, \"This exfoliating facial scrub with coconut and sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Lavender\", 15.99, 130, \"This moisturizing foot cream with coconut and lavender hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Aloe\", 15.99, 150, \"This hydrating gel face mask with coconut and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut and Honey\", 27.99, 70, \"This brightening facial serum with coconut and honey helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Mint\", 12.99, 200, \"This moisturizing hand cream with coconut and mint hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Strengthening Serum\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut and Honey\", 19.99, 100, \"This hydrating lip gloss with coconut and honey provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Argan Oil\", 14.99, 150, \"This moisturizing body lotion with coconut and argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Oatmeal\", 19.99, 100, \"This exfoliating body scrub with coconut and oatmeal gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Coconut and Honey\", 22.99, 90, \"This hydrating gel cream with coconut and honey provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Honey\", 14.99, 150, \"This moisturizing body wash with coconut and honey cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut and Mint\", 22.99, 90, \"This brightening eye cream with coconut and mint helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon Colors\", 29.99, 70, \"This nail polish set with glitter and neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut and Honey\", 14.99, 150, \"This hydrating lip mask with coconut and honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Lavender\", 19.99, 100, \"This moisturizing body butter with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut and Sugar\", 24.99, 90, \"This exfoliating facial scrub with coconut and sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Lavender\", 15.99, 130, \"This moisturizing foot cream with coconut and lavender hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Aloe\", 15.99, 150, \"This hydrating gel face mask with coconut and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut and Honey\", 27.99, 70, \"This brightening facial serum with coconut and honey helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Mint\", 12.99, 200, \"This moisturizing hand cream with coconut and mint hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Strengthening Serum\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut and Honey\", 19.99, 100, \"This hydrating lip gloss with coconut and honey provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Argan Oil\", 14.99, 150, \"This moisturizing body lotion with coconut and argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Oatmeal\", 19.99, 100, \"This exfoliating body scrub with coconut and oatmeal gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Coconut and Honey\", 22.99, 90, \"This hydrating gel cream with coconut and honey provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Honey\", 14.99, 150, \"This moisturizing body wash with coconut and honey cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut and Mint\", 22.99, 90, \"This brightening eye cream with coconut and mint helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon Colors\", 29.99, 70, \"This nail polish set with glitter and neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut and Honey\", 14.99, 150, \"This hydrating lip mask with coconut and honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Lavender\", 19.99, 100, \"This moisturizing body butter with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut and Sugar\", 24.99, 90, \"This exfoliating facial scrub with coconut and sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Lavender\", 15.99, 130, \"This moisturizing foot cream with coconut and lavender hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Aloe\", 15.99, 150, \"This hydrating gel face mask with coconut and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut and Honey\", 27.99, 70, \"This brightening facial serum with coconut and honey helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Mint\", 12.99, 200, \"This moisturizing hand cream with coconut and mint hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Strengthening Serum\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut and Honey\", 19.99, 100, \"This hydrating lip gloss with coconut and honey provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Argan Oil\", 14.99, 150, \"This moisturizing body lotion with coconut and argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Oatmeal\", 19.99, 100, \"This exfoliating body scrub with coconut and oatmeal gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry hair. It leaves your hair feeling soft and manageable.\"),\n (\"Nail Art Kit with Glitter and Stencils\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes glitter and stencils. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Cream with Coconut and Honey\", 22.99, 90, \"This hydrating gel cream with coconut and honey provides soothing moisture. It's perfect for all skin types and absorbs quickly.\"),\n (\"Moisturizing Body Wash with Coconut and Honey\", 14.99, 150, \"This moisturizing body wash with coconut and honey cleanses and hydrates your skin. It leaves you feeling refreshed and rejuvenated.\"),\n (\"Brightening Eye Cream with Coconut and Mint\", 22.99, 90, \"This brightening eye cream with coconut and mint helps to reduce puffiness and dark circles. Its lightweight formula absorbs quickly for a refreshed look.\"),\n (\"Nail Polish Set with Glitter and Neon Colors\", 29.99, 70, \"This nail polish set with glitter and neon colors features a variety of shades for any occasion. Each polish provides a long-lasting, chip-resistant finish.\"),\n (\"Hydrating Lip Mask with Coconut and Honey\", 14.99, 150, \"This hydrating lip mask with coconut and honey provides intense moisture while you sleep. Wake up with soft, plump lips.\"),\n (\"Moisturizing Body Butter with Coconut and Lavender\", 19.99, 100, \"This moisturizing body butter with coconut and lavender hydrates and nourishes your skin. Its calming scent makes it perfect for bedtime.\"),\n (\"Brightening Eye Gel with Aloe and Mint\", 22.99, 90, \"This brightening eye gel with aloe and mint helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Facial Scrub with Coconut and Sugar\", 24.99, 90, \"This exfoliating facial scrub with coconut and sugar gently removes dead skin cells and improves radiance. It's perfect for achieving a glowing complexion.\"),\n (\"Moisturizing Foot Cream with Coconut and Lavender\", 15.99, 130, \"This moisturizing foot cream with coconut and lavender hydrates and nourishes tired feet. It's perfect for a soothing treatment.\"),\n (\"Nail Art Kit with Stencils and Glitter\", 29.99, 70, \"Create beautiful nail designs with this nail art kit that includes stencils and glitter. It's perfect for achieving intricate patterns with ease.\"),\n (\"Hydrating Gel Face Mask with Coconut and Aloe\", 15.99, 150, \"This hydrating gel face mask with coconut and aloe soothes and refreshes your skin. It's perfect for a quick hydration boost.\"),\n (\"Brightening Facial Serum with Coconut and Honey\", 27.99, 70, \"This brightening facial serum with coconut and honey helps to improve skin tone and reduce dark spots. It's perfect for achieving a radiant complexion.\"),\n (\"Moisturizing Hand Cream with Coconut and Mint\", 12.99, 200, \"This moisturizing hand cream with coconut and mint hydrates and nourishes your hands. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Nail Care Set with Strengthening Serum\", 29.99, 60, \"This nail care set includes everything you need for healthy nails. It features a nail file, cuticle oil, and a strengthening serum.\"),\n (\"Hydrating Lip Gloss with Coconut and Honey\", 19.99, 100, \"This hydrating lip gloss with coconut and honey provides a high-shine finish while keeping your lips moisturized. It's perfect for everyday wear.\"),\n (\"Moisturizing Body Lotion with Coconut and Argan Oil\", 14.99, 150, \"This moisturizing body lotion with coconut and argan oil hydrates and nourishes your skin. Its lightweight formula absorbs quickly for soft skin.\"),\n (\"Brightening Eye Gel with Coconut and Aloe\", 22.99, 90, \"This brightening eye gel with coconut and aloe helps to reduce puffiness and dark circles. Its cooling formula provides instant relief.\"),\n (\"Exfoliating Body Scrub with Coconut and Oatmeal\", 19.99, 100, \"This exfoliating body scrub with coconut and oatmeal gently removes dead skin cells and improves circulation. It's perfect for achieving soft, smooth skin.\"),\n (\"Moisturizing Shampoo with Coconut and Aloe\", 19.99, 100, \"This moisturizing shampoo with coconut and aloe nourishes and hydrates dry"