"[\n    (\"Beard Oil\", 19.99, 150, \"This nourishing beard oil softens and hydrates facial hair while promoting healthy growth. Infused with natural oils, it leaves a subtle scent and a well-groomed finish.\"),\n    (\"Shaving Cream\", 14.99, 200, \"A rich, creamy formula that provides a smooth glide for your razor, reducing irritation and ensuring a close shave. Enriched with moisturizing ingredients for soft skin.\"),\n    (\"Hair Pomade\", 22.99, 100, \"This strong-hold pomade offers a classic, slick look without the greasy feel. Perfect for styling all hair types, it washes out easily with shampoo.\"),\n    (\"Face Wash\", 12.99, 180, \"A gentle face wash that removes dirt and impurities while maintaining skin's natural moisture balance. Ideal for daily use, it leaves your skin feeling fresh and clean.\"),\n    (\"Aftershave Balm\", 24.99, 120, \"Soothe and hydrate your skin post-shave with this calming aftershave balm. Formulated with natural ingredients, it reduces redness and irritation.\"),\n    (\"Beard Comb\", 9.99, 250, \"Crafted from durable materials, this beard comb helps detangle and style your facial hair effortlessly. Its ergonomic design ensures comfortable use.\"),\n    (\"Hair Gel\", 15.99, 140, \"Achieve a strong hold and lasting style with this versatile hair gel. Perfect for creating sleek looks or adding texture to your hair.\"),\n    (\"Body Wash\", 18.99, 160, \"This invigorating body wash cleanses and refreshes your skin with a rich lather. Its energizing scent will leave you feeling revitalized all day.\"),\n    (\"Facial Moisturizer\", 29.99, 130, \"A lightweight moisturizer that hydrates and nourishes your skin without clogging pores. Ideal for daily use, it promotes a healthy, youthful appearance.\"),\n    (\"Beard Balm\", 21.99, 110, \"This conditioning beard balm helps tame unruly hair while providing nourishment and shine. Its natural ingredients ensure your beard stays healthy and soft.\"),\n    (\"Shaving Brush\", 29.99, 90, \"A classic shaving brush made from high-quality bristles for a luxurious lather. It enhances your shaving experience and prepares your skin for a close shave.\"),\n    (\"Hair Styling Cream\", 17.99, 150, \"This lightweight styling cream provides flexible hold and a natural finish. Perfect for achieving a relaxed, tousled look without stiffness.\"),\n    (\"Deodorant Stick\", 9.99, 300, \"Stay fresh all day with this aluminum-free deodorant stick. Its natural formula neutralizes odor while keeping your skin soft and dry.\"),\n    (\"Face Scrub\", 16.99, 130, \"Exfoliate and refresh your skin with this invigorating face scrub. It helps remove dead skin cells, revealing a brighter and smoother complexion.\"),\n    (\"Cologne Spray\", 49.99, 80, \"A sophisticated cologne with a blend of woody and citrus notes, perfect for any occasion. Its long-lasting formula keeps you smelling great throughout the day.\"),\n    (\"Shampoo\", 14.99, 200, \"This revitalizing shampoo cleanses your hair while nourishing the scalp. Suitable for all hair types, it promotes healthy hair growth and shine.\"),\n    (\"Conditioner\", 14.99, 200, \"A rich conditioner that detangles and hydrates your hair, leaving it soft and manageable. Ideal for daily use, it helps restore moisture and shine.\"),\n    (\"Nail Clipper Set\", 12.99, 150, \"This nail clipper set includes precision clippers for both nails and toenails. Ergonomically designed for a comfortable grip and easy use.\"),\n    (\"Electric Razor\", 89.99, 70, \"Experience a close and comfortable shave with this advanced electric razor. Its ergonomic design and multiple settings cater to all skin types.\"),\n    (\"Facial Serum\", 34.99, 90, \"This powerful facial serum targets fine lines and wrinkles, promoting youthful skin. Packed with antioxidants, it leaves your complexion radiant.\"),\n    (\"Mustache Wax\", 11.99, 180, \"Achieve a perfectly styled mustache with this strong-hold mustache wax. Its natural formula keeps your facial hair in place without feeling stiff.\"),\n    (\"Foot Cream\", 19.99, 110, \"Pamper your feet with this moisturizing foot cream that softens dry, cracked skin. Infused with essential oils, it leaves your feet feeling refreshed.\"),\n    (\"Sunscreen Lotion\", 24.99, 140, \"Protect your skin from harmful UV rays with this lightweight sunscreen lotion. Its non-greasy formula absorbs quickly and provides long-lasting protection.\"),\n    (\"Hair Clipper\", 59.99, 80, \"This professional-grade hair clipper offers precision cutting for all hair types. Its cordless design and multiple attachments make it easy to achieve your desired style.\"),\n    (\"Body Lotion\", 15.99, 160, \"A rich body lotion that deeply hydrates and nourishes your skin. Its fast-absorbing formula leaves your skin soft and smooth without any greasy residue.\"),\n    (\"Shaving Set\", 39.99, 75, \"This complete shaving set includes a razor, brush, and stand, perfect for an elegant grooming routine. Crafted with quality materials for a luxurious experience.\"),\n    (\"Face Mask\", 12.99, 110, \"Indulge in a spa-like experience with this revitalizing face mask. It hydrates and rejuvenates your skin, leaving it looking fresh and glowing.\"),\n    (\"Body Scrub\", 19.99, 140, \"This exfoliating body scrub removes dead skin cells, revealing softer, smoother skin. Its delightful fragrance makes for a refreshing shower experience.\"),\n    (\"Hair Tonic\", 18.99, 120, \"A revitalizing hair tonic that nourishes the scalp and promotes healthy hair growth. Its lightweight formula is perfect for daily use.\"),\n    (\"Beard Trimmer\", 49.99, 90, \"This precision beard trimmer offers adjustable lengths for customized grooming. Its cordless design and sharp blades make it easy to achieve your desired look.\"),\n    (\"Lip Balm\", 7.99, 200, \"Keep your lips moisturized and protected with this nourishing lip balm. Its natural ingredients soothe and heal dry, chapped lips.\"),\n    (\"Shaving Oil\", 16.99, 130, \"This lightweight shaving oil provides a smooth glide for your razor, reducing irritation. Formulated with essential oils, it leaves your skin feeling soft.\"),\n    (\"Hair Brush\", 12.99, 150, \"A high-quality hair brush designed to detangle and smooth all hair types. Its ergonomic handle ensures comfortable use for all grooming needs.\"),\n    (\"Fragrance Oil\", 29.99, 80, \"This concentrated fragrance oil offers a long-lasting scent that can be used in various ways. Perfect for personal use or as a gift for someone special.\"),\n    (\"Facial Wipes\", 9.99, 200, \"Convenient facial wipes that cleanse and refresh your skin on-the-go. These wipes are perfect for removing makeup or impurities after a long day.\"),\n    (\"Beard Shampoo\", 14.99, 160, \"Specially formulated for facial hair, this beard shampoo cleanses and softens while preventing dryness. It helps maintain a healthy beard with every wash.\"),\n    (\"Shaving Stand\", 24.99, 70, \"A stylish shaving stand to keep your razor and brush organized. Its sleek design adds a touch of elegance to your grooming routine.\"),\n    (\"Moustache Comb\", 8.99, 200, \"This fine-toothed moustache comb is perfect for styling and grooming. Compact and portable, it's a must-have for any well-groomed man.\"),\n    (\"Beard Growth Serum\", 29.99, 100, \"Encourage fuller beard growth with this nourishing beard growth serum. Packed with vitamins and essential oils, it promotes healthy hair follicles.\"),\n    (\"Face Moisturizing Cream\", 19.99, 150, \"This rich moisturizing cream hydrates and protects your skin throughout the day. Lightweight and non-greasy, it absorbs quickly for a fresh feel.\"),\n    (\"Anti-Aging Cream\", 34.99, 90, \"Combat signs of aging with this powerful anti-aging cream. It targets wrinkles and fine lines, leaving your skin looking youthful and revitalized.\"),\n    (\"Hair Fiber\", 18.99, 120, \"This hair fiber product adds thickness and volume to your hair, creating a fuller look. It's easy to apply and washes out effortlessly.\"),\n    (\"Nourishing Beard Conditioner\", 22.99, 130, \"This beard conditioner softens and detangles facial hair, making it easier to style. Its nourishing formula promotes a healthy, well-groomed beard.\"),\n    (\"Body Spray\", 15.99, 140, \"A refreshing body spray that invigorates your senses with a burst of fragrance. Perfect for a quick pick-me-up throughout the day.\"),\n    (\"Face Lotion\", 19.99, 150, \"This lightweight face lotion hydrates and protects your skin without feeling heavy. It's ideal for daily use and suitable for all skin types.\"),\n    (\"Hair Serum\", 24.99, 100, \"A nourishing hair serum that adds shine and reduces frizz, making your hair more manageable. Perfect for all hair types, it leaves your locks looking healthy.\"),\n    (\"Beard Grooming Kit\", 39.99, 75, \"This all-in-one beard grooming kit includes everything you need for a well-maintained beard. Perfect for beginners or seasoned pros alike.\"),\n    (\"Cooling Aftershave\", 19.99, 120, \"This cooling aftershave provides instant relief after shaving, soothing irritated skin. Its refreshing formula leaves a pleasant tingling sensation.\"),\n    (\"Beard Scissors\", 14.99, 150, \"Precision beard scissors designed for trimming and shaping your facial hair. Their ergonomic design ensures a comfortable grip for detailed grooming.\"),\n    (\"Hair Removal Cream\", 12.99, 130, \"This gentle hair removal cream effectively removes unwanted hair while soothing the skin. Perfect for sensitive areas, it leaves your skin smooth.\"),\n    (\"Eyebrow Grooming Kit\", 18.99, 110, \"This eyebrow grooming kit includes tools for shaping and maintaining perfect brows. Compact and easy to use, it's perfect for on-the-go touch-ups.\"),\n    (\"Men's Cologne Gift Set\", 59.99, 60, \"A luxurious cologne gift set featuring a selection of sophisticated scents. Perfect for gifting or treating yourself to a variety of fragrances.\"),\n    (\"Beard Shaping Tool\", 11.99, 180, \"This beard shaping tool helps you achieve the perfect beard outline with ease. Its sturdy design ensures consistent results every time.\"),\n    (\"Hair Color Kit\", 29.99, 80, \"This hair color kit provides everything you need for a professional-looking color at home. With a variety of shades, it's easy to find your perfect match.\"),\n    (\"Men's Facial Kit\", 49.99, 70, \"This comprehensive facial kit includes everything needed for a rejuvenating skincare routine. Ideal for all skin types, it promotes a healthy complexion.\"),\n    (\"Body Hair Trimmer\", 39.99, 90, \"This body hair trimmer is designed for sensitive areas, providing a safe and comfortable grooming experience. Its waterproof design makes it easy to clean.\"),\n    (\"Men's Grooming Subscription Box\", 29.99, 50, \"Receive a curated selection of men's grooming products delivered to your door each month. Discover new favorites and stay on top of your grooming game.\"),\n    (\"Hair Clay\", 19.99, 130, \"This versatile hair clay provides a strong hold with a matte finish, perfect for creating textured styles. Its lightweight formula ensures a natural look.\"),\n    (\"Grooming Apron\", 24.99, 60, \"Keep your clothes clean while grooming with this stylish grooming apron. Its adjustable design fits all sizes, making it a practical addition to your routine.\"),\n    (\"Men's Skincare Set\", 39.99, 70, \"This skincare set includes a cleanser, moisturizer, and serum, designed specifically for men's skin. Achieve a fresh and youthful appearance with ease.\"),\n    (\"Beard Detangler Spray\", 14.99, 150, \"This detangler spray helps smooth out knots and tangles in your beard, making grooming effortless. Its lightweight formula is perfect for daily use.\"),\n    (\"Men's Grooming Mirror\", 34.99, 90, \"A sleek grooming mirror with built-in LED lights for perfect visibility. Ideal for detailed grooming tasks, it ensures you look your best every time.\"),\n    (\"Hair Wax\", 15.99, 140, \"This strong-hold hair wax provides a flexible style with a natural finish. Perfect for creating defined looks or adding texture to your hair.\"),\n    (\"Beard Care Book\", 19.99, 50, \"A comprehensive guide to beard care, offering tips and techniques for maintaining a healthy beard. Perfect for beginners and seasoned beard enthusiasts alike.\"),\n    (\"Men's Grooming Tote\", 29.99, 70, \"A stylish and functional grooming tote to keep all your essentials organized. Perfect for travel or daily use, it ensures you're always prepared.\"),\n    (\"Beard Growth Kit\", 49.99, 60, \"This beard growth kit includes everything you need to promote fuller beard growth. Packed with nourishing products, it's perfect for any beard enthusiast.\"),\n    (\"Men's Grooming Scissors\", 14.99, 150, \"Precision grooming scissors designed for trimming hair and beards with ease. Their sharp blades ensure clean cuts for a polished look.\"),\n    (\"Charcoal Face Mask\", 12.99, 110, \"This detoxifying charcoal face mask helps draw out impurities and unclog pores. Perfect for a deep clean, it leaves your skin feeling refreshed.\"),\n    (\"Men's Grooming Guide\", 19.99, 50, \"An informative guide covering essential grooming tips and techniques for men. Learn how to elevate your grooming routine and look your best.\"),\n    (\"Beard Care Kit\", 39.99, 70, \"This all-in-one beard care kit includes oil, balm, and a comb for complete grooming. Perfect for maintaining a healthy and stylish beard.\"),\n    (\"Men's Grooming Towel\", 9.99, 200, \"A soft, absorbent towel designed specifically for grooming needs. Its compact size makes it perfect for travel or at-home use.\"),\n    (\"Men's Grooming Stopwatch\", 19.99, 60, \"This stylish stopwatch helps you time your grooming routine for efficiency. Perfect for busy mornings or ensuring you take your time.\"),\n    (\"Beard Oil Gift Set\", 34.99, 80, \"A luxurious gift set featuring a selection of premium beard oils. Perfect for gifting or treating yourself to a variety of nourishing scents.\"),\n    (\"Men's Grooming Course\", 49.99, 40, \"An online course that teaches essential grooming skills and techniques. Learn how to master your grooming routine and look your best.\"),\n    (\"Men's Grooming Umbrella\", 19.99, 50, \"A stylish umbrella designed for the modern man, perfect for keeping you dry on rainy days. Its compact size makes it easy to carry.\"),\n    (\"Beard Growth Vitamins\", 29.99, 100, \"These beard growth vitamins are formulated to support healthy hair growth from within. Packed with essential nutrients, they promote fuller beards.\"),\n    (\"Men's Grooming Keychain\", 7.99, 200, \"A practical keychain featuring essential grooming tools for on-the-go touch-ups. Compact and stylish, it's a must-have for any man.\"),\n    (\"Men's Grooming Journal\", 14.99, 100, \"A journal designed for tracking your grooming routine and progress. Helps you stay organized and focused on your grooming goals.\"),\n    (\"Men's Grooming Bluetooth Speaker\", 39.99, 60, \"A portable Bluetooth speaker designed for use in the bathroom during grooming sessions. Enjoy your favorite tunes while you get ready.\"),\n    (\"Men's Grooming Water Bottle\", 19.99, 70, \"Stay hydrated with this stylish water bottle designed for the modern man. Perfect for gym sessions or daily hydration on the go.\"),\n    (\"Men's Grooming Phone Holder\", 12.99, 150, \"A practical phone holder that keeps your device within reach during grooming sessions. Its sleek design complements any bathroom decor.\"),\n    (\"Men's Grooming Candle\", 24.99, 80, \"A scented candle designed for the grooming enthusiast, creating a relaxing atmosphere. Perfect for unwinding after a long day.\"),\n    (\"Men's Grooming Wall Art\", 34.99, 50, \"Stylish wall art that celebrates the art of grooming, perfect for your bathroom or grooming space. Adds a touch of personality to your decor.\"),\n    (\"Men's Grooming Apron\", 29.99, 60, \"A durable apron designed to protect your clothes during grooming sessions. Stylish and functional, it keeps you looking sharp.\"),\n    (\"Men's Grooming Phone Stand\", 12.99, 150, \"A convenient phone stand that keeps your device at eye level during grooming. Perfect for following tutorials or making video calls.\"),\n    (\"Men's Grooming Card Game\", 19.99, 40, \"A fun card game designed around grooming tips and trivia. Perfect for entertaining friends while sharing grooming knowledge.\"),\n    (\"Men's Grooming Pocket Mirror\", 9.99, 200, \"A compact pocket mirror that's perfect for quick touch-ups on the go. Its sleek design makes it a stylish accessory.\"),\n    (\"Men's Grooming Nail File\", 7.99, 200, \"A portable nail file designed for maintaining well-groomed nails. Compact and easy to carry, it's perfect for on-the-go grooming.\"),\n    (\"Men's Grooming Travel Kit\", 39.99, 70, \"A complete travel kit featuring essential grooming products for men. Perfect for vacations or business trips, ensuring you're always prepared.\"),\n    (\"Men's Grooming Checklist\", 14.99, 100, \"A practical checklist designed to help you stay organized with your grooming routine. Perfect for tracking products and tasks.\"),\n    (\"Men's Grooming Water Resistant Bag\", 29.99, 60, \"A stylish water-resistant bag designed to keep your grooming products safe. Perfect for travel or daily use, it ensures your essentials are protected.\"),\n    (\"Men's Grooming Subscription Service\", 39.99, 40, \"Sign up for a monthly subscription service that delivers curated grooming products to your door. Discover new favorites with each box.\"),\n    (\"Men's Grooming Toolkit\", 49.99, 50, \"A complete toolkit featuring all the essential tools for grooming. Perfect for maintaining your look at home or on the go.\"),\n    (\"Men's Grooming Workshop\", 59.99, 30, \"Join a workshop to learn advanced grooming techniques from experts. Perfect for men looking to elevate their grooming game.\"),\n    (\"Men's Grooming Consultation\", 79.99, 20, \"Book a one-on-one consultation with a grooming expert to personalize your routine. Get tailored advice and recommendations for your grooming needs.\")\n]"