"[\n    (\"Casual Button-Up Shirt\", 29.99, 150, \"This stylish button-up shirt is perfect for casual outings. Made from breathable fabric, it ensures comfort while keeping you looking sharp.\"),\n    (\"Slim Fit Chinos\", 39.99, 100, \"These slim fit chinos provide a modern look while offering all-day comfort. Perfect for both work and play, they pair well with a variety of tops.\"),\n    (\"Classic Denim Jacket\", 49.99, 75, \"A timeless denim jacket that never goes out of style. It features a rugged design and can be layered over almost any outfit.\"),\n    (\"Graphic T-Shirt\", 19.99, 200, \"Express your personality with this graphic t-shirt. Made from soft cotton, it’s comfortable for all-day wear.\"),\n    (\"Sporty Joggers\", 34.99, 120, \"These joggers are perfect for workouts or lounging. They feature a relaxed fit and are made from moisture-wicking fabric.\"),\n    (\"Leather Belt\", 24.99, 80, \"A classic leather belt that adds a touch of sophistication to any outfit. Durable and stylish, it’s an essential accessory.\"),\n    (\"Hooded Sweatshirt\", 44.99, 90, \"Stay warm and stylish with this hooded sweatshirt. It features a cozy fleece lining and a front pocket for convenience.\"),\n    (\"Cargo Shorts\", 29.99, 110, \"These cargo shorts are ideal for summer adventures. With multiple pockets, they offer both style and practicality.\"),\n    (\"Wool Blend Sweater\", 59.99, 60, \"A cozy wool blend sweater perfect for chilly days. Its classic design makes it versatile enough for any occasion.\"),\n    (\"Athletic Sneakers\", 69.99, 150, \"These athletic sneakers are designed for comfort and performance. Ideal for running or casual wear, they offer excellent support.\"),\n    (\"Formal Dress Shirt\", 39.99, 70, \"This formal dress shirt is tailored for a perfect fit. Made from premium cotton, it’s great for business or special occasions.\"),\n    (\"Polo Shirt\", 29.99, 100, \"A classic polo shirt that combines comfort and style. Perfect for casual outings or golf games.\"),\n    (\"Lightweight Windbreaker\", 49.99, 40, \"Stay protected from the elements with this lightweight windbreaker. It’s easy to pack and perfect for unpredictable weather.\"),\n    (\"Beanie Hat\", 19.99, 150, \"This cozy beanie hat is perfect for keeping warm in colder months. Its stylish design makes it a great accessory for any outfit.\"),\n    (\"Classic Leather Wallet\", 34.99, 80, \"A sleek leather wallet that combines functionality with style. It features multiple card slots and a bill compartment.\"),\n    (\"Short Sleeve Henley\", 24.99, 100, \"This short sleeve henley is a versatile addition to your wardrobe. Made from soft cotton, it’s perfect for layering or wearing alone.\"),\n    (\"Running Shorts\", 29.99, 90, \"Lightweight and breathable, these running shorts are designed for maximum comfort. They feature a built-in liner for added support.\"),\n    (\"Chino Shorts\", 34.99, 75, \"These chino shorts offer a polished look for warm weather. They are made from durable fabric and are available in various colors.\"),\n    (\"Flannel Shirt\", 39.99, 60, \"Stay cozy with this classic flannel shirt. Its soft fabric and timeless pattern make it a great choice for casual outings.\"),\n    (\"Casual Lace-Up Boots\", 79.99, 50, \"These casual lace-up boots are perfect for any season. They offer a rugged look while ensuring comfort with every step.\"),\n    (\"Swim Trunks\", 24.99, 120, \"Get ready for summer with these stylish swim trunks. They feature a comfortable fit and quick-drying fabric.\"),\n    (\"Thermal Base Layer\", 34.99, 70, \"This thermal base layer is perfect for outdoor activities in cold weather. It provides warmth without adding bulk.\"),\n    (\"Leather Messenger Bag\", 89.99, 30, \"A sophisticated leather messenger bag that’s perfect for work or travel. It features multiple compartments for organization.\"),\n    (\"Sunglasses\", 29.99, 150, \"Protect your eyes in style with these trendy sunglasses. They offer UV protection and a comfortable fit.\"),\n    (\"Track Jacket\", 49.99, 40, \"This track jacket is perfect for workouts or casual wear. It features a sporty design and breathable fabric.\"),\n    (\"Work Boots\", 89.99, 50, \"These durable work boots provide excellent support and protection. They are designed for long hours on the job.\"),\n    (\"V-Neck T-Shirt\", 19.99, 200, \"This classic v-neck t-shirt is a wardrobe staple. It’s made from soft cotton and is available in various colors.\"),\n    (\"Cargo Pants\", 49.99, 80, \"These cargo pants offer a blend of comfort and utility. With multiple pockets, they are perfect for outdoor adventures.\"),\n    (\"Bermuda Shorts\", 34.99, 90, \"These Bermuda shorts are ideal for summer outings. They offer a relaxed fit and are made from lightweight fabric.\"),\n    (\"Fleece Pullover\", 44.99, 60, \"Stay warm with this soft fleece pullover. It’s perfect for layering during colder months.\"),\n    (\"Classic Trench Coat\", 99.99, 30, \"This classic trench coat adds sophistication to any outfit. It features a timeless design and is perfect for rainy days.\"),\n    (\"Knit Beanie\", 19.99, 150, \"This knit beanie is both stylish and functional. It keeps your head warm while adding a trendy touch to your outfit.\"),\n    (\"Travel Backpack\", 69.99, 40, \"A versatile travel backpack designed for comfort and convenience. It features multiple compartments for organization.\"),\n    (\"Denim Shorts\", 29.99, 110, \"These denim shorts are a summer essential. They offer a casual look and are perfect for beach outings.\"),\n    (\"Puffer Jacket\", 89.99, 50, \"Stay warm and stylish with this puffer jacket. It features a lightweight design and is perfect for winter outings.\"),\n    (\"Long Sleeve Tee\", 24.99, 100, \"This long sleeve tee is a versatile addition to your wardrobe. It’s made from breathable fabric for all-day comfort.\"),\n    (\"Leather Dress Shoes\", 79.99, 40, \"These leather dress shoes are perfect for formal occasions. They offer a classic look and are crafted for comfort.\"),\n    (\"Sport Shorts\", 29.99, 90, \"These sport shorts are designed for active lifestyles. They feature moisture-wicking fabric to keep you cool during workouts.\"),\n    (\"Pullover Hoodie\", 44.99, 80, \"This pullover hoodie is perfect for casual wear. It features a cozy fit and a front kangaroo pocket.\"),\n    (\"Canvas Sneakers\", 39.99, 60, \"These canvas sneakers offer a laid-back style for everyday wear. They are lightweight and comfortable for all-day use.\"),\n    (\"Windbreaker Pants\", 34.99, 70, \"These windbreaker pants are perfect for outdoor activities. They are lightweight and provide protection from the wind.\"),\n    (\"Classic Suit Jacket\", 129.99, 20, \"This classic suit jacket is tailored for a sharp look. It’s perfect for formal events and business meetings.\"),\n    (\"Thermal Hoodie\", 49.99, 40, \"This thermal hoodie is great for layering in colder weather. It offers warmth and a stylish look.\"),\n    (\"Chukka Boots\", 79.99, 50, \"These chukka boots are versatile and stylish. They can be dressed up or down for any occasion.\"),\n    (\"Athletic Compression Shirt\", 34.99, 80, \"This athletic compression shirt provides support during workouts. It’s made from moisture-wicking fabric for comfort.\"),\n    (\"Vintage Graphic Tee\", 24.99, 100, \"Show off your style with this vintage graphic tee. It’s soft and comfortable, perfect for casual wear.\"),\n    (\"Lightweight Cargo Vest\", 49.99, 30, \"This lightweight cargo vest is perfect for outdoor adventures. It features multiple pockets for storage.\"),\n    (\"Short Sleeve Camp Shirt\", 29.99, 90, \"This short sleeve camp shirt is ideal for summer gatherings. It’s made from breathable fabric and features a relaxed fit.\"),\n    (\"Classic Fit Jeans\", 49.99, 80, \"These classic fit jeans offer comfort and style. They are versatile enough to wear for any occasion.\"),\n    (\"Utility Jacket\", 69.99, 50, \"This utility jacket combines style and functionality. It features multiple pockets and a rugged design.\"),\n    (\"Dressy Casual Shoes\", 74.99, 40, \"These dressy casual shoes are perfect for smart-casual occasions. They provide comfort without sacrificing style.\"),\n    (\"Lightweight Pullover\", 39.99, 70, \"This lightweight pullover is perfect for layering. It’s comfortable and comes in various colors.\"),\n    (\"Athletic Track Pants\", 34.99, 100, \"These athletic track pants are designed for comfort and mobility. Ideal for workouts or lounging.\"),\n    (\"Casual Slip-On Shoes\", 59.99, 50, \"These casual slip-on shoes are perfect for easy wear. They offer comfort and style for everyday activities.\"),\n    (\"Faux Leather Jacket\", 79.99, 30, \"This faux leather jacket adds an edgy touch to any outfit. It’s perfect for transitioning between seasons.\"),\n    (\"Striped Long Sleeve Shirt\", 29.99, 100, \"This striped long sleeve shirt is a stylish choice for casual outings. It’s made from soft fabric for comfort.\"),\n    (\"Knit Sweater\", 49.99, 60, \"This knit sweater is perfect for layering in colder months. Its classic design makes it a versatile piece.\"),\n    (\"Graphic Hoodie\", 44.99, 40, \"Stay cozy and stylish with this graphic hoodie. It features a fun design and a comfortable fit.\"),\n    (\"Cargo Joggers\", 39.99, 50, \"These cargo joggers combine comfort and utility. They feature multiple pockets and a relaxed fit.\"),\n    (\"Relaxed Fit Trousers\", 49.99, 70, \"These relaxed fit trousers are perfect for casual or work settings. They offer comfort and a polished look.\"),\n    (\"Classic Windbreaker\", 59.99, 30, \"This classic windbreaker is lightweight and stylish. It’s perfect for unpredictable weather.\"),\n    (\"Bamboo T-Shirt\", 24.99, 100, \"This eco-friendly bamboo t-shirt is soft and breathable. It’s a comfortable choice for everyday wear.\"),\n    (\"Fleece-Lined Leggings\", 34.99, 80, \"These fleece-lined leggings offer warmth and comfort during colder months. They are perfect for layering or lounging.\"),\n    (\"Denim Overalls\", 69.99, 40, \"These denim overalls combine comfort and style. They are perfect for casual outings or working in the garden.\"),\n    (\"Sport Performance Shirt\", 34.99, 90, \"This sport performance shirt is designed for active lifestyles. It features moisture-wicking fabric to keep you dry.\"),\n    (\"Hiking Pants\", 49.99, 50, \"These hiking pants are perfect for outdoor adventures. They are durable and offer a comfortable fit.\"),\n    (\"Classic Crew Neck Sweater\", 59.99, 60, \"This classic crew neck sweater is a timeless addition to your wardrobe. It’s perfect for layering in cooler weather.\"),\n    (\"Tactical Backpack\", 89.99, 30, \"This tactical backpack is designed for durability and functionality. It features multiple compartments for gear organization.\"),\n    (\"Linen Shirt\", 39.99, 70, \"This linen shirt is perfect for hot summer days. It’s lightweight and breathable, ensuring all-day comfort.\"),\n    (\"Casual Loafers\", 69.99, 40, \"These casual loafers provide comfort and style for everyday wear. They are versatile enough for any occasion.\"),\n    (\"Padded Jacket\", 79.99, 30, \"Stay warm with this padded jacket. It features a stylish design and is perfect for winter outings.\"),\n    (\"Athletic Tank Top\", 24.99, 100, \"This athletic tank top is perfect for workouts or warm weather. It’s made from breathable fabric for maximum comfort.\"),\n    (\"Suit Pants\", 79.99, 50, \"These suit pants are tailored for a sharp, professional look. They are perfect for business meetings or formal events.\"),\n    (\"Classic Cardigan\", 49.99, 60, \"This classic cardigan is perfect for layering in cooler weather. Its versatile design makes it a wardrobe staple.\"),\n    (\"Athletic Windbreaker\", 44.99, 40, \"This athletic windbreaker is ideal for outdoor activities. It features a lightweight design and breathable fabric.\"),\n    (\"Lightweight Summer Jacket\", 59.99, 30, \"This lightweight summer jacket is perfect for breezy evenings. It combines style and comfort effortlessly.\")\n]"