"[\n    (\"DSLR Camera\", 899.99, 30, \"A professional-grade DSLR camera that captures stunning images in any lighting condition. With interchangeable lenses and advanced features, it's perfect for both beginners and experienced photographers.\"),\n    (\"Tripod\", 49.99, 150, \"A sturdy tripod that provides stability for your camera during shoots. Its adjustable height and lightweight design make it easy to transport and set up.\"),\n    (\"Camera Bag\", 79.99, 100, \"A stylish and functional camera bag designed to protect your gear. It features multiple compartments for organization and is made from durable materials.\"),\n    (\"External Flash\", 199.99, 25, \"An external flash that enhances your photography with improved lighting. It's compatible with most DSLR cameras and offers various settings for creative control.\"),\n    (\"Lens Cleaning Kit\", 29.99, 200, \"A comprehensive lens cleaning kit that keeps your optics spotless. It includes a microfiber cloth, cleaning solution, and a blower for dust removal.\"),\n    (\"Gimbal Stabilizer\", 299.99, 40, \"A professional gimbal stabilizer for smooth video capture. It compensates for camera shake, allowing you to create cinematic shots effortlessly.\"),\n    (\"Wide-Angle Lens\", 249.99, 35, \"A wide-angle lens that expands your creative possibilities. Perfect for landscape photography, it captures more of the scene in every shot.\"),\n    (\"Camera Remote\", 39.99, 100, \"A wireless camera remote that allows you to take photos from a distance. It's perfect for group shots and long-exposure photography.\"),\n    (\"Reflector Kit\", 59.99, 60, \"A versatile reflector kit that enhances natural light during shoots. It includes multiple colors to manipulate light and shadows effectively.\"),\n    (\"Memory Card\", 29.99, 250, \"A high-capacity memory card for storing your photos and videos. It offers fast read and write speeds, ensuring you never miss a moment.\"),\n    (\"Drone Camera\", 999.99, 20, \"A high-tech drone camera that captures stunning aerial footage. It features GPS tracking and a high-resolution camera for breathtaking perspectives.\"),\n    (\"Photography Lighting Kit\", 199.99, 30, \"A complete lighting kit designed for studio photography. It includes softboxes, stands, and bulbs to create the perfect lighting setup.\"),\n    (\"Camera Strap\", 19.99, 150, \"An ergonomic camera strap that provides comfort during long shoots. Its adjustable design fits most cameras and ensures secure carrying.\"),\n    (\"Lens Hood\", 24.99, 80, \"A lens hood that prevents lens flare and improves image quality. Its durable design fits easily onto most camera lenses.\"),\n    (\"Photo Printer\", 149.99, 50, \"A compact photo printer that produces high-quality prints from your smartphone. It offers wireless connectivity for easy printing on-the-go.\"),\n    (\"Action Camera\", 299.99, 25, \"A rugged action camera designed for adventure enthusiasts. It's waterproof and shockproof, perfect for capturing thrilling moments.\"),\n    (\"Studio Backdrop\", 89.99, 40, \"A professional studio backdrop that enhances your photography setup. It’s easy to set up and available in various colors for creative versatility.\"),\n    (\"Flash Diffuser\", 19.99, 120, \"A flash diffuser that softens the harsh light of your camera flash. It helps create more natural-looking photos in low-light conditions.\"),\n    (\"Portable Light Box\", 79.99, 30, \"A portable light box that provides even lighting for product photography. Its collapsible design makes it easy to transport and store.\"),\n    (\"Photography Book\", 39.99, 90, \"A comprehensive photography book filled with tips and techniques. Ideal for both beginners and seasoned photographers looking to enhance their skills.\"),\n    (\"Camera Lens\", 499.99, 20, \"A premium camera lens that delivers exceptional image quality. It's designed for professional use, offering sharpness and clarity in every shot.\"),\n    (\"Smartphone Lens Attachment\", 49.99, 100, \"A lens attachment that enhances your smartphone photography. It provides wide-angle and macro options for versatile shooting.\"),\n    (\"Photography Workshop Voucher\", 199.99, 15, \"A voucher for a photography workshop that covers essential skills and techniques. Perfect for anyone looking to improve their photography.\"),\n    (\"Light Meter\", 149.99, 25, \"A handheld light meter that helps you measure lighting conditions accurately. It’s essential for achieving perfect exposure in your shots.\"),\n    (\"Battery Grip\", 99.99, 40, \"A battery grip that extends your camera's battery life. It also provides added comfort and stability for vertical shooting.\"),\n    (\"Underwater Camera Case\", 89.99, 30, \"A durable underwater camera case that protects your gear while diving. It allows you to capture stunning underwater photography.\"),\n    (\"Lens Cap\", 9.99, 200, \"A simple yet essential lens cap that protects your lens from dust and scratches. It's compatible with most camera lenses.\"),\n    (\"Photography Portfolio Case\", 59.99, 50, \"A sleek portfolio case designed to showcase your best work. It features protective sleeves and a professional design for presentations.\"),\n    (\"Telephoto Lens\", 399.99, 15, \"A telephoto lens that brings distant subjects closer with stunning clarity. Ideal for wildlife and sports photography.\"),\n    (\"Camera Cleaning Brush\", 19.99, 180, \"A handy camera cleaning brush that removes dust and dirt from your gear. Its compact size makes it perfect for on-the-go maintenance.\"),\n    (\"Sling Camera Bag\", 69.99, 70, \"A comfortable sling camera bag that allows for quick access to your gear. Its stylish design and ample storage make it a great choice.\"),\n    (\"Photo Editing Software\", 99.99, 30, \"A powerful photo editing software that enhances your images with advanced tools. Ideal for both amateur and professional photographers.\"),\n    (\"360-Degree Camera\", 399.99, 20, \"A unique 360-degree camera that captures immersive photos and videos. Perfect for creating virtual tours and engaging content.\"),\n    (\"Camera Lens Filter\", 29.99, 150, \"A lens filter that reduces glare and enhances colors in your photos. It's a must-have accessory for outdoor photography.\"),\n    (\"Photography Reflector\", 39.99, 120, \"A lightweight photography reflector that manipulates natural light. It’s perfect for enhancing portraits and product shots.\"),\n    (\"Photo Album\", 24.99, 80, \"A beautiful photo album to store and preserve your cherished memories. Its elegant design makes it a great gift for any occasion.\"),\n    (\"Wireless Microphone\", 149.99, 25, \"A wireless microphone that captures clear audio for your videos. It's perfect for interviews, vlogs, and presentations.\"),\n    (\"Camera Lens Adapter\", 39.99, 100, \"A lens adapter that allows you to use different lenses on your camera. It's a versatile tool for expanding your photographic options.\"),\n    (\"Photography Lighting Umbrella\", 29.99, 150, \"A photography lighting umbrella that diffuses light for softer shadows. It's a great addition to any lighting kit.\"),\n    (\"Softbox Lighting Kit\", 199.99, 30, \"A professional softbox lighting kit that provides even lighting for portraits. It's easy to set up and perfect for studio work.\"),\n    (\"Camera Battery\", 49.99, 100, \"A rechargeable camera battery that ensures you never miss a shot. It's compatible with various camera models for convenience.\"),\n    (\"Digital Photo Frame\", 89.99, 40, \"A digital photo frame that displays your favorite images in a slideshow. It's a great way to showcase your photography at home.\"),\n    (\"Photography Backpack\", 129.99, 30, \"A spacious photography backpack that fits all your gear securely. Its ergonomic design makes it comfortable for long hikes.\"),\n    (\"Action Camera Mount\", 19.99, 150, \"A versatile mount for your action camera that allows for creative angles. Perfect for sports and adventure filming.\"),\n    (\"Photo Editing Tablet\", 349.99, 15, \"A high-resolution tablet designed for photo editing. It offers precise control and a natural drawing experience for retouching.\"),\n    (\"Camera Rain Cover\", 39.99, 80, \"A protective rain cover that safeguards your camera during wet conditions. It's lightweight and easy to use, ensuring your gear stays dry.\"),\n    (\"Photography Studio Tent\", 99.99, 20, \"A photography studio tent that creates a controlled environment for product shots. It's portable and easy to set up for on-location shoots.\"),\n    (\"UV Lens Filter\", 24.99, 150, \"A UV lens filter that protects your lens from scratches and dust. It also helps reduce haze in outdoor photography.\"),\n    (\"Camera Tripod Head\", 59.99, 40, \"A fluid tripod head that allows for smooth panning and tilting. It's essential for videographers and photographers alike.\"),\n    (\"Photography Light Meter\", 149.99, 25, \"A light meter that accurately measures light intensity for perfect exposure. It's a valuable tool for serious photographers.\"),\n    (\"Camera Lens Case\", 29.99, 100, \"A protective lens case that keeps your lenses safe from damage. Its compact design is perfect for travel.\"),\n    (\"Photography Props Set\", 49.99, 60, \"A set of photography props to enhance your creative shoots. Includes various items to add interest to portraits and product photography.\"),\n    (\"Portable Photo Studio\", 199.99, 15, \"A portable photo studio that provides professional lighting and backdrops. Ideal for product photography on-the-go.\"),\n    (\"Camera Monitor\", 299.99, 20, \"A high-definition camera monitor for precise framing and focus. It's essential for videographers looking to improve their production quality.\"),\n    (\"Photography Workshop Guide\", 19.99, 200, \"A comprehensive guide to photography workshops around the world. It includes tips on finding the right workshop for your needs.\"),\n    (\"Photo Editing Keyboard\", 89.99, 30, \"A specialized keyboard designed for photo editing software. It features customizable keys for quick access to essential tools.\"),\n    (\"Photography Business Card Holder\", 24.99, 100, \"A stylish business card holder for photographers. Perfect for networking and showcasing your work at events.\"),\n    (\"Camera Lens Cleaning Pen\", 14.99, 180, \"A compact lens cleaning pen that removes smudges and fingerprints. It's a handy tool for keeping your lens in top condition.\"),\n    (\"Photography Lighting Grid\", 39.99, 80, \"A lighting grid that controls the spread of light for more focused illumination. Ideal for studio and portrait photography.\"),\n    (\"Camera Filter Kit\", 99.99, 30, \"A comprehensive camera filter kit that includes various filters for creative effects. It's a great addition for any photographer's toolkit.\"),\n    (\"Photography Phone App\", 9.99, 500, \"A mobile app designed to enhance your photography skills. It offers tutorials, tips, and a community of fellow photographers.\"),\n    (\"Camera Lens Pouch\", 19.99, 150, \"A padded lens pouch that provides extra protection for your lenses. Its compact design makes it easy to carry in your bag.\"),\n    (\"Photography Lighting Stand\", 49.99, 100, \"A sturdy lighting stand that supports various lighting equipment. It's essential for setting up a professional photography studio.\"),\n    (\"Camera Lens Case with Strap\", 34.99, 70, \"A protective lens case with an attached strap for easy carrying. Ideal for photographers on the move.\"),\n    (\"Photography Workshop Admission\", 149.99, 20, \"Admission to an exclusive photography workshop with industry experts. A great opportunity to learn and network.\"),\n    (\"Camera Lens Calibration Tool\", 59.99, 50, \"A lens calibration tool that ensures your lens is perfectly aligned. It's essential for achieving sharp images.\"),\n    (\"Photography Contest Entry Fee\", 29.99, 100, \"An entry fee for a prestigious photography contest. Showcase your talent and compete for exciting prizes.\"),\n    (\"Camera USB Cable\", 9.99, 200, \"A reliable USB cable for transferring images from your camera to your computer. It's a must-have accessory for photographers.\"),\n    (\"Photography Business Guide\", 39.99, 80, \"A guide for aspiring photography business owners. It covers essential topics like marketing, pricing, and client management.\"),\n    (\"Camera Lens Mount\", 49.99, 100, \"A lens mount that allows you to use various lenses on your camera body. It's perfect for expanding your creative options.\"),\n    (\"Photography Light Diffuser\", 19.99, 150, \"A light diffuser that softens harsh light for more flattering portraits. It's a simple tool that makes a big difference.\"),\n    (\"Camera Battery Charger\", 29.99, 200, \"A quick battery charger that ensures your camera is always ready for action. It's compatible with various battery types.\"),\n    (\"Photography Networking Event Ticket\", 99.99, 15, \"A ticket to a photography networking event where you can meet industry professionals. Expand your connections and learn from the best.\")\n]"