"products = [\n    (\"SmartClean 3000\", 299.99, 20, \"The SmartClean 3000 is equipped with advanced navigation technology. It efficiently maps your home for thorough cleaning and avoids obstacles with ease.\"),\n    (\"DustBot Pro\", 249.99, 15, \"DustBot Pro offers powerful suction and a slim design that easily fits under furniture. Its smart sensors ensure it cleans every corner of your home.\"),\n    (\"RoboVac Max\", 349.99, 10, \"RoboVac Max features a high-efficiency filter and a large dustbin capacity. Perfect for pet owners, it captures allergens and pet hair effectively.\"),\n    (\"CleanMate 500\", 199.99, 25, \"The CleanMate 500 is a budget-friendly option that doesn’t compromise on performance. It has a user-friendly interface and multiple cleaning modes.\"),\n    (\"iSweep 700\", 379.99, 8, \"iSweep 700 boasts a sleek design with Wi-Fi connectivity for remote control. Its powerful motor ensures deep cleaning on all floor types.\"),\n    (\"AutoVac Elite\", 459.99, 5, \"AutoVac Elite is a premium robot vacuum with smart mapping and scheduling features. It adapts to your cleaning needs and offers voice control.\"),\n    (\"EcoClean Robot\", 229.99, 30, \"EcoClean Robot is designed with energy efficiency in mind. It uses less power while delivering a thorough clean, making it eco-friendly.\"),\n    (\"TurboVac 200\", 299.99, 12, \"TurboVac 200 features turbo cleaning technology for a deep clean. Its compact design ensures it can reach tight spaces effortlessly.\"),\n    (\"SmartHome Cleaner\", 399.99, 6, \"SmartHome Cleaner integrates seamlessly with your smart home system. It offers customizable cleaning schedules and real-time monitoring.\"),\n    (\"PetHair Ninja\", 269.99, 18, \"PetHair Ninja is specifically designed for homes with pets. Its specialized brush system captures pet hair and dander efficiently.\"),\n    (\"MopVac Duo\", 349.99, 7, \"MopVac Duo combines vacuuming and mopping in one device. It’s perfect for maintaining clean floors with minimal effort.\"),\n    (\"QuietClean 900\", 279.99, 14, \"QuietClean 900 operates at a whisper-quiet level, making it ideal for nighttime cleaning. It still delivers powerful suction for effective dirt removal.\"),\n    (\"Roomba X5\", 499.99, 3, \"Roomba X5 features advanced AI for optimal cleaning paths. Its self-emptying base means less maintenance for you.\"),\n    (\"FloorBot 100\", 199.99, 22, \"FloorBot 100 is an entry-level robot vacuum with essential features. It’s lightweight and easy to use, making it a great starter option.\"),\n    (\"DustBuster 400\", 319.99, 9, \"DustBuster 400 is equipped with a HEPA filter to trap allergens. Its smart sensors help it navigate around furniture effortlessly.\"),\n    (\"HomeGuardian 600\", 429.99, 4, \"HomeGuardian 600 offers enhanced security features, including live video streaming. It keeps your home clean while monitoring for intruders.\"),\n    (\"SuctionMaster 2000\", 399.99, 11, \"SuctionMaster 2000 is designed for heavy-duty cleaning tasks. Its powerful suction and large capacity make it suitable for large homes.\"),\n    (\"RoboCleaner 360\", 249.99, 16, \"RoboCleaner 360 can clean all floor types with ease. Its compact design allows it to reach under furniture and along edges.\"),\n    (\"SmartVac 5G\", 499.99, 2, \"SmartVac 5G features the latest technology for efficient cleaning. With its app integration, you can control it from anywhere.\"),\n    (\"BreezeBot 800\", 299.99, 13, \"BreezeBot 800 is perfect for allergy sufferers, featuring a high-efficiency filter. Its quiet operation makes it suitable for any time of day.\"),\n    (\"PowerSweep 1500\", 379.99, 1, \"PowerSweep 1500 offers high-performance cleaning with a powerful motor. It’s designed to tackle the toughest dirt and debris.\"),\n    (\"NanoVac 100\", 199.99, 28, \"NanoVac 100 is a compact robot vacuum that’s easy to store. Its efficient cleaning pattern ensures no spot is missed.\"),\n    (\"UltraClean 300\", 259.99, 17, \"UltraClean 300 combines style and functionality in a sleek design. It features smart scheduling and a long battery life.\"),\n    (\"SwiftVac Mini\", 149.99, 35, \"SwiftVac Mini is perfect for small spaces and quick clean-ups. Its lightweight design makes it easy to carry around.\"),\n    (\"DeepClean Robot\", 349.99, 5, \"DeepClean Robot uses advanced technology to provide a thorough clean. Its powerful suction is ideal for carpets and hard floors alike.\"),\n    (\"SmartMop Robot\", 299.99, 10, \"SmartMop Robot not only vacuums but also mops your floors. It’s perfect for keeping your home spotless with minimal effort.\"),\n    (\"RoboVac CleanSweep\", 229.99, 20, \"RoboVac CleanSweep features a slim profile to fit under furniture easily. Its smart sensors help it avoid obstacles while cleaning.\"),\n    (\"IntelliVac 900\", 399.99, 8, \"IntelliVac 900 offers intelligent mapping and scheduling features. It learns your cleaning preferences over time for optimal performance.\"),\n    (\"EcoSweep 400\", 249.99, 15, \"EcoSweep 400 is designed with sustainability in mind. It uses environmentally friendly materials and low energy consumption.\"),\n    (\"UltraQuiet 500\", 279.99, 12, \"UltraQuiet 500 operates at a low noise level, making it perfect for homes with children or pets. It still provides powerful cleaning capabilities.\"),\n    (\"SmartClean Pro\", 499.99, 3, \"SmartClean Pro is a top-of-the-line robot vacuum with advanced AI. Its self-learning technology adapts to your cleaning needs.\"),\n    (\"MightyVac 200\", 199.99, 25, \"MightyVac 200 is a compact and powerful vacuum for everyday cleaning. Its user-friendly controls make it easy to operate.\"),\n    (\"RoboSweep 600\", 329.99, 6, \"RoboSweep 600 features a dual cleaning system for maximum efficiency. It’s designed to tackle both hard floors and carpets.\"),\n    (\"PetMaster 300\", 249.99, 18, \"PetMaster 300 is equipped with specialized brushes designed for pet hair. It efficiently removes dander and allergens from your home.\"),\n    (\"RoboVac 4D\", 399.99, 2, \"RoboVac 4D features multi-directional cleaning for a comprehensive clean. Its smart navigation system ensures no corner is left untouched.\"),\n    (\"HomeClean 1000\", 379.99, 4, \"HomeClean 1000 offers powerful suction and a large dustbin. It’s perfect for busy households that require frequent cleaning.\"),\n    (\"TurboSweep 800\", 299.99, 9, \"TurboSweep 800 is designed for high-performance cleaning with a powerful motor. It excels on both carpets and hard floors.\"),\n    (\"DustBuster 3000\", 199.99, 21, \"DustBuster 3000 is a versatile robot vacuum that’s easy to use. Its compact design allows it to navigate tight spaces effortlessly.\"),\n    (\"SmartVac 360\", 449.99, 3, \"SmartVac 360 features advanced sensors for optimal navigation. It offers a customizable cleaning schedule via a mobile app.\"),\n    (\"QuickClean 200\", 249.99, 14, \"QuickClean 200 is ideal for quick clean-ups and everyday messes. Its lightweight design makes it easy to carry from room to room.\"),\n    (\"RoboMop 500\", 299.99, 7, \"RoboMop 500 combines vacuuming and mopping capabilities. It’s perfect for maintaining clean floors with minimal effort.\"),\n    (\"EcoVac 300\", 229.99, 19, \"EcoVac 300 is an eco-friendly robot vacuum that uses less energy. Its efficient cleaning system ensures your home stays spotless.\"),\n    (\"RoboClean 100\", 199.99, 30, \"RoboClean 100 is an entry-level robot vacuum that offers great value. It’s easy to use and perfect for first-time users.\"),\n    (\"SmartSweep 700\", 399.99, 8, \"SmartSweep 700 features smart mapping technology for efficient cleaning. Its sleek design allows it to blend seamlessly with your home.\"),\n    (\"PetVac 400\", 269.99, 11, \"PetVac 400 is specifically designed for pet owners, with features that tackle pet hair and dander. Its powerful suction ensures a thorough clean.\"),\n    (\"UltraMop 600\", 349.99, 5, \"UltraMop 600 combines advanced vacuuming and mopping functions. It’s perfect for homes with both carpets and hard floors.\"),\n    (\"DustMaster 800\", 299.99, 10, \"DustMaster 800 offers powerful suction and a large dustbin capacity. It’s designed to handle even the toughest cleaning tasks.\"),\n    (\"RoboSweep Pro\", 459.99, 2, \"RoboSweep Pro features advanced AI technology for optimal cleaning paths. Its self-emptying base means less maintenance for you.\"),\n    (\"CleanBot 2000\", 399.99, 3, \"CleanBot 2000 is equipped with smart navigation and scheduling features. It adapts to your cleaning preferences for a personalized experience.\"),\n    (\"SmartDust 300\", 249.99, 17, \"SmartDust 300 is a compact and efficient robot vacuum. Its user-friendly controls make it perfect for everyday cleaning.\"),\n    (\"HomeVac 600\", 329.99, 6, \"HomeVac 600 features a powerful motor and advanced filtration system. It’s designed to tackle allergens and keep your home clean.\"),\n    (\"SwiftSweep 100\", 199.99, 20, \"SwiftSweep 100 is perfect for small spaces and quick clean-ups. Its lightweight design makes it easy to carry around.\"),\n    (\"TurboVac 900\", 379.99, 4, \"TurboVac 900 offers high-performance cleaning with a powerful motor. It’s designed to tackle the toughest dirt and debris.\"),\n    (\"RoboMop Pro\", 299.99, 9, \"RoboMop Pro combines vacuuming and mopping in one device. It’s perfect for maintaining clean floors with minimal effort.\"),\n    (\"EcoSweep 200\", 229.99, 12, \"EcoSweep 200 is designed with sustainability in mind. It uses environmentally friendly materials and low energy consumption.\"),\n    (\"UltraClean 100\", 199.99, 35, \"UltraClean 100 is a compact robot vacuum that’s easy to store. Its efficient cleaning pattern ensures no spot is missed.\"),\n    (\"SmartClean 500\", 399.99, 1, \"SmartClean 500 is a top-of-the-line robot vacuum with advanced AI. Its self-learning technology adapts to your cleaning needs.\"),\n    (\"BreezeBot 300\", 249.99, 15, \"BreezeBot 300 is perfect for allergy sufferers, featuring a high-efficiency filter. Its quiet operation makes it suitable for any time of day.\"),\n    (\"PowerSweep 150\", 149.99, 28, \"PowerSweep 150 is designed for everyday cleaning tasks. Its user-friendly controls make it easy to operate.\"),\n    (\"RoboVac 700\", 349.99, 2, \"RoboVac 700 features advanced sensors for optimal navigation. It offers a customizable cleaning schedule via a mobile app.\"),\n    (\"QuickClean 400\", 199.99, 22, \"QuickClean 400 is ideal for quick clean-ups and everyday messes. Its lightweight design makes it easy to carry from room to room.\"),\n    (\"RoboMop 200\", 299.99, 10, \"RoboMop 200 combines vacuuming and mopping capabilities. It’s perfect for maintaining clean floors with minimal effort.\"),\n    (\"EcoVac 400\", 229.99, 19, \"EcoVac 400 is an eco-friendly robot vacuum that uses less energy. Its efficient cleaning system ensures your home stays spotless.\"),\n    (\"RoboClean 500\", 199.99, 30, \"RoboClean 500 is an entry-level robot vacuum that offers great value. It’s easy to use and perfect for first-time users.\")\n]"