"[(\"Ski Jacket\", 199.99, 30, \"A waterproof ski jacket that provides warmth and comfort on the slopes. It features multiple pockets and a stylish design for both functionality and fashion.\"), \n(\"Ski Pants\", 149.99, 25, \"Durable and insulated ski pants that keep you warm and dry during your skiing adventures. The adjustable waist and reinforced knees ensure a perfect fit and added protection.\"), \n(\"Ski Goggles\", 89.99, 40, \"High-quality ski goggles with anti-fog technology and UV protection. Enjoy clear vision while racing down the mountain, no matter the weather conditions.\"), \n(\"Ski Boots\", 299.99, 20, \"Comfortable and responsive ski boots designed for all-day wear. They feature a customizable fit and excellent support to enhance your skiing performance.\"), \n(\"Ski Poles\", 49.99, 50, \"Lightweight and durable ski poles that provide stability and balance on the slopes. The ergonomic grips ensure comfort during long runs.\"), \n(\"Ski Helmet\", 129.99, 35, \"A safety-certified ski helmet that combines protection with style. It features adjustable ventilation and a snug fit for maximum comfort.\"), \n(\"Ski Socks\", 19.99, 100, \"Warm and moisture-wicking ski socks that keep your feet dry and comfortable. The cushioned design helps prevent blisters during long days on the slopes.\"), \n(\"Ski Bag\", 79.99, 15, \"A padded ski bag that protects your skis during transport. Its adjustable straps make it easy to carry, ensuring your gear arrives safely.\"), \n(\"Ski Tuning Kit\", 59.99, 10, \"A comprehensive ski tuning kit that includes everything you need to maintain your skis. Keep your edges sharp and bases smooth for optimal performance.\"), \n(\"Avalanche Beacon\", 349.99, 8, \"A reliable avalanche beacon that enhances safety in the backcountry. Its intuitive interface and long battery life make it essential for any serious skier.\"), \n(\"Ski Wax\", 24.99, 60, \"High-performance ski wax that improves glide and speed on the snow. Easy to apply, it's perfect for both recreational and competitive skiers.\"), \n(\"Ski Gloves\", 69.99, 45, \"Waterproof and insulated ski gloves that keep your hands warm and dry. The touchscreen-compatible fingers allow you to use your devices without removing them.\"), \n(\"Ski Backpack\", 99.99, 20, \"A versatile ski backpack with ample storage for all your gear. It includes hydration compatibility and is designed for comfort during long treks.\"), \n(\"Snowboard\", 499.99, 12, \"A high-performance snowboard that excels in both powder and park conditions. Its lightweight construction and responsive flex make it perfect for any rider.\"), \n(\"Snowboard Bindings\", 199.99, 18, \"Durable snowboard bindings that provide excellent support and control. The adjustable straps ensure a secure fit for all-day riding.\"), \n(\"Snowboard Boots\", 249.99, 15, \"Comfortable and flexible snowboard boots designed for all skill levels. They feature a heat-moldable liner for a customized fit.\"), \n(\"Ski Tuning Iron\", 39.99, 30, \"A professional-grade tuning iron for melting wax onto your skis. Its adjustable temperature settings ensure optimal results for all types of wax.\"), \n(\"Ski Resort Map\", 14.99, 100, \"A detailed map of local ski resorts that helps you navigate the slopes. It's an essential tool for both beginners and experienced skiers.\"), \n(\"Thermal Base Layers\", 39.99, 75, \"Moisture-wicking thermal base layers that keep you warm and dry. They are lightweight and comfortable, perfect for layering under your ski gear.\"), \n(\"Ski Lift Ticket\", 89.99, 200, \"A day pass for unlimited skiing at a popular ski resort. Enjoy access to all lifts and trails for a full day of winter fun.\"), \n(\"Ski Boot Dryer\", 59.99, 20, \"An electric ski boot dryer that removes moisture and odors from your boots. It ensures your gear is dry and ready for your next adventure.\"), \n(\"Avalanche Shovel\", 39.99, 25, \"A compact avalanche shovel that is essential for backcountry safety. Its lightweight design makes it easy to carry in your pack.\"), \n(\"Ski Safety Gear\", 79.99, 15, \"A comprehensive safety gear set that includes a helmet, goggles, and gloves. Stay protected and stylish on the slopes with this essential kit.\"), \n(\"Snowshoes\", 129.99, 10, \"Lightweight and durable snowshoes designed for easy navigation through deep snow. They feature a comfortable binding system for all-day wear.\"), \n(\"Ski Boot Bag\", 49.99, 30, \"A spacious ski boot bag that holds your boots and accessories. Its padded design provides protection and makes transport easy.\"), \n(\"Ski Resort Guidebook\", 29.99, 80, \"A guidebook featuring the best ski resorts around the world. Discover new destinations and tips for an unforgettable skiing experience.\"), \n(\"Ski Map Holder\", 14.99, 100, \"A waterproof ski map holder that keeps your trail map safe and accessible. It's a must-have for navigating unfamiliar slopes.\"), \n(\"Ski Waxing Bench\", 79.99, 10, \"A sturdy waxing bench that provides a stable surface for tuning your skis. Its adjustable height makes it suitable for any user.\"), \n(\"Portable Ski Rack\", 89.99, 15, \"A portable ski rack that holds your skis securely while on the go. Its compact design makes it easy to store when not in use.\"), \n(\"Skiing Lessons Voucher\", 199.99, 50, \"A voucher for professional skiing lessons at a local resort. Perfect for beginners looking to improve their skills or experienced skiers wanting to refine their technique.\"), \n(\"Ski Resort Season Pass\", 599.99, 5, \"An all-access season pass to a premier ski resort. Enjoy unlimited skiing all winter long with no blackout dates.\"), \n(\"Ice Scraper\", 9.99, 100, \"A handy ice scraper for clearing your windshield before hitting the slopes. Its ergonomic handle ensures a comfortable grip.\"), \n(\"Skiing Safety Whistle\", 5.99, 150, \"A lightweight safety whistle that can be attached to your gear. It's an essential tool for emergency situations while skiing.\"), \n(\"Skiing First Aid Kit\", 29.99, 40, \"A compact first aid kit designed specifically for skiing emergencies. Equipped with essential supplies for quick response on the slopes.\"), \n(\"Skiing Boot Warmers\", 39.99, 25, \"Battery-operated boot warmers that keep your ski boots toasty warm. Ideal for cold days on the mountain.\"), \n(\"Skiing Hydration Pack\", 49.99, 30, \"A hydration pack designed for skiers, featuring a built-in water reservoir. Stay hydrated while enjoying your time on the slopes.\"), \n(\"Skiing Hand Warmer\", 14.99, 100, \"Reusable hand warmers that provide instant heat for your hands. Perfect for keeping warm during chilly ski sessions.\"), \n(\"Skiing Mittens\", 39.99, 50, \"Insulated skiing mittens that offer superior warmth and comfort. The waterproof exterior ensures your hands stay dry in wet conditions.\"), \n(\"Skiing Fleece Jacket\", 59.99, 40, \"A lightweight fleece jacket that provides warmth and breathability. Perfect for layering under your ski jacket on colder days.\"), \n(\"Skiing Face Mask\", 24.99, 75, \"A breathable face mask that protects your face from cold winds and snow. Its comfortable fit makes it ideal for long days on the slopes.\"), \n(\"Skiing Beanie\", 19.99, 100, \"A stylish beanie that keeps your head warm while skiing. Its soft material and trendy design make it a favorite among winter sports enthusiasts.\"), \n(\"Skiing Neck Gaiter\", 14.99, 80, \"A versatile neck gaiter that can be worn in multiple ways for warmth. It's lightweight and easy to pack for your ski trips.\"), \n(\"Skiing Sunglasses\", 49.99, 35, \"Polarized sunglasses that provide UV protection while skiing. Their lightweight design ensures comfort during long days on the mountain.\"), \n(\"Skiing Trail Map\", 9.99, 100, \"A detailed trail map of local ski areas, essential for navigating the slopes. Keep it handy to explore new runs and terrain.\"), \n(\"Skiing Boot Liners\", 69.99, 15, \"Customizable boot liners that enhance comfort and fit in your ski boots. They provide extra warmth and support for improved performance.\"), \n(\"Skiing Powder Skis\", 599.99, 10, \"High-performance powder skis designed for deep snow conditions. Their wide design and lightweight construction make them ideal for backcountry skiing.\"), \n(\"Skiing All-Mountain Skis\", 499.99, 15, \"Versatile all-mountain skis that perform well on various terrains. Perfect for skiers looking to explore everything the mountain has to offer.\"), \n(\"Skiing Race Skis\", 699.99, 5, \"Professional-grade race skis designed for speed and precision. They are engineered for competitive skiers who demand the best performance.\"), \n(\"Skiing Snowboard Pants\", 149.99, 20, \"Stylish snowboard pants that offer comfort and protection from the elements. The relaxed fit allows for freedom of movement while riding.\"), \n(\"Skiing Softshell Jacket\", 129.99, 30, \"A lightweight softshell jacket that provides wind and water resistance. Ideal for layering or wearing alone on milder ski days.\"), \n(\"Skiing Downhill Skis\", 499.99, 10, \"Downhill skis designed for optimal performance on groomed runs. Their responsive flex and edge grip make them a favorite among enthusiasts.\"), \n(\"Skiing Climbing Skins\", 89.99, 15, \"Climbing skins that attach to your skis for uphill travel. They provide excellent traction on snow, making them essential for backcountry skiing.\"), \n(\"Skiing Avalanche Probe\", 29.99, 25, \"A lightweight avalanche probe for quick searches in emergencies. Its collapsible design makes it easy to carry in your pack.\"), \n(\"Skiing Snowboard Backpack\", 99.99, 20, \"A specialized backpack designed to carry your snowboard and gear. It features padded straps for comfort during transport.\"), \n(\"Skiing Gaiters\", 29.99, 40, \"Durable gaiters that keep snow out of your boots during deep powder days. They are adjustable and easy to put on over any footwear.\"), \n(\"Skiing Ski Pass Holder\", 14.99, 100, \"A convenient ski pass holder that keeps your lift ticket secure and visible. It's a must-have accessory for any skier.\"), \n(\"Skiing Ski Rack\", 89.99, 15, \"A sturdy ski rack for securely storing your skis at home. Its sleek design complements any garage or storage space.\"), \n(\"Skiing Ski Tuning Vise\", 49.99, 10, \"A ski tuning vise that holds your skis securely while you work on them. It's an essential tool for any ski maintenance enthusiast.\"), \n(\"Skiing Snowboard Lock\", 19.99, 50, \"A lightweight snowboard lock that secures your board while you're off the slopes. Keep your gear safe and protected from theft.\"), \n(\"Skiing Ski Resort T-Shirt\", 24.99, 100, \"A comfortable t-shirt featuring your favorite ski resort's logo. Perfect for casual wear or as a souvenir from your ski trips.\"), \n(\"Skiing Performance Socks\", 24.99, 60, \"Performance ski socks designed for maximum comfort and support. They feature cushioning in key areas to prevent fatigue during long days.\"), \n(\"Skiing Insulated Water Bottle\", 29.99, 30, \"An insulated water bottle that keeps your drinks hot or cold for hours. It's perfect for staying hydrated during your skiing adventures.\"), \n(\"Skiing Snowboard Tuning Kit\", 49.99, 20, \"A complete snowboard tuning kit that includes tools and wax for maintenance. Keep your board in top shape for optimal performance.\"), \n(\"Skiing Ski Pass Lanyard\", 9.99, 100, \"A colorful lanyard for holding your ski pass. It's a fun and practical accessory that keeps your pass easily accessible.\"), \n(\"Skiing Avalanche Airbag\", 799.99, 5, \"A state-of-the-art avalanche airbag system that enhances safety in backcountry skiing. Its lightweight design and quick deployment can be lifesaving.\"), \n(\"Skiing Snowboard Gloves\", 69.99, 30, \"Waterproof snowboard gloves that provide warmth and dexterity. The reinforced palms ensure a secure grip on your board.\"), \n(\"Skiing Ski Tuning Scraper\", 14.99, 100, \"A high-quality scraper for removing excess wax from your skis. It's an essential tool for any ski tuning kit.\"), \n(\"Skiing Ski Resort Hoodie\", 39.99, 50, \"A cozy hoodie featuring your favorite ski resort's branding. Perfect for lounging after a long day on the slopes.\"), \n(\"Skiing Snowboard Beanie\", 19.99, 100, \"A stylish beanie designed for snowboarders. Its soft fabric keeps your head warm while adding flair to your winter outfit.\"), \n(\"Skiing Ski Resort Mug\", 14.99, 75, \"A ceramic mug featuring a scenic design of a popular ski resort. Enjoy your favorite hot beverage while reminiscing about your ski trips.\"), \n(\"Skiing Ski Resort Blanket\", 29.99, 40, \"A soft and warm blanket featuring a ski resort theme. Perfect for keeping cozy after a day on the slopes.\"), \n(\"Skiing Ski Resort Keychain\", 9.99, 100, \"A fun keychain featuring the logo of your favorite ski resort. A great way to remember your ski adventures.\"), \n(\"Skiing Snowboard Socks\", 19.99, 60, \"Specialized snowboard socks designed for comfort and warmth. They feature extra cushioning and moisture-wicking properties.\"), \n(\"Skiing Ski Resort Poster\", 24.99, 50, \"A beautifully illustrated poster of a famous ski resort. Perfect for decorating your home or office with winter vibes.\"), \n(\"Skiing Ski Resort Calendar\", 14.99, 75, \"A calendar featuring stunning photography of ski resorts around the world. Keep track of your schedule while enjoying winter scenery.\"), \n(\"Skiing Ski Resort Coasters\", 19.99, 40, \"Set of coasters featuring images of popular ski resorts. Protect your surfaces while showcasing your love for skiing.\"), \n(\"Skiing Ski Resort Tote Bag\", 24.99, 50, \"A durable tote bag featuring a ski resort design. Perfect for carrying your gear or groceries in style.\"), \n(\"Skiing Ski Resort Phone Case\", 19.99, 100, \"A protective phone case featuring a design inspired by ski resorts. Keep your phone safe while showing off your passion for skiing.\"), \n(\"Skiing Ski Resort Water Bottle\", 29.99, 30, \"A reusable water bottle featuring a ski resort design. Stay hydrated while supporting your favorite ski destination.\"), \n(\"Skiing Ski Resort Scarf\", 19.99, 75, \"A warm scarf featuring the logo of a popular ski resort. Perfect for keeping warm on and off the slopes.\"), \n(\"Skiing Ski Resort Wristband\", 9.99, 100, \"A fun wristband featuring the name of your favorite ski resort. Wear it as a reminder of your skiing adventures.\"), \n(\"Skiing Ski Resort Stickers\", 5.99, 150, \"A set of stickers featuring various ski resorts. Great for personalizing your gear or sharing with friends.\"), \n(\"Skiing Ski Resort Patches\", 9.99, 100, \"Embroidered patches featuring popular ski resorts. Perfect for decorating jackets, bags, or hats.\"), \n(\"Skiing Ski Resort Travel Guide\", 29.99, 50, \"A travel guide featuring tips and recommendations for visiting ski resorts. Plan your next skiing trip with confidence.\"), \n(\"Skiing Ski Resort Experience Voucher\", 199.99, 10, \"A voucher for a unique skiing experience at a renowned ski resort. Perfect for gifting or treating yourself to an unforgettable adventure.\"), \n(\"Skiing Ski Resort Experience Package\", 499.99, 5, \"A complete experience package at a luxury ski resort, including accommodations and lift tickets. Enjoy the ultimate skiing getaway.\"), \n(\"Skiing Ski Resort Adventure Book\", 24.99, 100, \"A book featuring thrilling ski adventures and stories from around the world. Perfect for inspiring your next ski trip.\"), \n(\"Skiing Ski Resort Cookbook\", 29.99, 75, \"A cookbook featuring recipes inspired by ski resort cuisine. Enjoy delicious meals that remind you of your time on the slopes.\"), \n(\"Skiing Ski Resort Puzzle\", 19.99, 50, \"A jigsaw puzzle featuring a beautiful image of a ski resort. Perfect for cozy nights in after a day of skiing.\"), \n(\"Skiing Ski Resort Board Game\", 39.99, 20, \"A fun board game themed around skiing and ski resorts. Enjoy friendly competition with family and friends.\"), \n(\"Skiing Ski Resort Virtual Reality Experience\", 99.99, 10, \"A virtual reality experience that lets you ski at famous resorts from the comfort of your home. Perfect for off-season training or fun.\"), \n(\"Skiing Ski Resort Art Print\", 24.99, 50, \"A high-quality art print featuring a stunning ski resort landscape. A great addition to any skiing enthusiast's decor.\"), \n(\"Skiing Ski Resort Photography Book\", 29.99, 40, \"A photography book showcasing breathtaking images of ski resorts. Perfect for inspiring your next skiing adventure.\"), \n(\"Skiing Ski Resort Travel Mug\", 19.99, 75, \"A travel mug featuring a ski resort design, perfect for enjoying hot drinks on the go. Keep your beverages warm while on your way to the slopes.\"), \n(\"Skiing Ski Resort Notebook\", 14.99, 100, \"A stylish notebook featuring a ski resort theme. Great for jotting down your skiing experiences or planning your next trip.\"), \n(\"Skiing Ski Resort Travel Journal\", 24.99, 50, \"A travel journal designed for documenting your skiing adventures. Capture your memories and experiences on the slopes.\"), \n(\"Skiing Ski Resort Map Puzzle\", 19.99, 40, \"A puzzle featuring a detailed map of a popular ski resort. Combine fun with learning about your favorite skiing destination.\"), \n(\"Skiing Ski Resort Bingo Game\", 24.99, 30, \"A fun bingo game themed around skiing and ski resorts. Enjoy a night of entertainment with family and friends.\"), \n(\"Skiing Ski Resort Trivia Game\", 29.99, 20, \"A trivia game that tests your knowledge of skiing and ski resorts. Challenge your friends and family for a fun night in.\"), \n(\"Skiing Ski Resort Coloring Book\", 14.99, 75, \"A coloring book featuring ski resort scenes and winter landscapes. Perfect for relaxing after a day on the slopes.\"), \n(\"Skiing Ski Resort Sticker Book\", 9.99, 100, \"A sticker book filled with ski resort-themed stickers. Great for personalizing your gear or sharing with friends.\"), \n(\"Skiing Ski Resort Magnet\", 5.99, 150, \"A fun magnet featuring a ski resort design. Perfect for decorating your fridge and reminding you of your favorite ski trips.\"), \n(\"Skiing Ski Resort Keychain\", 9.99, 100, \"A colorful keychain featuring the logo of a popular ski resort. A great way to remember your skiing adventures.\"), \n(\"Skiing Ski Resort Travel Mug\", 19.99, 75, \"A travel mug featuring a ski resort design, perfect for enjoying hot drinks on the go. Keep your beverages warm while on your way to the slopes.\"), \n(\"Skiing Ski Resort T-Shirt\", 24.99, 100, \"A comfortable t-shirt featuring your favorite ski resort's logo. Perfect for casual wear or as a souvenir from your ski trips.\")]"