"[(\"Hydrating Facial Cleanser\", 25.99, 150, \"A gentle cleanser that removes impurities without stripping the skin of its natural oils. Enriched with aloe vera and chamomile, it leaves your skin feeling fresh and hydrated.\"), \n(\"Revitalizing Eye Cream\", 32.50, 80, \"This eye cream targets dark circles and puffiness, promoting a bright and youthful appearance. Infused with caffeine and peptides, it helps to firm and smooth the delicate skin around the eyes.\"), \n(\"Moisturizing Day Cream\", 45.00, 120, \"A lightweight day cream that provides long-lasting hydration and protection from environmental stressors. Formulated with hyaluronic acid and antioxidants, it keeps your skin looking radiant all day.\"), \n(\"Nourishing Night Cream\", 38.75, 90, \"This rich night cream works overnight to restore moisture and improve skin texture. Packed with vitamins and natural oils, it leaves your skin feeling soft and rejuvenated by morning.\"), \n(\"Exfoliating Scrub\", 22.00, 200, \"A gentle scrub that polishes away dead skin cells for a smoother complexion. Infused with natural exfoliants and essential oils, it revitalizes your skin without causing irritation.\"), \n(\"Brightening Serum\", 50.00, 70, \"This powerful serum targets dullness and uneven skin tone, promoting a brighter complexion. With vitamin C and niacinamide, it helps to enhance radiance and reduce the appearance of dark spots.\"), \n(\"Sunscreen SPF 50\", 28.99, 110, \"A broad-spectrum sunscreen that protects against UVA and UVB rays while moisturizing the skin. Lightweight and non-greasy, it is perfect for daily wear under makeup.\"), \n(\"Hydrating Face Mask\", 15.99, 130, \"This sheet mask delivers intense hydration and nourishment in just 15 minutes. Infused with hyaluronic acid and botanical extracts, it leaves your skin plump and revitalized.\"), \n(\"Pore Minimizing Toner\", 20.00, 140, \"A refreshing toner that helps to tighten pores and balance skin pH. Formulated with witch hazel and tea tree oil, it controls excess oil and reduces shine.\"), \n(\"Soothing Aloe Gel\", 18.50, 160, \"This soothing gel provides instant relief for irritated or sunburned skin. With pure aloe vera, it hydrates and calms while promoting healing.\"), \n(\"Anti-Aging Retinol Serum\", 55.00, 75, \"A potent retinol serum that reduces the appearance of fine lines and wrinkles. With added hyaluronic acid, it hydrates while promoting cell turnover for youthful skin.\"), \n(\"Charcoal Detox Mask\", 24.99, 85, \"This detoxifying mask draws out impurities and excess oil, leaving your skin clean and refreshed. Enriched with activated charcoal and clay, it helps to unclog pores.\"), \n(\"Lip Balm with SPF\", 12.00, 200, \"A nourishing lip balm that protects and hydrates your lips with SPF 15. Its blend of natural oils keeps lips soft and smooth throughout the day.\"), \n(\"Brightening Under-Eye Patches\", 29.99, 100, \"These under-eye patches reduce puffiness and brighten dark circles in just 20 minutes. Infused with collagen and vitamin E, they rejuvenate the delicate skin around your eyes.\"), \n(\"Cleansing Oil\", 27.50, 90, \"A luxurious cleansing oil that dissolves makeup and impurities effortlessly. With a blend of natural oils, it nourishes the skin while cleansing.\"), \n(\"Facial Mist\", 19.99, 130, \"This refreshing facial mist hydrates and revitalizes your skin throughout the day. Enriched with rosewater and antioxidants, it provides a soothing boost anytime.\"), \n(\"Face Oil\", 42.00, 70, \"A lightweight face oil that absorbs quickly to nourish and hydrate the skin. Formulated with a blend of botanical oils, it leaves your complexion radiant and smooth.\"), \n(\"Peeling Gel\", 23.75, 110, \"This gentle peeling gel exfoliates dead skin cells without harsh scrubbing. It promotes a brighter complexion and improves skin texture with natural fruit enzymes.\"), \n(\"Hand Cream\", 15.00, 150, \"A rich hand cream that deeply moisturizes and protects dry hands. Infused with shea butter and vitamin E, it leaves hands feeling soft and smooth.\"), \n(\"Foot Mask\", 18.00, 80, \"This intensive foot mask nourishes and softens dry, cracked heels. With a blend of natural oils and extracts, it revitalizes tired feet.\"), \n(\"Blemish Control Gel\", 21.50, 90, \"A targeted treatment that helps to reduce the appearance of blemishes and breakouts. Formulated with salicylic acid, it clears pores and soothes inflammation.\"), \n(\"Cooling Gel for Sunburn\", 14.99, 100, \"This cooling gel provides instant relief for sunburned skin. Infused with menthol and aloe vera, it calms irritation and hydrates the skin.\"), \n(\"Makeup Remover Wipes\", 12.50, 200, \"Convenient makeup remover wipes that effectively cleanse the skin while hydrating. Perfect for travel, they leave your skin feeling refreshed and clean.\"), \n(\"Smoothing Body Lotion\", 26.00, 130, \"A luxurious body lotion that deeply moisturizes and smooths the skin. With a blend of shea butter and coconut oil, it leaves your skin soft and fragrant.\"), \n(\"Revitalizing Hair Mask\", 30.00, 75, \"This hair mask revitalizes dry and damaged hair, restoring shine and softness. Infused with argan oil and keratin, it nourishes from root to tip.\"), \n(\"Tinted Moisturizer\", 35.00, 100, \"A lightweight tinted moisturizer that provides hydration and a hint of color. Perfect for a natural look, it evens out skin tone while protecting with SPF.\"), \n(\"Exotic Body Scrub\", 22.50, 90, \"This body scrub exfoliates and polishes the skin, leaving it smooth and radiant. Infused with tropical oils and sugar, it provides a spa-like experience at home.\"), \n(\"Nourishing Cuticle Oil\", 16.75, 140, \"A nourishing cuticle oil that promotes healthy nails and cuticles. With a blend of vitamin E and jojoba oil, it softens and hydrates for a polished look.\"), \n(\"Hydrating Lip Mask\", 14.00, 110, \"This overnight lip mask provides intense hydration and repairs dry, chapped lips. Formulated with hyaluronic acid and shea butter, it leaves lips soft and smooth.\"), \n(\"Calming Face Cream\", 29.00, 80, \"A calming face cream designed for sensitive skin, it reduces redness and irritation. Enriched with chamomile and calendula, it soothes and hydrates.\"), \n(\"Firming Neck Cream\", 34.99, 70, \"This neck cream helps to firm and tighten the skin, reducing the appearance of sagging. With peptides and antioxidants, it nourishes and rejuvenates the delicate area.\"), \n(\"Brightening Face Wash\", 21.00, 120, \"A brightening face wash that gently cleanses and revitalizes dull skin. Infused with vitamin C and botanical extracts, it promotes a radiant complexion.\"), \n(\"Skin Soothing Balm\", 19.50, 100, \"This soothing balm provides relief for dry and irritated skin. With a blend of natural ingredients, it hydrates and calms, ideal for sensitive areas.\"), \n(\"Detoxifying Clay Mask\", 26.00, 85, \"This clay mask draws out impurities and excess oil, leaving your skin clean and refreshed. Enriched with kaolin clay and essential oils, it purifies and revitalizes.\"), \n(\"Moisturizing Foot Cream\", 17.75, 150, \"A rich foot cream that deeply hydrates and softens dry, rough feet. With peppermint oil and shea butter, it provides soothing relief and a refreshing scent.\"), \n(\"Radiance Boosting Serum\", 48.00, 75, \"This serum enhances skin radiance and improves texture. Infused with vitamin C and licorice extract, it brightens and evens out skin tone.\"), \n(\"Gentle Exfoliating Pads\", 24.99, 90, \"These exfoliating pads gently remove dead skin cells and impurities. Infused with glycolic acid and botanical extracts, they reveal a smoother, brighter complexion.\"), \n(\"Refreshing Body Mist\", 15.50, 130, \"A refreshing body mist that hydrates and invigorates the skin. With a light floral scent, it leaves you feeling fresh and uplifted all day.\"), \n(\"Lifting Eye Serum\", 39.99, 70, \"This lifting eye serum targets fine lines and sagging skin around the eyes. With peptides and hyaluronic acid, it firms and hydrates for a youthful appearance.\"), \n(\"Nourishing Hair Oil\", 33.00, 80, \"A nourishing hair oil that adds shine and reduces frizz. Formulated with argan oil and vitamin E, it protects and revitalizes all hair types.\"), \n(\"Calming Lavender Cream\", 27.00, 100, \"This calming cream features lavender to soothe and relax the skin. Ideal for sensitive skin, it hydrates and reduces irritation while promoting tranquility.\"), \n(\"All-Natural Deodorant\", 12.99, 200, \"An all-natural deodorant that keeps you fresh without harsh chemicals. With a blend of essential oils, it provides long-lasting protection and a pleasant scent.\"), \n(\"Skin Brightening Lotion\", 29.50, 90, \"This brightening lotion helps to even out skin tone and enhance radiance. Infused with licorice extract and vitamin C, it nourishes while providing a luminous glow.\"), \n(\"Moisturizing Shaving Cream\", 18.99, 150, \"A moisturizing shaving cream that protects and hydrates the skin during shaving. Its rich formula prevents irritation and leaves skin feeling smooth.\"), \n(\"Hydrating Gel Cream\", 35.00, 80, \"This gel cream provides intense hydration with a lightweight feel. Enriched with hyaluronic acid, it absorbs quickly, making it perfect for all skin types.\"), \n(\"Nourishing Body Butter\", 24.00, 110, \"A rich body butter that deeply moisturizes and nourishes dry skin. With shea butter and coconut oil, it leaves your skin feeling soft and fragrant.\"), \n(\"Sensitive Skin Cleanser\", 20.75, 140, \"A gentle cleanser formulated for sensitive skin, it removes impurities without irritation. Infused with soothing ingredients, it leaves skin calm and refreshed.\"), \n(\"Rejuvenating Facial Oil\", 40.00, 75, \"This rejuvenating facial oil nourishes and revitalizes dull skin. With a blend of natural oils, it promotes a healthy glow and improves skin texture.\"), \n(\"Purifying Foaming Cleanser\", 22.50, 120, \"A foaming cleanser that purifies the skin and removes makeup effortlessly. With tea tree oil and salicylic acid, it helps to control breakouts and excess oil.\"), \n(\"Moisturizing Conditioner\", 15.50, 130, \"A moisturizing conditioner that hydrates and detangles hair. Infused with natural oils, it leaves hair soft, shiny, and easy to manage.\"), \n(\"Skin Repair Balm\", 19.00, 100, \"This skin repair balm provides intense hydration and promotes healing for dry, cracked skin. With a blend of natural ingredients, it soothes and protects.\"), \n(\"Cleansing Micellar Water\", 17.50, 150, \"A gentle micellar water that removes makeup and cleanses the skin without rinsing. Perfect for sensitive skin, it leaves your face feeling fresh and clean.\"), \n(\"Firming Body Cream\", 28.00, 90, \"This firming body cream helps to tighten and smooth the skin. With a blend of peptides and botanical extracts, it promotes a more toned appearance.\"), \n(\"Detangling Hair Spray\", 13.99, 200, \"A detangling hair spray that makes combing through knots easy and painless. With nourishing ingredients, it leaves hair smooth and manageable.\"), \n(\"Hydrating Overnight Mask\", 32.00, 70, \"This overnight mask deeply hydrates and revitalizes the skin while you sleep. Formulated with hyaluronic acid, it provides intense moisture for a plump appearance.\"), \n(\"Cooling Face Mist\", 21.50, 100, \"A cooling face mist that refreshes and hydrates the skin throughout the day. With cucumber extract, it soothes and revitalizes, perfect for hot weather.\"), \n(\"Exotic Body Oil\", 29.99, 80, \"This luxurious body oil nourishes and hydrates the skin, leaving it soft and radiant. Infused with exotic oils, it provides a beautiful glow.\"), \n(\"Vitamin C Brightening Cream\", 35.50, 75, \"A brightening cream that helps to reduce dark spots and enhance radiance. With vitamin C and licorice extract, it promotes an even skin tone.\"), \n(\"Hydrating Shampoo\", 19.99, 130, \"A hydrating shampoo that cleanses and moisturizes dry hair. With natural oils and extracts, it leaves hair feeling soft and healthy.\"), \n(\"Skin Firming Serum\", 44.00, 70, \"This firming serum helps to improve skin elasticity and reduce the appearance of sagging. Infused with collagen and peptides, it promotes a youthful look.\"), \n(\"Gentle Foaming Cleanser\", 23.00, 120, \"A gentle foaming cleanser that removes makeup and impurities without drying the skin. With chamomile and aloe vera, it soothes and refreshes.\"), \n(\"Silk Eye Mask\", 15.00, 150, \"A luxurious silk eye mask that blocks out light for a restful sleep. Its soft material is gentle on the skin, promoting relaxation and comfort.\"), \n(\"Bamboo Charcoal Soap\", 12.50, 200, \"This natural soap contains bamboo charcoal to detoxify and purify the skin. It cleanses deeply while leaving your skin feeling soft and refreshed.\"), \n(\"Aging Defense Cream\", 36.99, 80, \"An anti-aging cream that targets wrinkles and fine lines for a smoother appearance. Enriched with retinol and antioxidants, it revitalizes and firms the skin.\"), \n(\"Hydrating Facial Spray\", 18.99, 110, \"A hydrating facial spray that refreshes and revitalizes the skin anytime, anywhere. With rosewater and aloe, it soothes and hydrates for a dewy glow.\"), \n(\"Brightening Gel Cleanser\", 24.00, 90, \"This gel cleanser brightens and evens out skin tone while cleansing. Infused with vitamin C and botanical extracts, it leaves skin radiant and refreshed.\"), \n(\"Smoothing Lip Scrub\", 16.50, 100, \"A smoothing lip scrub that gently exfoliates and hydrates dry lips. With natural sugars and oils, it leaves lips soft and kissable.\"), \n(\"Nourishing Scalp Treatment\", 29.00, 80, \"This nourishing scalp treatment promotes healthy hair growth and soothes irritation. Enriched with essential oils, it revitalizes the scalp for optimal health.\"), \n(\"Hydrating Body Wash\", 20.00, 130, \"A hydrating body wash that cleanses while moisturizing the skin. With natural oils and extracts, it leaves skin feeling soft and refreshed.\"), \n(\"Cooling Eye Gel\", 22.50, 70, \"This cooling eye gel reduces puffiness and dark circles while hydrating the skin. Infused with cucumber and aloe, it refreshes and revitalizes tired eyes.\"), \n(\"Gentle Makeup Remover\", 15.75, 150, \"A gentle makeup remover that effectively cleanses without irritation. With soothing ingredients, it leaves your skin feeling fresh and clean.\"), \n(\"Firming Eye Cream\", 28.00, 90, \"This firming eye cream helps to reduce the appearance of fine lines and wrinkles. Enriched with peptides and antioxidants, it nourishes and revitalizes the delicate area.\"), \n(\"Hydrating Hand Sanitizer\", 11.99, 200, \"A hydrating hand sanitizer that kills germs while moisturizing the skin. With aloe vera and essential oils, it leaves hands feeling soft and clean.\"), \n(\"Nourishing Hair Conditioner\", 19.00, 130, \"A nourishing conditioner that hydrates and detangles hair for easy styling. Infused with natural oils, it leaves hair soft, shiny, and manageable.\"), \n(\"Whipped Body Cream\", 25.99, 90, \"A whipped body cream that provides intense hydration and nourishment for dry skin. With shea butter and coconut oil, it leaves skin feeling velvety smooth.\"), \n(\"Brightening Lip Balm\", 14.50, 100, \"This brightening lip balm hydrates and enhances the natural color of your lips. With vitamin E and natural oils, it keeps lips soft and supple.\"), \n(\"Moisturizing Face Cream\", 30.00, 80, \"A moisturizing face cream that hydrates and nourishes all skin types. With a blend of natural ingredients, it leaves skin feeling soft and radiant.\"), \n(\"Hydrating Overnight Cream\", 34.50, 70, \"This overnight cream deeply hydrates and repairs the skin while you sleep. Packed with antioxidants and natural oils, it promotes a youthful complexion.\"), \n(\"Exfoliating Body Wash\", 23.75, 110, \"An exfoliating body wash that cleanses and smooths the skin. With natural exfoliants and moisturizing ingredients, it leaves skin feeling refreshed and soft.\"), \n(\"Vitamin E Skin Oil\", 19.99, 150, \"A nourishing skin oil rich in vitamin E that hydrates and protects the skin. Lightweight and fast-absorbing, it leaves skin feeling soft and smooth.\"), \n(\"Hydrating Face Gel\", 27.50, 90, \"A hydrating face gel that provides intense moisture without heaviness. Infused with aloe vera and hyaluronic acid, it leaves skin plump and refreshed.\"), \n(\"Cleansing Balm\", 22.00, 100, \"A cleansing balm that melts away makeup and impurities while nourishing the skin. With natural oils and butters, it leaves skin feeling clean and hydrated.\"), \n(\"Brightening Foot Cream\", 18.00, 80, \"This brightening foot cream helps to even out skin tone and hydrate dry feet. With natural extracts, it leaves feet feeling soft and revitalized.\"), \n(\"Smoothing Body Polish\", 20.50, 90, \"This body polish gently exfoliates and smooths the skin for a radiant glow. With sugar and natural oils, it provides a luxurious spa-like experience.\"), \n(\"Revitalizing Eye Gel\", 26.99, 70, \"A revitalizing eye gel that reduces puffiness and dark circles. Enriched with caffeine and peptides, it refreshes and brightens the eye area.\"), \n(\"Hydrating Face Oil\", 30.00, 80, \"A hydrating face oil that nourishes and revitalizes the skin. With a blend of natural oils, it absorbs quickly and leaves skin glowing.\"), \n(\"Gentle Cleansing Milk\", 15.50, 130, \"A gentle cleansing milk that removes makeup and impurities without drying the skin. Infused with chamomile and aloe, it soothes and refreshes.\"), \n(\"Nourishing Lip Treatment\", 17.00, 100, \"This nourishing lip treatment hydrates and repairs dry, chapped lips. With a blend of natural oils, it leaves lips feeling soft and smooth.\"), \n(\"Moisturizing Night Mask\", 34.00, 70, \"A moisturizing night mask that provides intense hydration while you sleep. With hyaluronic acid and botanical extracts, it promotes a plump and youthful complexion.\"), \n(\"Detoxifying Face Mask\", 21.00, 90, \"A detoxifying face mask that draws out impurities and excess oil. With activated charcoal and clay, it purifies and revitalizes the skin.\"), \n(\"Nourishing Beard Oil\", 18.50, 110, \"A nourishing beard oil that softens and conditions facial hair. With natural oils, it promotes a healthy, well-groomed beard.\"), \n(\"Hydrating Gel Cleanser\", 23.99, 100, \"A hydrating gel cleanser that removes makeup and impurities while moisturizing the skin. With aloe vera and cucumber extract, it leaves skin feeling refreshed.\"), \n(\"Brightening Serum with Niacinamide\", 29.00, 80, \"This brightening serum contains niacinamide to even out skin tone and enhance radiance. Lightweight and fast-absorbing, it promotes a healthy glow.\"), \n(\"Intensive Hydration Mask\", 35.99, 70, \"An intensive hydration mask that deeply nourishes and revitalizes dry skin. With hyaluronic acid and natural oils, it restores moisture and softness.\"), \n(\"Cooling Body Gel\", 20.00, 90, \"A cooling body gel that refreshes and hydrates the skin, perfect for hot days. Infused with menthol and aloe, it soothes and revitalizes.\"), \n(\"Firming Body Oil\", 27.50, 80, \"A firming body oil that helps to improve skin elasticity and tone. Enriched with natural oils, it leaves skin feeling smooth and nourished.\"), \n(\"Nourishing Facial Scrub\", 22.50, 100, \"A nourishing facial scrub that gently exfoliates and hydrates the skin. With natural exfoliants and oils, it leaves your complexion radiant.\"), \n(\"Hydrating Overnight Lip Mask\", 14.99, 150, \"This overnight lip mask provides intense hydration and repairs dry, chapped lips while you sleep. With a blend of natural oils, it leaves lips soft and smooth.\"), \n(\"Moisturizing Face Mist\", 18.00, 130, \"A moisturizing face mist that hydrates and refreshes the skin throughout the day. With rosewater and aloe, it provides a soothing boost anytime.\"), \n(\"Exfoliating Foot Peel\", 25.00, 80, \"This exfoliating foot peel removes dead skin cells and softens rough feet. With natural fruit acids, it reveals smooth, beautiful feet.\"), \n(\"Brightening Eye Cream\", 29.99, 70, \"A brightening eye cream that reduces dark circles and puffiness. With caffeine and vitamin C, it revitalizes the delicate skin around your eyes.\"), \n(\"Hydrating Body Lotion\", 21.50, 90, \"A hydrating body lotion that nourishes and moisturizes dry skin. With shea butter and coconut oil, it leaves skin feeling soft and smooth.\"), \n(\"Gentle Exfoliating Cleanser\", 19.00, 100, \"A gentle exfoliating cleanser that removes impurities while soothing the skin. With natural exfoliants and chamomile, it leaves your complexion refreshed.\"), \n(\"Nourishing Cuticle Cream\", 17.50, 110, \"A nourishing cuticle cream that softens and hydrates dry cuticles. With vitamin E and natural oils, it promotes healthy nails and cuticles.\"), \n(\"Revitalizing Face Mask\", 24.99, 90, \"A revitalizing face mask that hydrates and brightens dull skin. With natural extracts and antioxidants, it promotes a healthy, radiant complexion.\"), \n(\"Cleansing Facial Wipes\", 12.99, 200, \"Convenient cleansing wipes that remove makeup and impurities in one step. Infused with soothing ingredients, they leave your skin feeling fresh.\"), \n(\"Moisturizing Beard Balm\", 19.99, 130, \"A moisturizing beard balm that conditions and styles facial hair. With natural oils, it keeps your beard soft, smooth, and well-groomed.\"), \n(\"Hydrating Skin Serum\", 30.00, 80, \"A hydrating skin serum that delivers intense moisture and nourishment. With hyaluronic acid and antioxidants, it promotes a plump, youthful appearance.\"), \n(\"Brightening Face Oil\", 28.00, 90, \"A brightening face oil that enhances radiance and evens out skin tone. With natural oils and vitamin C, it leaves skin glowing and revitalized.\"), \n(\"Gentle Foaming Face Wash\", 21.00, 100, \"A gentle foaming face wash that cleanses without drying the skin. With aloe and chamomile, it soothes and refreshes for a clean complexion.\"), \n(\"Hydrating Overnight Treatment\", 36.00, 70, \"An overnight treatment that deeply hydrates and repairs the skin while you sleep. With a blend of natural oils, it promotes a radiant complexion.\"), \n(\"Moisturizing Facial Cream\", 25.50, 80, \"A moisturizing facial cream that hydrates and nourishes all skin types. With natural ingredients, it leaves skin feeling soft and smooth.\"), \n(\"Revitalizing Hair Serum\", 22.00, 90, \"A revitalizing hair serum that nourishes and enhances shine. With argan oil and keratin, it leaves hair looking healthy and vibrant.\"), \n(\"Brightening Night Cream\", 34.99, 70, \"A brightening night cream that targets dark spots and uneven skin tone. With vitamin C and antioxidants, it promotes a radiant complexion.\"), \n(\"Cooling Foot Gel\", 15.00, 100, \"A cooling foot gel that refreshes and soothes tired feet. Infused with menthol and aloe, it provides relief and hydration.\"), \n(\"Firming Body Serum\", 27.00, 80, \"A firming body serum that improves skin elasticity and reduces the appearance of sagging. With natural extracts, it promotes a toned appearance.\"), \n(\"Hydrating Hair Mask\", 30.00, 75, \"A hydrating hair mask that nourishes and revitalizes dry or damaged hair. With natural oils, it restores softness and shine.\"), \n(\"Exfoliating Lip Scrub\", 16.00, 90, \"An exfoliating lip scrub that gently removes dead skin for smooth, soft lips. With natural sugars and oils, it leaves lips feeling rejuvenated.\"), \n(\"Nourishing Hand Cream\", 19.99, 100, \"A nourishing hand cream that hydrates and protects dry hands. With shea butter and vitamin E, it leaves hands feeling soft and smooth.\"), \n(\"Hydrating Face Balm\", 22.50, 80, \"A hydrating face balm that provides intense moisture and nourishment. With natural oils and extracts, it leaves skin feeling soft and supple.\"), \n(\"Brightening Cleansing Gel\", 24.00, 90, \"A brightening cleansing gel that removes impurities while enhancing radiance. With vitamin C and natural extracts, it promotes a fresh complexion.\"), \n(\"Moisturizing Lip Gloss\", 15.50, 130, \"A moisturizing lip gloss that adds shine and hydration to your lips. With natural oils and vitamins, it keeps lips looking plump and beautiful.\"), \n(\"Smoothing Body Lotion\", 21.75, 100, \"A smoothing body lotion that hydrates and softens the skin. With natural ingredients, it leaves your skin feeling silky and smooth.\"), \n(\"Gentle Exfoliating Scrub\", 19.00, 90, \"A gentle exfoliating scrub that removes dead skin cells and impurities. With natural ingredients, it promotes a brighter, smoother complexion.\"), \n(\"Revitalizing Scalp Serum\", 23.50, 80, \"A revitalizing scalp serum that promotes healthy hair growth and soothes irritation. With natural extracts, it nourishes the scalp for optimal health.\"), \n(\"Hydrating Lip Treatment\", 14.00, 100, \"A hydrating lip treatment that repairs and nourishes dry, chapped lips. With a blend of natural oils, it leaves lips feeling soft and smooth.\"), \n(\"Brightening Eye Serum\", 27.99, 70, \"A brightening eye serum that reduces dark circles and puffiness around the eyes. With vitamin C and caffeine, it revitalizes the delicate area.\"), \n(\"Moisturizing Night Cream\", 35.00, 80, \"A moisturizing night cream that hydrates and repairs the skin while you sleep. With natural oils and antioxidants, it promotes a youthful complexion.\"), \n(\"Cleansing Face Wipes\", 12.99, 200, \"Convenient cleansing face wipes that remove makeup and impurities in one step. Infused with soothing ingredients, they leave your skin feeling fresh.\"), \n(\"Hydrating Body Oil\", 25.00, 90, \"A hydrating body oil that nourishes and moisturizes the skin. With natural oils, it leaves skin feeling soft and radiant.\"), \n(\"Gentle Cleansing Gel\", 19.50, 100, \"A gentle cleansing gel that removes dirt and makeup without drying the skin. With natural extracts, it soothes and refreshes for a clean complexion.\"), \n(\"Moisturizing Face Oil\", 32.00, 80, \"A moisturizing face oil that hydrates and revitalizes the skin. With a blend of natural oils, it absorbs quickly and leaves skin glowing.\"), \n(\"Brightening Body Cream\", 28.00, 70, \"A brightening body cream that helps to even out skin tone and enhance radiance. With natural extracts, it leaves skin looking luminous.\"), \n(\"Hydrating Eye Cream\", 22.00, 90, \"A hydrating eye cream that nourishes and revitalizes the delicate eye area. With natural ingredients, it reduces puffiness and dark circles.\"), \n(\"Gentle Exfoliating Facial Wash\", 20.00, 100, \"A gentle exfoliating facial wash that cleanses and refreshes the skin. With natural exfoliants, it removes dead skin cells for a brighter complexion.\"), \n(\"Nourishing Hair Treatment\", 27.50, 80, \"A nourishing hair treatment that revitalizes and strengthens hair. With natural oils, it restores shine and softness.\"), \n(\"Hydrating Face Cream\", 30.00, 90, \"A hydrating face cream that provides intense moisture and nourishment. With natural extracts, it leaves skin feeling soft and supple.\"), \n(\"Brightening Cleansing Foam\", 21.00, 100, \"A brightening cleansing foam that removes impurities while enhancing radiance. With vitamin C and natural extracts, it promotes a fresh complexion.\"), \n(\"Moisturizing Lip Balm\", 15.00, 150, \"A moisturizing lip balm that hydrates and protects dry lips. With natural oils and vitamins, it keeps lips looking soft and smooth.\"), \n(\"Gentle Cleansing Oil\", 22.50, 80, \"A gentle cleansing oil that removes makeup and impurities without irritation. With natural oils, it leaves skin feeling clean and nourished.\"), \n(\"Revitalizing Body Scrub\", 24.99, 90, \"A revitalizing body scrub that exfoliates and smooths the skin. With natural ingredients, it promotes a radiant glow.\"), \n(\"Hydrating Overnight Mask\", 34.00, 70, \"An overnight mask that provides intense hydration and nourishment while you sleep. With natural oils and extracts, it leaves skin feeling soft and revitalized.\"), \n(\"Brightening Face Cream\", 28.00, 80, \"A brightening face cream that helps to even out skin tone and enhance radiance. With vitamin C and natural extracts, it promotes a luminous complexion.\"), \n(\"Moisturizing Body Butter\", 26.50, 90, \"A moisturizing body butter that deeply hydrates and nourishes dry skin. With shea butter and coconut oil, it leaves skin feeling soft and smooth.\"), \n(\"Gentle Exfoliating Scrub\", 19.50, 100, \"A gentle exfoliating scrub that removes dead skin cells and impurities. With natural ingredients, it promotes a brighter, smoother complexion.\"), \n(\"Nourishing Facial Oil\", 30.00, 80, \"A nourishing facial oil that revitalizes and hydrates the skin. With a blend of natural oils, it absorbs quickly and leaves skin glowing.\"), \n(\"Hydrating Eye Gel\", 22.00, 90, \"A hydrating eye gel that soothes and refreshes the delicate eye area. With cucumber and aloe, it reduces puffiness and dark circles.\"), \n(\"Brightening Body Scrub\", 21.00, 100, \"A brightening body scrub that exfoliates and revitalizes the skin. With natural extracts, it promotes a radiant complexion.\"), \n(\"Moisturizing Night Cream\", 34.50, 70, \"A moisturizing night cream that hydrates and repairs the skin while you sleep. With natural oils and antioxidants, it promotes a youthful complexion.\"), \n(\"Gentle Cleansing Foam\", 20.99, 90, \"A gentle cleansing foam that removes impurities without drying the skin. With natural extracts, it soothes and refreshes for a clean complexion.\"), \n(\"Nourishing Lip Balm\", 14.00, 150, \"A nourishing lip balm that hydrates and protects dry lips. With natural oils and vitamins, it keeps lips looking soft and smooth.\"), \n(\"Brightening Serum\", 28.99, 80, \"A brightening serum that enhances radiance and evens out skin tone. With vitamin C and natural extracts, it promotes a fresh complexion.\"), \n(\"Moisturizing Hand Cream\", 19.50, 100, \"A moisturizing hand cream that hydrates and protects dry hands. With shea butter and vitamin E, it leaves hands feeling soft and smooth.\"), \n(\"Hydrating Body Lotion\", 21.00, 90, \"A hydrating body lotion that nourishes and moisturizes dry skin. With natural ingredients, it leaves skin feeling soft and refreshed.\"), \n(\"Gentle Cleansing Gel\", 20.00, 100, \"A gentle cleansing gel that removes dirt and makeup without drying the skin. With natural extracts, it soothes and refreshes for a clean complexion.\"), \n(\"Nourishing Hair Oil\", 30.00, 80, \"A nourishing hair oil that revitalizes and enhances shine. With argan oil and vitamin E, it leaves hair looking healthy and vibrant.\"), \n(\"Brightening Night Serum\", 35.00, 70, \"A brightening night serum that targets dark spots and uneven skin tone. With vitamin C and antioxidants, it promotes a radiant complexion.\"), \n(\"Hydrating Lip Mask\", 16.50, 90, \"A hydrating lip mask that provides intense moisture and repairs dry, chapped lips. With a blend of natural oils, it leaves lips soft and smooth.\"), \n(\"Moisturizing Face Wash\", 24.00, 100, \"A moisturizing face wash that cleanses and hydrates the skin. With natural ingredients, it leaves skin feeling soft and refreshed.\"), \n(\"Brightening Foot Mask\", 19.00, 80, \"A brightening foot mask that helps to even out skin tone and hydrate dry feet. With natural extracts, it leaves feet feeling soft and revitalized.\"), \n(\"Gentle Exfoliating Face Scrub\", 22.00, 90, \"A gentle exfoliating face scrub that removes dead skin cells and impurities. With natural ingredients, it promotes a brighter, smoother complexion.\"), \n(\"Nourishing Body Oil\", 25.50, 100, \"A nourishing body oil that hydrates and softens the skin. With natural oils, it leaves skin feeling soft and radiant.\"), \n(\"Hydrating Eye Balm\", 21.00, 90, \"A hydrating eye balm that nourishes and revitalizes the delicate eye area. With natural ingredients, it reduces puffiness and dark circles.\"), \n(\"Brightening Cleansing Oil\", 27.00, 80, \"A brightening cleansing oil that removes makeup and impurities while enhancing radiance. With vitamin C and natural extracts, it promotes a fresh complexion.\"), \n(\"Moisturizing Face Serum\", 32.00, 70, \"A moisturizing face serum that provides intense hydration and nourishment. With hyaluronic acid and natural oils, it leaves skin feeling soft and plump.\"), \n(\"Revitalizing Body Lotion\", 24.99, 90, \"A revitalizing body lotion that hydrates and nourishes dry skin. With shea butter and coconut oil, it leaves skin feeling soft and smooth.\"), \n(\"Gentle Cleansing Wipes\", 12.99, 200, \"Convenient cleansing wipes that remove makeup and impurities in one step. Infused with soothing ingredients, they leave your skin feeling fresh.\"), \n(\"Hydrating Body Scrub\", 20.00, 100, \"A hydrating body scrub that exfoliates and moisturizes the skin. With natural ingredients, it leaves skin feeling soft and refreshed.\"), \n(\"Brightening Face Mask\", 28.50, 70, \"A brightening face mask that targets dullness and uneven skin tone. With vitamin C and natural extracts, it promotes a radiant complexion.\"), \n(\"Moisturizing Hair Mask\", 32.00, 80, \"A moisturizing hair mask that nourishes and revitalizes dry or damaged hair. With natural oils, it restores softness and shine.\"), \n(\"Gentle Exfoliating Body Wash\", 19.99, 90, \"A gentle exfoliating body wash that cleanses and smooths the skin. With natural ingredients, it promotes a radiant glow.\"), \n(\"Hydrating Eye Cream\", 25.00, 100, \"A hydrating eye cream that nourishes and revitalizes the delicate eye area. With natural ingredients, it reduces puffiness and dark circles.\"), \n(\"Brightening Lip Treatment\", 17.50, 90, \"A brightening lip treatment that enhances the natural color of your lips. With vitamin E and natural oils, it keeps lips looking plump and beautiful.\"), \n(\"Moisturizing Face Balm\", 30.00, 80, \"A moisturizing face balm that provides intense hydration and nourishment. With natural oils and extracts, it leaves skin feeling soft and supple.\"), \n(\"Gentle Cleansing Milk\", 22.00, 100, \"A gentle cleansing milk that removes makeup and impurities without drying the skin. Infused with chamomile and aloe, it soothes and refreshes.\")]"