"products = [\n    (\"Galaxy Watch 5\", 279.99, 30, \"The Galaxy Watch 5 combines advanced health tracking features with a sleek design. It offers a variety of customizable watch faces and fitness modes.\"),\n    (\"Apple Watch Series 8\", 399.99, 25, \"The Apple Watch Series 8 is designed for those who value health and connectivity. It includes advanced sensors for heart rate monitoring and activity tracking.\"),\n    (\"Fitbit Versa 3\", 229.99, 40, \"The Fitbit Versa 3 is a smartwatch that emphasizes fitness and wellness. With built-in GPS and a variety of exercise modes, it's perfect for active users.\"),\n    (\"Garmin Venu 2\", 399.99, 20, \"The Garmin Venu 2 features a stunning AMOLED display and comprehensive health tracking features. Its long battery life ensures you stay connected throughout the day.\"),\n    (\"Amazfit GTR 3\", 199.99, 35, \"The Amazfit GTR 3 offers a classic design with a modern twist. It boasts extensive fitness tracking capabilities and a vibrant display.\"),\n    (\"TicWatch Pro 3\", 299.99, 15, \"The TicWatch Pro 3 is equipped with dual-layer display technology for extended battery life. It offers comprehensive health monitoring and a robust performance.\"),\n    (\"Huawei Watch GT 3\", 249.99, 30, \"The Huawei Watch GT 3 combines elegance with advanced fitness tracking. It features a long-lasting battery and a variety of workout modes.\"),\n    (\"Withings Steel HR\", 189.99, 50, \"The Withings Steel HR is a hybrid smartwatch that blends traditional design with smart features. It tracks your heart rate and sleep patterns seamlessly.\"),\n    (\"Suunto 7\", 399.99, 10, \"The Suunto 7 is designed for outdoor enthusiasts, offering GPS navigation and a variety of sports modes. Its rugged design ensures durability in any environment.\"),\n    (\"Fossil Gen 5\", 249.99, 45, \"The Fossil Gen 5 smartwatch combines classic style with smart technology. It features customizable watch faces and fitness tracking capabilities.\"),\n    (\"Mobvoi TicWatch E3\", 199.99, 55, \"The Mobvoi TicWatch E3 is an affordable smartwatch with powerful features. It includes built-in GPS and a range of health tracking options.\"),\n    (\"Skagen Falster 3\", 229.99, 25, \"The Skagen Falster 3 is a stylish smartwatch with a minimalist design. It offers fitness tracking and notifications directly on your wrist.\"),\n    (\"Garmin Forerunner 245\", 349.99, 20, \"The Garmin Forerunner 245 is perfect for runners, offering advanced metrics and GPS tracking. Its lightweight design makes it comfortable for long runs.\"),\n    (\"Casio G-Shock GBD-H2000\", 299.99, 15, \"The Casio G-Shock GBD-H2000 is a rugged smartwatch built for adventure. It features advanced fitness tracking and is water-resistant up to 200 meters.\"),\n    (\"Amazfit Bip U Pro\", 69.99, 100, \"The Amazfit Bip U Pro is an affordable smartwatch with a range of health features. It includes built-in GPS and Alexa voice assistant capabilities.\"),\n    (\"Honor Watch GS Pro\", 249.99, 30, \"The Honor Watch GS Pro is designed for outdoor adventures with its rugged build and long battery life. It provides accurate tracking for various sports activities.\"),\n    (\"Samsung Galaxy Watch Active 2\", 249.99, 40, \"The Samsung Galaxy Watch Active 2 offers a sleek design and comprehensive fitness tracking. It seamlessly integrates with your smartphone for notifications and apps.\"),\n    (\"Fitbit Sense\", 299.99, 20, \"The Fitbit Sense focuses on stress management and health monitoring. It includes advanced sensors for heart rate, temperature, and more.\"),\n    (\"Polar Vantage V2\", 499.99, 10, \"The Polar Vantage V2 is a premium multisport watch designed for serious athletes. It offers advanced training features and accurate GPS tracking.\"),\n    (\"Apple Watch SE\", 279.99, 30, \"The Apple Watch SE provides essential smartwatch features at a more affordable price. It includes fitness tracking and seamless integration with Apple devices.\"),\n    (\"Garmin Instinct Solar\", 399.99, 15, \"The Garmin Instinct Solar is a rugged smartwatch with solar charging capabilities. It's built for outdoor enthusiasts with features like GPS and heart rate monitoring.\"),\n    (\"Mobvoi TicWatch Pro S\", 249.99, 25, \"The Mobvoi TicWatch Pro S offers a dual-layer display for extended battery life. It features fitness tracking and is compatible with Google Assistant.\"),\n    (\"Fossil Hybrid HR\", 199.99, 50, \"The Fossil Hybrid HR combines traditional watch aesthetics with smart capabilities. It tracks your activity and heart rate without sacrificing style.\"),\n    (\"Suunto 9 Baro\", 499.99, 5, \"The Suunto 9 Baro is designed for extreme athletes with its long battery life and rugged construction. It provides accurate GPS tracking and weather updates.\"),\n    (\"Huawei Watch Fit\", 129.99, 75, \"The Huawei Watch Fit is a lightweight smartwatch with a vibrant display. It includes various fitness modes and health tracking features.\"),\n    (\"Garmin Lily\", 249.99, 20, \"The Garmin Lily is a stylish smartwatch designed for women. It offers health tracking features and a variety of customizable watch faces.\"),\n    (\"Amazfit T-Rex Pro\", 179.99, 40, \"The Amazfit T-Rex Pro is built for durability and adventure. It includes extensive fitness tracking features and a rugged design.\"),\n    (\"Honor Band 6\", 49.99, 100, \"The Honor Band 6 is an affordable fitness tracker with smartwatch features. It offers heart rate monitoring and a large display.\"),\n    (\"Skagen Jorn Hybrid HR\", 199.99, 30, \"The Skagen Jorn Hybrid HR combines a traditional watch design with smart features. It tracks activity and delivers notifications discreetly.\"),\n    (\"Garmin Fenix 6\", 699.99, 10, \"The Garmin Fenix 6 is a premium multisport GPS watch with advanced features. It's designed for outdoor enthusiasts and serious athletes.\"),\n    (\"Apple Watch Ultra\", 799.99, 5, \"The Apple Watch Ultra is built for extreme conditions with its rugged design and advanced features. It includes enhanced GPS and health tracking capabilities.\"),\n    (\"Fitbit Charge 5\", 179.99, 50, \"The Fitbit Charge 5 is a fitness tracker with smartwatch capabilities. It features an ECG app and built-in GPS for accurate activity tracking.\"),\n    (\"Amazfit GTS 2\", 149.99, 70, \"The Amazfit GTS 2 offers a stylish design with a vibrant AMOLED display. It includes health tracking features and long battery life.\"),\n    (\"Garmin Approach S62\", 499.99, 10, \"The Garmin Approach S62 is a premium golf watch with advanced features. It provides detailed course information and GPS tracking.\"),\n    (\"Samsung Galaxy Watch 4\", 249.99, 30, \"The Samsung Galaxy Watch 4 features a sleek design and comprehensive health tracking. It integrates seamlessly with Samsung smartphones.\"),\n    (\"TicWatch C2\", 199.99, 45, \"The TicWatch C2 offers a classic design with smart features. It includes fitness tracking and customizable watch faces.\"),\n    (\"Fitbit Inspire 2\", 99.99, 60, \"The Fitbit Inspire 2 is an affordable fitness tracker with essential features. It tracks your activity and sleep patterns effectively.\"),\n    (\"Garmin Venu Sq\", 199.99, 25, \"The Garmin Venu Sq is a stylish smartwatch with fitness tracking capabilities. It features a bright display and long battery life.\"),\n    (\"Huawei Watch GT 2 Pro\", 299.99, 15, \"The Huawei Watch GT 2 Pro offers a premium design with advanced health tracking features. It includes a variety of sports modes and a long-lasting battery.\"),\n    (\"Amazfit Neo\", 39.99, 100, \"The Amazfit Neo is a retro-style smartwatch with essential features. It tracks your activity and heart rate with a simple design.\"),\n    (\"Fitbit Luxe\", 149.99, 50, \"The Fitbit Luxe is a stylish fitness tracker that combines fashion with functionality. It tracks your activity, sleep, and stress levels.\"),\n    (\"Garmin Forerunner 55\", 199.99, 30, \"The Garmin Forerunner 55 is designed for runners with its lightweight build and GPS tracking. It offers essential running features in a compact design.\"),\n    (\"Apple Watch Nike Series 7\", 399.99, 10, \"The Apple Watch Nike Series 7 is designed for athletes, featuring exclusive Nike watch faces and bands. It includes advanced fitness tracking and health monitoring.\"),\n    (\"Amazfit Bip Lite\", 59.99, 80, \"The Amazfit Bip Lite is an affordable smartwatch with essential features. It offers long battery life and basic fitness tracking.\"),\n    (\"Samsung Galaxy Fit 2\", 59.99, 90, \"The Samsung Galaxy Fit 2 is a budget-friendly fitness tracker with a vibrant display. It tracks your activity and sleep efficiently.\"),\n    (\"Garmin Instinct\", 299.99, 20, \"The Garmin Instinct is designed for outdoor enthusiasts with its rugged build and GPS capabilities. It offers extensive fitness tracking features.\"),\n    (\"TicWatch E\", 149.99, 40, \"The TicWatch E is an affordable smartwatch with a focus on fitness. It includes GPS and heart rate monitoring functionalities.\"),\n    (\"Fossil Gen 5E\", 179.99, 50, \"The Fossil Gen 5E combines style with smart technology. It offers fitness tracking and customizable watch faces.\"),\n    (\"Garmin Venu Sq Music\", 249.99, 15, \"The Garmin Venu Sq Music allows you to store music directly on your watch. It features comprehensive fitness tracking and a bright display.\"),\n    (\"Huawei Watch GT Runner\", 249.99, 20, \"The Huawei Watch GT Runner is designed for runners, offering advanced performance metrics. It includes a lightweight design and long battery life.\"),\n    (\"Apple Watch Hermès\", 1249.99, 5, \"The Apple Watch Hermès is a luxury smartwatch that combines elegance with advanced technology. It features exclusive bands and premium materials.\"),\n    (\"Fitbit Ace 3\", 79.99, 100, \"The Fitbit Ace 3 is designed for kids, encouraging them to stay active. It tracks steps and active minutes in a fun way.\"),\n    (\"Garmin Lily Classic\", 249.99, 25, \"The Garmin Lily Classic is a stylish smartwatch designed for women. It combines health tracking features with a fashionable look.\"),\n    (\"Amazfit GTS 2 Mini\", 99.99, 70, \"The Amazfit GTS 2 Mini offers a compact design with extensive health tracking features. It includes built-in GPS and Alexa support.\"),\n    (\"Samsung Galaxy Watch 3\", 399.99, 15, \"The Samsung Galaxy Watch 3 combines classic design with smart features. It offers comprehensive health tracking and a rotating bezel for navigation.\"),\n    (\"TicWatch Pro 2020\", 299.99, 10, \"The TicWatch Pro 2020 features dual-layer display technology for longer battery life. It includes advanced health tracking features and Google Assistant.\"),\n    (\"Garmin Forerunner 745\", 499.99, 10, \"The Garmin Forerunner 745 is designed for serious runners and triathletes. It offers advanced training features and GPS tracking.\"),\n    (\"Fitbit Versa Lite\", 159.99, 50, \"The Fitbit Versa Lite is an affordable smartwatch with fitness tracking features. It includes a variety of exercise modes and sleep tracking.\"),\n    (\"Amazfit Bip U\", 69.99, 100, \"The Amazfit Bip U offers a lightweight design with essential health tracking features. It includes built-in GPS and a long battery life.\"),\n    (\"Huawei Watch Fit New\", 129.99, 75, \"The Huawei Watch Fit New features a vibrant display and a variety of fitness modes. It tracks your health metrics effectively.\"),\n    (\"Garmin Approach S12\", 199.99, 30, \"The Garmin Approach S12 is a golf GPS watch that provides detailed course information. It's designed for avid golfers who want to improve their game.\"),\n    (\"Apple Watch Series 7\", 399.99, 10, \"The Apple Watch Series 7 features a larger display and faster charging. It offers comprehensive health tracking and seamless integration with Apple devices.\"),\n    (\"Fossil Gen 6\", 299.99, 20, \"The Fossil Gen 6 smartwatch combines modern technology with classic design. It features fitness tracking and customizable watch faces.\"),\n    (\"Garmin Fenix 7\", 799.99, 5, \"The Garmin Fenix 7 is a premium multisport watch with advanced features for athletes. It includes detailed maps and extensive health tracking capabilities.\"),\n    (\"Samsung Galaxy Watch 4 Classic\", 349.99, 15, \"The Samsung Galaxy Watch 4 Classic combines traditional design with smart features. It offers comprehensive health tracking and a rotating bezel for easy navigation.\"),\n    (\"TicWatch C2 Plus\", 199.99, 25, \"The TicWatch C2 Plus features a stylish design with robust smart features. It includes fitness tracking and customizable watch faces.\"),\n    (\"Amazfit GTR 2\", 149.99, 70, \"The Amazfit GTR 2 offers a classic design with a variety of health tracking features. It includes built-in GPS and a long-lasting battery.\"),\n    (\"Garmin Vivosmart 4\", 99.99, 60, \"The Garmin Vivosmart 4 is a slim fitness tracker with advanced health metrics. It tracks stress, sleep, and daily activity effectively.\"),\n    (\"Fitbit Inspire HR\", 99.99, 50, \"The Fitbit Inspire HR is a stylish fitness tracker that monitors heart rate and activity. It's perfect for users looking to stay fit and connected.\"),\n    (\"Huawei Watch GT 2e\", 199.99, 30, \"The Huawei Watch GT 2e is designed for fitness enthusiasts with its extensive tracking features. It includes a long battery life and a variety of sports modes.\"),\n    (\"Apple Watch Series 6\", 399.99, 10, \"The Apple Watch Series 6 features blood oxygen monitoring and a vibrant display. It's perfect for those who want to track their health and stay connected.\"),\n    (\"Garmin Forerunner 245 Music\", 349.99, 20, \"The Garmin Forerunner 245 Music is designed for runners who want to listen to music on the go. It includes GPS tracking and advanced training metrics.\"),\n    (\"Amazfit Neo 2\", 49.99, 100, \"The Amazfit Neo 2 is a retro-style smartwatch that tracks essential health metrics. It's lightweight and perfect for casual use.\"),\n    (\"Samsung Galaxy Watch Active\", 249.99, 25, \"The Samsung Galaxy Watch Active is designed for fitness enthusiasts with its sleek design. It offers comprehensive health tracking and workout modes.\"),\n    (\"Garmin Instinct Tactical\", 399.99, 10, \"The Garmin Instinct Tactical is built for rugged outdoor use with tactical features. It includes GPS tracking and a durable design.\"),\n    (\"Fossil Hybrid HR Collider\", 199.99, 30, \"The Fossil Hybrid HR Collider combines classic watch design with smart features. It tracks activity and delivers notifications discreetly.\"),\n    (\"TicWatch Pro 3 GPS\", 299.99, 15, \"The TicWatch Pro 3 GPS features dual-layer display technology for extended battery life. It offers comprehensive health tracking and Google Assistant.\"),\n    (\"Fitbit Charge 4\", 149.99, 50, \"The Fitbit Charge 4 is a versatile fitness tracker with built-in GPS. It offers a variety of exercise modes and health tracking features.\"),\n    (\"Apple Watch SE GPS + Cellular\", 329.99, 15, \"The Apple Watch SE GPS + Cellular allows you to stay connected without your phone. It features fitness tracking and a stylish design.\"),\n    (\"Garmin Venu 2S\", 299.99, 20, \"The Garmin Venu 2S is a stylish smartwatch with a bright display and health tracking features. It's perfect for everyday wear and fitness activities.\"),\n    (\"Amazfit Bip S\", 69.99, 100, \"The Amazfit Bip S is an affordable smartwatch with essential features. It offers long battery life and fitness tracking capabilities.\"),\n    (\"Huawei Watch GT 2 Pro ECG\", 299.99, 10, \"The Huawei Watch GT 2 Pro ECG offers advanced health monitoring features. It combines elegance with smart technology for everyday use.\"),\n    (\"Samsung Galaxy Watch 4 Classic LTE\", 399.99, 10, \"The Samsung Galaxy Watch 4 Classic LTE offers traditional design with modern features. It includes comprehensive health tracking and LTE connectivity.\"),\n    (\"Fitbit Versa 3 Special Edition\", 229.99, 25, \"The Fitbit Versa 3 Special Edition features a sleek design with premium materials. It includes advanced health tracking and built-in GPS.\"),\n    (\"Garmin Forerunner 55 Music\", 249.99, 15, \"The Garmin Forerunner 55 Music is designed for runners who want to listen to music while training. It includes GPS tracking and advanced performance metrics.\"),\n    (\"TicWatch Pro 4\", 349.99, 10, \"The TicWatch Pro 4 features advanced health tracking and dual-layer display technology. It's perfect for fitness enthusiasts and tech-savvy users.\"),\n    (\"Amazfit GTR 2e\", 149.99, 70, \"The Amazfit GTR 2e offers a classic design with extensive health tracking features. It includes built-in GPS and a long-lasting battery.\"),\n    (\"Apple Watch Series 9\", 399.99, 5, \"The Apple Watch Series 9 features enhanced health tracking and a vibrant display. It's designed for those who want to stay fit and connected.\"),\n    (\"Garmin Enduro\", 799.99, 5, \"The Garmin Enduro is built for endurance athletes with its long battery life and rugged design. It offers advanced performance metrics and GPS tracking.\"),\n    (\"Fossil Gen 6 Wellness Edition\", 299.99, 15, \"The Fossil Gen 6 Wellness Edition combines style with health-focused features. It includes fitness tracking and customizable watch faces.\"),\n    (\"Fitbit Sense Special Edition\", 299.99, 10, \"The Fitbit Sense Special Edition features advanced health monitoring and a stylish design. It includes stress management tools and built-in GPS.\"),\n    (\"TicWatch E3 Pro\", 199.99, 20, \"The TicWatch E3 Pro offers a lightweight design with robust health tracking features. It includes built-in GPS and a long battery life.\"),\n    (\"Garmin Venu 2 Music\", 299.99, 20, \"The Garmin Venu 2 Music allows you to listen to music directly from your watch. It features comprehensive health tracking and a vibrant display.\"),\n    (\"Amazfit Bip U Lite\", 49.99, 100, \"The Amazfit Bip U Lite is an entry-level smartwatch with essential features. It offers long battery life and basic fitness tracking capabilities.\"),\n    (\"Huawei Watch GT 3\", 299.99, 15, \"The Huawei Watch GT 3 features a stylish design with advanced health tracking capabilities. It includes a variety of sports modes and a long-lasting battery.\"),\n    (\"Samsung Galaxy Watch 5 Pro\", 499.99, 10, \"The Samsung Galaxy Watch 5 Pro is built for adventure with its rugged design and advanced features. It offers comprehensive health tracking and GPS capabilities.\"),\n    (\"Fossil Hybrid HR Skagen\", 199.99, 30, \"The Fossil Hybrid HR Skagen combines traditional watch aesthetics with smart features. It tracks your activity and heart rate seamlessly.\"),\n    (\"Garmin Fenix 7S\", 699.99, 5, \"The Garmin Fenix 7S is a premium multisport watch designed for serious athletes. It includes detailed maps and extensive health tracking capabilities.\"),\n    (\"TicWatch Pro 3 Ultra\", 349.99, 10, \"The TicWatch Pro 3 Ultra features dual-layer display technology for extended battery life. It offers comprehensive health tracking and Google Assistant.\")\n]"