"products = [\n    (\"Smart LED Bulb\", 19.99, 200, \"A smart LED bulb that can be controlled via your smartphone or voice assistant. It offers a wide range of colors and brightness levels to suit any mood.\"),\n    (\"Wi-Fi Smart Plug\", 24.99, 150, \"This smart plug allows you to control any device plugged into it from your phone or voice commands. Perfect for automating your home appliances.\"),\n    (\"Smart Light Strip\", 29.99, 120, \"Flexible LED light strips that can be cut to size and controlled via an app. Great for adding ambiance to any room or outdoor space.\"),\n    (\"Smart Ceiling Light\", 49.99, 80, \"A modern ceiling light that integrates with your smart home system. It features adjustable brightness and color temperature for customized lighting.\"),\n    (\"Smart Motion Sensor Light\", 34.99, 100, \"This motion sensor light turns on automatically when it detects movement. Ideal for hallways, staircases, or outdoor areas for added security.\"),\n    (\"Smart Desk Lamp\", 39.99, 90, \"A stylish desk lamp with adjustable brightness and color settings. It also features wireless charging for your devices.\"),\n    (\"Smart Outdoor Floodlight\", 59.99, 70, \"A powerful outdoor floodlight that can be controlled remotely. It includes motion detection and customizable schedules for security and convenience.\"),\n    (\"Smart Pendant Light\", 79.99, 50, \"A chic pendant light that enhances your living space with smart features. Adjust the brightness and color from your smartphone or voice assistant.\"),\n    (\"Smart Night Light\", 14.99, 250, \"A compact night light that can be programmed to turn on and off at specific times. It offers a soft glow, perfect for children's rooms.\"),\n    (\"Smart RGB Floor Lamp\", 89.99, 40, \"A tall floor lamp that can display millions of colors. Control it via an app to set the perfect mood for any occasion.\"),\n    (\"Smart Table Lamp\", 44.99, 75, \"This elegant table lamp features touch control and customizable light settings. Ideal for reading or creating a cozy atmosphere.\"),\n    (\"Smart Bathroom Mirror Light\", 59.99, 30, \"A bathroom mirror with integrated smart lighting. It provides bright, adjustable lighting for grooming and makeup application.\"),\n    (\"Smart Candle Light\", 34.99, 110, \"A realistic candle that can be controlled via an app. It flickers like a real candle, adding a warm ambiance without the worry of fire.\"),\n    (\"Smart Wall Sconce\", 49.99, 65, \"A stylish wall sconce that can be dimmed and adjusted through your smart device. Perfect for accent lighting in any room.\"),\n    (\"Smart RGB LED Panel\", 69.99, 55, \"A set of RGB LED panels that can be arranged in various designs. Control colors and patterns to create stunning light displays.\"),\n    (\"Smart Garage Light\", 39.99, 45, \"This smart light automatically turns on when you enter the garage. It can also be controlled remotely for convenience.\"),\n    (\"Smart Solar Garden Light\", 29.99, 100, \"Eco-friendly solar-powered lights that illuminate your garden at night. They charge during the day and turn on automatically at dusk.\"),\n    (\"Smart Dimmer Switch\", 34.99, 85, \"A smart dimmer switch that allows you to control the brightness of your existing lights. It integrates seamlessly with your smart home system.\"),\n    (\"Smart LED Recessed Light\", 49.99, 60, \"A recessed light that can be adjusted for brightness and color. Ideal for modern homes looking for a clean and smart lighting solution.\"),\n    (\"Smart Desk Light with USB\", 39.99, 70, \"A multifunctional desk light that includes USB charging ports. Perfect for students and professionals who need bright, adjustable lighting.\"),\n    (\"Smart RGB Light Bulb\", 19.99, 200, \"An energy-efficient RGB light bulb that can change colors and be dimmed via your smartphone. Great for parties or relaxing evenings.\"),\n    (\"Smart Home Security Light\", 54.99, 40, \"This security light has built-in motion detection and can send alerts to your phone. Ideal for enhancing the safety of your home.\"),\n    (\"Smart LED Floor Tile\", 89.99, 30, \"Interactive LED floor tiles that change colors based on movement. Perfect for gaming rooms or creative spaces.\"),\n    (\"Smart Bluetooth Speaker Light\", 49.99, 50, \"A combination of a Bluetooth speaker and smart light. Play music and control the lighting for a complete ambiance experience.\"),\n    (\"Smart Emergency Light\", 24.99, 80, \"A portable emergency light that automatically turns on during power outages. It’s rechargeable and can also be used as a flashlight.\"),\n    (\"Smart RGB Light Bulb with App Control\", 22.99, 180, \"Control this smart RGB bulb through an intuitive app. It offers multiple color options and scheduling features.\"),\n    (\"Smart LED Wall Art\", 99.99, 25, \"A unique piece of wall art that lights up and changes colors. Perfect for adding a modern touch to any room.\"),\n    (\"Smart Bluetooth Light Strip\", 39.99, 60, \"Flexible light strips that can be controlled via Bluetooth. Ideal for creating a vibrant atmosphere in your home.\"),\n    (\"Smart Wi-Fi Outdoor Light\", 54.99, 50, \"This outdoor light can be controlled from anywhere using your smartphone. It’s weather-resistant and perfect for patios or gardens.\"),\n    (\"Smart Light Switch\", 29.99, 100, \"A smart switch that allows you to control your lights remotely. It’s easy to install and compatible with most existing setups.\"),\n    (\"Smart LED Bulb with Motion Sensor\", 27.99, 150, \"An LED bulb that turns on automatically when it detects motion. Great for hallways and entryways for added convenience.\"),\n    (\"Smart RGB Table Lamp\", 39.99, 75, \"A versatile table lamp that offers a spectrum of colors and adjustable brightness. Perfect for mood lighting in any room.\"),\n    (\"Smart Light with Voice Control\", 44.99, 90, \"This smart light can be controlled using voice commands. It’s compatible with major voice assistants for easy operation.\"),\n    (\"Smart LED Strip with Music Sync\", 49.99, 60, \"Light strips that sync with your music for a dynamic lighting experience. Perfect for parties or movie nights.\"),\n    (\"Smart Touch Control Lamp\", 34.99, 85, \"A modern lamp with touch control for easy brightness adjustment. It’s perfect for bedside tables or desks.\"),\n    (\"Smart LED Outdoor String Lights\", 49.99, 50, \"Decorative string lights that can be controlled via an app. Ideal for outdoor gatherings and creating a festive atmosphere.\"),\n    (\"Smart Motion-Activated Night Light\", 19.99, 200, \"A night light that activates with motion, providing safety and convenience. Perfect for hallways and bathrooms.\"),\n    (\"Smart Color-Changing Desk Lamp\", 39.99, 70, \"A sleek desk lamp that changes colors based on your mood. It features touch controls for easy adjustments.\"),\n    (\"Smart LED Candle\", 24.99, 150, \"A battery-operated LED candle that flickers like a real candle. Safe for use in homes with children and pets.\"),\n    (\"Smart Wi-Fi Ceiling Fan Light\", 89.99, 30, \"A ceiling fan with integrated smart lighting that can be controlled via an app. Perfect for maintaining comfort and ambiance.\"),\n    (\"Smart LED Night Light with Timer\", 19.99, 220, \"A night light that can be set to turn off after a specific time. Ideal for children's rooms or as a soft glow in the hallway.\"),\n    (\"Smart RGB Wall Light\", 39.99, 80, \"A wall-mounted light that offers customizable colors and brightness. Perfect for creating a unique atmosphere in any room.\"),\n    (\"Smart Solar Pathway Lights\", 34.99, 100, \"Solar-powered lights that illuminate your pathway at night. They charge during the day and provide a welcoming glow.\"),\n    (\"Smart LED Desk Light with Clock\", 49.99, 60, \"A multifunctional desk lamp that includes a digital clock. It features adjustable brightness and color temperature.\"),\n    (\"Smart Wi-Fi Floodlight Camera\", 99.99, 20, \"A floodlight with an integrated security camera. Monitor your home through your smartphone for enhanced security.\"),\n    (\"Smart Color-Changing Floor Lamp\", 79.99, 40, \"A stylish floor lamp that can change colors to match your decor. Control it via an app for ultimate convenience.\"),\n    (\"Smart LED Light Bulb with App\", 19.99, 200, \"An energy-efficient LED bulb that can be controlled through an app. Customize brightness and colors to fit your mood.\"),\n    (\"Smart Light with Remote Control\", 34.99, 90, \"This smart light comes with a remote for easy control. Perfect for adjusting brightness without getting up.\"),\n    (\"Smart LED Plant Grow Light\", 49.99, 50, \"A specialized light designed to promote plant growth indoors. It provides the ideal spectrum of light for photosynthesis.\"),\n    (\"Smart Wi-Fi Under Cabinet Light\", 39.99, 70, \"Under-cabinet lighting that can be controlled via Wi-Fi. Perfect for kitchens and workspaces to enhance visibility.\"),\n    (\"Smart LED Wall Clock\", 29.99, 100, \"A modern wall clock that features LED lighting. It can be set to display different colors and brightness levels.\"),\n    (\"Smart RGB Night Light with App\", 24.99, 150, \"A night light that can be controlled via an app, offering multiple color options. Ideal for creating a calming atmosphere.\"),\n    (\"Smart Solar Floodlight\", 59.99, 40, \"A solar-powered floodlight that automatically turns on at night. Perfect for illuminating outdoor spaces without wiring.\"),\n    (\"Smart LED Picture Frame Light\", 34.99, 70, \"A light designed to illuminate picture frames. It enhances your decor while providing adjustable brightness.\"),\n    (\"Smart LED Mirror with Light\", 79.99, 30, \"A mirror with integrated LED lighting for perfect visibility. Ideal for grooming and makeup application.\"),\n    (\"Smart LED Aquarium Light\", 49.99, 50, \"A specialized light designed for aquariums that promotes plant growth and enhances colors of fish. It’s energy-efficient and easy to install.\"),\n    (\"Smart LED Light with Built-in Speaker\", 54.99, 40, \"A smart light that doubles as a Bluetooth speaker. Enjoy music while illuminating your space with vibrant colors.\"),\n    (\"Smart LED Strip with Remote\", 39.99, 60, \"Flexible LED strips that can be controlled with a remote. Perfect for creating dynamic lighting in any room.\"),\n    (\"Smart Motion Sensor LED Flood Light\", 49.99, 50, \"A powerful floodlight that activates with motion detection. Ideal for security purposes around your home.\"),\n    (\"Smart Wi-Fi RGB Ceiling Light\", 59.99, 30, \"A ceiling light that offers millions of colors and can be controlled via Wi-Fi. Perfect for setting the mood in any room.\"),\n    (\"Smart LED Light with Color Temperature Adjust\", 39.99, 70, \"An LED light that allows you to adjust the color temperature for different tasks. Ideal for workspaces and relaxation areas.\"),\n    (\"Smart LED Garden Light\", 29.99, 100, \"An energy-efficient garden light that can be controlled via an app. Perfect for illuminating flower beds and pathways.\"),\n    (\"Smart LED Light with Timer Function\", 34.99, 85, \"This LED light can be programmed to turn on and off at specific times. Great for automating your lighting needs.\"),\n    (\"Smart Bluetooth RGB Light Bulb\", 22.99, 180, \"An RGB light bulb that can be controlled via Bluetooth. Perfect for creating a personalized lighting experience.\"),\n    (\"Smart LED Light with Voice Activation\", 44.99, 90, \"This LED light can be turned on and off using voice commands. Compatible with major voice assistants for hands-free control.\"),\n    (\"Smart LED Pendant Light with Remote\", 79.99, 50, \"A modern pendant light that can be adjusted via remote control. Ideal for dining areas or open spaces.\"),\n    (\"Smart LED Table Light with Wireless Charging\", 49.99, 40, \"A sleek table light that includes a wireless charging pad. Perfect for desks or nightstands.\"),\n    (\"Smart LED Light Bar\", 39.99, 70, \"A versatile light bar that can be used for accent lighting. Control colors and brightness through an app.\"),\n    (\"Smart LED Lantern\", 34.99, 100, \"A portable LED lantern that can be used indoors or outdoors. It features adjustable brightness and is rechargeable.\"),\n    (\"Smart LED Downlight\", 49.99, 60, \"A recessed downlight that offers adjustable brightness and color. Perfect for modern homes and energy efficiency.\"),\n    (\"Smart LED Floodlight with App Control\", 59.99, 50, \"A floodlight that can be controlled via a smartphone app. Ideal for enhancing outdoor security and visibility.\"),\n    (\"Smart LED Night Light with Motion Sensor\", 19.99, 200, \"A night light that turns on automatically when it detects movement. Great for kids' rooms and hallways.\"),\n    (\"Smart LED Strip with Music Sync Feature\", 49.99, 60, \"These LED strips sync with your music for an exciting lighting experience. Perfect for parties or gaming setups.\"),\n    (\"Smart LED Wall Washer\", 39.99, 70, \"A wall washer that provides even illumination for walls and artworks. Ideal for creating dramatic effects in your home.\"),\n    (\"Smart LED Desk Lamp with Adjustable Arm\", 44.99, 90, \"A desk lamp with an adjustable arm for customizable lighting angles. Perfect for workspaces and reading.\"),\n    (\"Smart LED Garden Path Light\", 29.99, 100, \"A solar-powered path light that illuminates your garden pathways. It charges during the day and lights up at night.\"),\n    (\"Smart LED Ceiling Light with Remote Control\", 59.99, 30, \"A ceiling light that can be controlled with a remote for added convenience. Ideal for living rooms and bedrooms.\"),\n    (\"Smart LED Picture Light\", 34.99, 70, \"A light designed to illuminate artwork and photographs. It provides adjustable brightness for perfect display.\"),\n    (\"Smart LED Table Lamp with Color Control\", 39.99, 75, \"A stylish table lamp that allows you to choose from a variety of colors. Perfect for creating a personalized atmosphere.\"),\n    (\"Smart Wi-Fi String Lights\", 49.99, 50, \"String lights that can be controlled via Wi-Fi for easy customization. Perfect for outdoor gatherings and festive occasions.\"),\n    (\"Smart LED Ceiling Fan with Light\", 89.99, 30, \"A ceiling fan that features integrated smart lighting. Control both the fan and light through your smartphone.\"),\n    (\"Smart LED Work Light\", 39.99, 60, \"A portable work light that provides bright illumination for tasks. It’s rechargeable and perfect for outdoor or indoor use.\"),\n    (\"Smart LED Light with Built-in Alarm\", 34.99, 80, \"A smart light that doubles as an alarm clock. It features customizable colors and brightness for a personalized wake-up experience.\"),\n    (\"Smart LED Outdoor Wall Light\", 54.99, 40, \"An outdoor wall light that can be controlled via an app. Ideal for enhancing the security and aesthetics of your home.\"),\n    (\"Smart LED Aquarium Light with Timer\", 49.99, 50, \"A specialized aquarium light that promotes plant growth and includes a timer. Perfect for maintaining a healthy aquatic environment.\"),\n    (\"Smart LED Light with Color Changing Feature\", 44.99, 90, \"This LED light offers a variety of colors and can be controlled via an app. Perfect for setting the mood in any room.\"),\n    (\"Smart LED Floodlight with Motion Detection\", 59.99, 30, \"A floodlight that activates with motion detection for added security. Ideal for outdoor spaces and driveways.\"),\n    (\"Smart LED Light Bar with Remote Control\", 39.99, 70, \"A versatile light bar that can be controlled via remote for easy adjustments. Perfect for gaming or entertainment setups.\"),\n    (\"Smart LED Night Light with Adjustable Brightness\", 19.99, 200, \"A night light that offers adjustable brightness settings. Ideal for children's rooms and hallways.\")\n]"