"[(\"Ballpoint Pen\", 1.50, 200, \"A smooth-writing ballpoint pen that provides a comfortable grip. Perfect for everyday use in the office or at school.\"), \n(\"Gel Pen Set\", 10.99, 150, \"This set of gel pens offers vibrant colors and a smooth writing experience. Ideal for artists and students alike.\"), \n(\"Notebook\", 5.99, 100, \"A classic notebook with lined pages, perfect for jotting down notes or ideas. Its durable cover ensures longevity.\"), \n(\"Sticky Notes\", 3.49, 250, \"Colorful sticky notes that are great for reminders and organization. They easily stick and remove without leaving residue.\"), \n(\"Highlighter Pack\", 4.99, 75, \"A pack of bright highlighters to help you emphasize important text. Each pen features a chisel tip for versatile highlighting.\"), \n(\"Printer Paper\", 8.99, 500, \"High-quality printer paper suitable for all types of printing. It ensures clear and vibrant prints for your documents.\"), \n(\"Whiteboard Markers\", 12.99, 80, \"A set of dry-erase markers perfect for whiteboards and glass boards. The ink is easy to erase and comes in various colors.\"), \n(\"Desk Organizer\", 15.99, 30, \"Keep your desk tidy with this stylish desk organizer. It has compartments for pens, notes, and other office supplies.\"), \n(\"Stapler\", 7.49, 60, \"A reliable stapler that can handle heavy-duty stapling tasks. Its ergonomic design makes it comfortable to use.\"), \n(\"Paper Clips\", 2.99, 500, \"A box of sturdy paper clips to keep your documents organized. They come in assorted sizes for various uses.\"), \n(\"Scissors\", 4.49, 40, \"Sharp and durable scissors designed for precision cutting. Ideal for crafting, office tasks, and school projects.\"), \n(\"Ruler\", 1.99, 100, \"A clear plastic ruler that measures up to 12 inches. It's perfect for drawing straight lines and measuring lengths.\"), \n(\"Sticky Tape\", 3.99, 200, \"Transparent sticky tape that is perfect for wrapping gifts or sealing packages. It tears easily and adheres well.\"), \n(\"Pencil Case\", 6.49, 70, \"A stylish pencil case to keep your writing instruments organized. It features multiple compartments for easy storage.\"), \n(\"Erasable Colored Pencils\", 12.99, 50, \"These colored pencils are not only vibrant but also erasable, allowing for easy corrections. Great for artists and students.\"), \n(\"Clipboard\", 4.99, 40, \"A sturdy clipboard that keeps your documents secure while you write. It has a low-profile clip for easy handling.\"), \n(\"Index Cards\", 3.49, 300, \"A pack of blank index cards perfect for studying or organizing information. They are easy to write on and durable.\"), \n(\"Tape Dispenser\", 5.99, 30, \"An easy-to-use tape dispenser that keeps your tape handy. Its weighted base ensures stability during use.\"), \n(\"Whiteboard Eraser\", 2.99, 150, \"A soft whiteboard eraser that effectively removes ink without leaving marks. Lightweight and easy to handle.\"), \n(\"Bullet Journal\", 8.99, 60, \"A flexible bullet journal that allows for creative planning and note-taking. It features dotted pages for easy customization.\"), \n(\"Postage Stamps\", 10.00, 100, \"A collection of postage stamps for your mailing needs. They come in various designs and denominations.\"), \n(\"Graph Paper Pad\", 6.49, 50, \"A pad of graph paper ideal for mathematical calculations and sketches. Each page is printed with a clear grid.\"), \n(\"Calligraphy Set\", 19.99, 25, \"This calligraphy set includes pens and ink to help you create beautiful lettering. Perfect for invitations and art projects.\"), \n(\"Paper Cutter\", 15.99, 20, \"A heavy-duty paper cutter that ensures clean and precise cuts. Ideal for crafting and office use.\"), \n(\"Colored Markers\", 9.99, 80, \"A set of colorful markers that are great for drawing, coloring, and crafting. They feature a fine tip for detailed work.\"), \n(\"Magnifying Glass\", 4.99, 50, \"A handy magnifying glass that makes reading small text easier. Its lightweight design makes it portable and convenient.\"), \n(\"Desk Calendar\", 14.99, 30, \"A stylish desk calendar that helps you keep track of important dates. It features beautiful designs for each month.\"), \n(\"Graphical Sticky Notes\", 4.49, 200, \"These sticky notes come in various shapes and sizes, perfect for creative reminders. They stick securely and are easily removable.\"), \n(\"Document Holder\", 7.99, 40, \"A clear document holder that protects your important papers. It has a professional look and is great for presentations.\"), \n(\"Pencil Sharpener\", 2.49, 150, \"A compact pencil sharpener that easily sharpens standard pencils. Its easy-to-empty design makes it user-friendly.\"), \n(\"Leather Notebook\", 15.99, 50, \"A premium leather-bound notebook that adds elegance to your writing. It features high-quality paper for a smooth writing experience.\"), \n(\"Art Sketchbook\", 12.99, 30, \"This art sketchbook is perfect for artists to express their creativity. It features thick pages that prevent bleed-through.\"), \n(\"Desk Pad\", 10.99, 20, \"A large desk pad that protects your workspace while providing a smooth writing surface. It also features a calendar layout.\"), \n(\"Envelope Pack\", 5.49, 100, \"A pack of assorted envelopes for all your mailing needs. They come in various sizes and colors for versatility.\"), \n(\"Dry Erase Board\", 19.99, 15, \"A versatile dry erase board that can be used for notes, reminders, or brainstorming. It comes with markers and an eraser.\"), \n(\"Paper Shredder\", 49.99, 10, \"A compact paper shredder that securely disposes of sensitive documents. It's perfect for home or office use.\"), \n(\"Colored Construction Paper\", 7.99, 100, \"A pack of vibrant construction paper ideal for arts and crafts projects. The colors are bright and perfect for any creation.\"), \n(\"Bookmark Set\", 4.99, 50, \"A set of decorative bookmarks to keep your place in books. They feature various designs and are made of durable materials.\"), \n(\"Fountain Pen\", 14.99, 25, \"A classic fountain pen that offers a smooth writing experience. Its elegant design makes it a great gift for any writer.\"), \n(\"Clipboard with Storage\", 12.99, 20, \"This clipboard features a built-in storage compartment for paper and pens. It's perfect for on-the-go organization.\"), \n(\"Colored Pencils\", 9.49, 100, \"A set of high-quality colored pencils that blend easily for artistic projects. They come in a variety of vibrant colors.\"), \n(\"Legal Pads\", 3.99, 150, \"Legal pads with a classic yellow color and ruled lines for easy note-taking. Perfect for meetings and brainstorming sessions.\"), \n(\"Art Supplies Organizer\", 15.99, 20, \"An organizer designed specifically for art supplies, keeping everything in one place. It has compartments for easy access.\"), \n(\"Rubber Bands\", 2.99, 300, \"A bag of assorted rubber bands for various uses. They are strong and flexible, perfect for bundling items together.\"), \n(\"Notebook with Pen\", 8.49, 100, \"This notebook comes with a matching pen, making it a great set for note-taking. The pages are lined for easy writing.\"), \n(\"Washi Tape Set\", 10.99, 50, \"A collection of decorative washi tape that adds flair to your projects. They are easy to tear and reposition.\"), \n(\"Business Card Holder\", 6.49, 30, \"A sleek business card holder to keep your cards organized and accessible. It's perfect for networking events.\"), \n(\"Pencil Set\", 5.99, 100, \"A set of high-quality pencils that are perfect for writing and drawing. They come pre-sharpened for immediate use.\"), \n(\"Sticky Flags\", 3.49, 200, \"Colorful sticky flags that help you mark important pages in books or documents. They are easy to remove and reposition.\"), \n(\"Craft Scissors\", 4.99, 50, \"Specially designed craft scissors that cut through various materials with ease. They feature a comfortable grip for precision.\"), \n(\"Desk Accessories Set\", 19.99, 15, \"A complete set of desk accessories to enhance your workspace. It includes a pen holder, paper tray, and more.\"), \n(\"Notebook with Dotted Pages\", 9.99, 60, \"This notebook features dotted pages, perfect for bullet journaling or sketching. Its durable cover protects your notes.\"), \n(\"Letter Opener\", 3.99, 100, \"A sleek letter opener that makes opening mail quick and easy. Its ergonomic design ensures a comfortable grip.\"), \n(\"Paper Mache Kit\", 12.99, 20, \"A fun paper mache kit that includes everything you need to get started. Perfect for arts and crafts enthusiasts.\"), \n(\"Desk Lamp\", 29.99, 10, \"An adjustable desk lamp that provides ample light for reading or writing. Its modern design fits any workspace.\"), \n(\"Bullet Journal Stencils\", 5.49, 30, \"A set of stencils designed for bullet journaling, helping you create clean layouts. They are made of durable plastic.\"), \n(\"Craft Paper\", 7.49, 100, \"A variety pack of craft paper in different colors and textures. Perfect for scrapbooking and other creative projects.\"), \n(\"Pencil Grip\", 2.99, 150, \"An ergonomic pencil grip that helps improve writing comfort. Ideal for both children and adults.\"), \n(\"Magnets\", 4.99, 200, \"A set of colorful magnets that can be used on whiteboards or fridges. They are strong and perfect for holding notes.\"), \n(\"Ink Refills\", 5.99, 75, \"A pack of ink refills for your fountain pen or rollerball pen. Ensure your writing instrument is always ready to use.\"), \n(\"Travel Journal\", 14.99, 40, \"A travel journal designed for documenting your adventures. It features prompts and space for photos.\"), \n(\"Art Markers\", 11.99, 50, \"A set of vibrant art markers that are perfect for coloring and drawing. They are water-based and non-toxic.\"), \n(\"Clipboards with Storage\", 12.49, 30, \"These clipboards feature storage for papers and pens, making them perfect for on-the-go use. They are lightweight and durable.\"), \n(\"Notebook with Graph Pages\", 8.99, 50, \"This notebook includes graph pages for precise drawings and calculations. Its sturdy cover protects your work.\"), \n(\"Calligraphy Markers\", 9.99, 40, \"A set of calligraphy markers that allow you to create beautiful lettering easily. They come in various colors and tips.\"), \n(\"Scented Markers\", 10.49, 50, \"These scented markers add a fun twist to your coloring projects. Each color has a unique scent that enhances creativity.\"), \n(\"Mini Stapler\", 3.49, 100, \"A compact mini stapler that fits easily in your bag. It's perfect for quick stapling tasks on the go.\"), \n(\"Crafting Tools Set\", 19.99, 15, \"A comprehensive set of crafting tools for all your DIY projects. It includes scissors, glue, and more.\"), \n(\"Art Easel\", 29.99, 10, \"A portable art easel that can be adjusted for various heights. Perfect for artists working on larger canvases.\"), \n(\"Notebook with Blank Pages\", 7.99, 50, \"A notebook featuring blank pages for freeform writing and sketching. Its flexible cover makes it easy to carry.\"), \n(\"Pencil Lead Refills\", 3.49, 100, \"A pack of pencil lead refills for mechanical pencils. They ensure you always have the right lead on hand.\"), \n(\"Crafting Glue\", 4.99, 150, \"A strong crafting glue that bonds quickly and securely. Perfect for various materials, including paper, wood, and fabric.\"), \n(\"Desk Clock\", 19.99, 20, \"A stylish desk clock that adds a modern touch to your workspace. It features a clear display for easy reading.\"), \n(\"Colored Paper Clips\", 3.99, 200, \"A box of colorful paper clips that add a fun touch to your organization. They are sturdy and come in assorted colors.\"), \n(\"Art Portfolio\", 14.99, 30, \"An art portfolio designed to showcase your artwork. It features clear sleeves for easy viewing and protection.\"), \n(\"Mini Whiteboard\", 9.99, 50, \"A portable mini whiteboard that is perfect for quick notes or brainstorming. Its lightweight design makes it easy to carry.\"), \n(\"Sketching Pencils\", 8.49, 50, \"A set of sketching pencils that are ideal for artists. They range from soft to hard leads for various techniques.\"), \n(\"Paper Craft Kit\", 12.99, 20, \"A fun paper craft kit that includes everything you need to create unique paper projects. Perfect for all ages.\"), \n(\"Magnetic Whiteboard\", 29.99, 10, \"A magnetic whiteboard that offers a versatile space for notes and reminders. It comes with markers and magnets.\"), \n(\"Crafting Tape\", 5.49, 100, \"A roll of crafting tape that is perfect for scrapbooking and DIY projects. It is easy to tear and reposition.\"), \n(\"Staple Remover\", 2.49, 150, \"A handy staple remover that makes removing staples easy and mess-free. Its ergonomic design ensures comfort during use.\"), \n(\"Art Smock\", 14.99, 20, \"A protective art smock that keeps clothes clean during creative activities. It's adjustable and made of durable fabric.\"), \n(\"Mini Notebooks\", 6.99, 100, \"A set of mini notebooks that are perfect for quick notes on the go. They come in various colors and designs.\"), \n(\"Punching Tool\", 4.99, 50, \"A handy punching tool that creates clean holes in paper for easy binding. It's compact and easy to use.\"), \n(\"Desk Organizer Tray\", 8.99, 30, \"A sleek desk organizer tray that keeps your workspace clutter-free. It has compartments for pens, papers, and more.\"), \n(\"Art Stamps\", 11.99, 40, \"A set of art stamps that can be used for creative projects. They feature various designs and are easy to use.\"), \n(\"Notebook with Inspirational Quotes\", 9.99, 50, \"This notebook features inspirational quotes on each page. It's perfect for journaling and motivation.\"), \n(\"Crafting Scissors Set\", 12.99, 20, \"A set of crafting scissors designed for various cutting tasks. They come in different sizes for versatility.\"), \n(\"Binder Clips\", 3.49, 200, \"A box of sturdy binder clips that keep your documents organized. They are available in various sizes for different needs.\"), \n(\"Decorative Paper\", 7.49, 100, \"A pack of decorative paper that adds flair to your projects. It comes in various patterns and colors.\"), \n(\"Artistic Drawing Pad\", 14.99, 30, \"A high-quality drawing pad designed for artists. It features thick pages that prevent bleed-through.\"), \n(\"Watercolor Set\", 19.99, 15, \"A complete watercolor set that includes paints, brushes, and paper. Perfect for artists of all skill levels.\"), \n(\"Crafting Foam Sheets\", 8.99, 50, \"A pack of colorful foam sheets that are perfect for various crafting projects. They are easy to cut and shape.\"), \n(\"Pencil Box\", 4.99, 100, \"A durable pencil box that keeps your writing tools organized. It features a secure closure and ample space.\"), \n(\"Artistic Pens\", 10.99, 50, \"A set of artistic pens designed for detailed drawing and coloring. They are available in various colors and tip sizes.\"), \n(\"Notebook with Inspirational Artwork\", 9.99, 50, \"This notebook features beautiful artwork on the cover to inspire creativity. It's perfect for journaling or note-taking.\"), \n(\"Crafting Stickers\", 5.49, 100, \"A collection of decorative stickers that add a fun touch to your projects. They come in various themes and designs.\")]"