"[\n    (\"Classic Black Bikini\", 29.99, 150, \"This timeless black bikini offers a flattering fit and adjustable straps for comfort. Perfect for lounging by the pool or hitting the beach.\"),\n    (\"Floral Print One-Piece\", 49.99, 80, \"Brighten up your swimwear collection with this vibrant floral print one-piece. Its stylish design and supportive fit make it a summer essential.\"),\n    (\"Sporty Swim Trunks\", 34.99, 120, \"These sporty swim trunks are perfect for active days at the beach. Made from quick-drying fabric, they provide comfort and style.\"),\n    (\"High-Waisted Swim Bottoms\", 27.99, 90, \"These high-waisted swim bottoms offer a retro vibe while providing great coverage. Pair them with your favorite bikini top for a chic look.\"),\n    (\"Ribbed Tankini Set\", 39.99, 70, \"This ribbed tankini set combines comfort and style with its stretchy fabric and trendy design. Ideal for those who prefer a bit more coverage.\"),\n    (\"Neon Swim Goggles\", 15.99, 200, \"Dive into summer with these vibrant neon swim goggles. They provide a comfortable fit and clear vision underwater.\"),\n    (\"Mesh Cover-Up Dress\", 24.99, 60, \"This lightweight mesh cover-up dress is perfect for slipping on after a swim. Its breezy design makes it ideal for a day at the beach.\"),\n    (\"Stripe Pattern Swim Shorts\", 32.99, 110, \"These stripe pattern swim shorts are both stylish and functional. With a comfortable fit, they are perfect for any water activity.\"),\n    (\"Animal Print Bikini\", 33.99, 140, \"Stand out at the beach with this eye-catching animal print bikini. It features adjustable straps and a comfortable fit for all-day wear.\"),\n    (\"Swim Cap with Floral Design\", 12.99, 180, \"Keep your hair dry and stylish with this swim cap featuring a beautiful floral design. It's perfect for both training and leisure swimming.\"),\n    (\"Retro Polka Dot Swimsuit\", 45.99, 75, \"This retro polka dot swimsuit is a fun throwback to classic swimwear styles. Its flattering cut makes it a must-have for any beach outing.\"),\n    (\"Quick-Dry Beach Towel\", 19.99, 160, \"This quick-dry beach towel is perfect for drying off after a swim. Its vibrant colors and soft texture make it a beach day essential.\"),\n    (\"Mesh Swim Bag\", 14.99, 100, \"Carry your swim gear in style with this durable mesh swim bag. Its breathable design keeps your items fresh and dry.\"),\n    (\"Underwire Support Bikini\", 39.99, 85, \"This underwire support bikini provides excellent lift and comfort. It's perfect for those who want both style and support.\"),\n    (\"Eco-Friendly Swimwear\", 49.99, 50, \"Made from recycled materials, this eco-friendly swimwear is perfect for the environmentally conscious. Enjoy a stylish swim while helping the planet.\"),\n    (\"Tropical Print Board Shorts\", 29.99, 130, \"These tropical print board shorts are ideal for beach parties and summer fun. Their lightweight fabric ensures comfort all day long.\"),\n    (\"Chic Swim Skirt\", 36.99, 65, \"This chic swim skirt offers a stylish alternative to traditional swimwear. Its flared design is flattering and fun for all body types.\"),\n    (\"Rash Guard with UPF Protection\", 34.99, 90, \"This rash guard offers UPF protection for those long days in the sun. It's perfect for surfing, swimming, or any water sport.\"),\n    (\"Vintage Lace Swim Cover-Up\", 39.99, 55, \"Add a touch of elegance to your beach look with this vintage lace swim cover-up. It's lightweight and perfect for transitioning from water to sand.\"),\n    (\"Sleek Swim Jumpsuit\", 54.99, 45, \"This sleek swim jumpsuit combines fashion and function for a standout look. Perfect for both swimming and lounging by the pool.\"),\n    (\"Waterproof Phone Pouch\", 12.99, 200, \"Keep your phone safe and dry with this waterproof phone pouch. It's great for taking photos while enjoying water activities.\"),\n    (\"Swim Fins for Kids\", 19.99, 150, \"These colorful swim fins are perfect for kids learning to swim. They provide extra propulsion and fun in the water.\"),\n    (\"Bamboo Fiber Beach Mat\", 29.99, 70, \"Relax on this eco-friendly bamboo fiber beach mat, designed for comfort and durability. It's lightweight and easy to carry.\"),\n    (\"Stylish Swim Sarong\", 24.99, 80, \"This stylish swim sarong can be worn in multiple ways, making it a versatile addition to your swimwear collection. Perfect for a beach cover-up.\"),\n    (\"Neoprene Swim Vest\", 44.99, 60, \"This neoprene swim vest provides extra buoyancy for beginners. It's designed for safety while ensuring comfort in the water.\"),\n    (\"Bikini Top with Ruffles\", 28.99, 110, \"This bikini top features playful ruffles for a fun and flirty look. Perfect for mixing and matching with your favorite bottoms.\"),\n    (\"Swimwear Organizer Bag\", 19.99, 95, \"Keep your swimwear organized with this stylish swimwear organizer bag. It's perfect for travel or storing at home.\"),\n    (\"Kids' Cartoon Swim Shorts\", 22.99, 140, \"These kids' swim shorts feature fun cartoon designs that kids will love. Made from quick-drying material for all-day comfort.\"),\n    (\"Luxe Beach Wrap\", 39.99, 50, \"This luxe beach wrap is perfect for adding a touch of elegance to your beach outfit. Its soft fabric drapes beautifully.\"),\n    (\"Swim Training Fins\", 29.99, 75, \"These swim training fins help improve your technique and speed in the water. Ideal for swimmers of all levels.\"),\n    (\"Colorful Swim Cap\", 9.99, 200, \"This colorful swim cap is not only stylish but also functional. It helps keep your hair dry while you swim.\"),\n    (\"Mesh Swim Briefs\", 25.99, 85, \"These mesh swim briefs offer a comfortable fit and quick-drying fabric. Perfect for those who prefer a minimalist swimwear style.\"),\n    (\"Beach Umbrella\", 49.99, 40, \"Stay cool and protected from the sun with this stylish beach umbrella. It's easy to set up and provides ample shade.\"),\n    (\"Water Resistant Beach Backpack\", 39.99, 60, \"This water-resistant beach backpack is perfect for carrying all your essentials. Its spacious design and durable material make it a great choice.\"),\n    (\"Lightweight Swim Jacket\", 54.99, 30, \"This lightweight swim jacket is perfect for cooler days at the beach. It offers warmth without sacrificing style.\"),\n    (\"Floral Swim Leggings\", 34.99, 70, \"These floral swim leggings provide comfort and coverage for water activities. They are stylish and functional for any swimmer.\"),\n    (\"Classic Swim Briefs\", 22.99, 120, \"These classic swim briefs offer a timeless fit and comfortable design. Perfect for both competitive and leisure swimming.\"),\n    (\"Adjustable Swim Belt\", 19.99, 150, \"This adjustable swim belt is perfect for training and water workouts. It provides support and comfort during your swim sessions.\"),\n    (\"Kids' Mermaid Tail Swim Costume\", 34.99, 100, \"Transform your child into a mermaid with this fun swim costume. It's perfect for imaginative play and swimming alike.\"),\n    (\"Sun Protection Swim Shirt\", 29.99, 90, \"This sun protection swim shirt is designed to keep you safe from harmful UV rays. It's lightweight and perfect for all-day wear.\"),\n    (\"Vintage Swim Cap\", 14.99, 80, \"This vintage swim cap adds a touch of nostalgia to your swimwear collection. It's stylish and functional for any swimmer.\"),\n    (\"Reversible Bikini Set\", 39.99, 75, \"This reversible bikini set offers two stylish looks in one. Perfect for mixing and matching with your favorite swimwear.\"),\n    (\"Funky Pattern Swim Shorts\", 31.99, 110, \"These funky pattern swim shorts are sure to make a statement. Their comfortable fit makes them perfect for any beach day.\"),\n    (\"Luxury Beach Towel\", 39.99, 50, \"This luxury beach towel is made from premium materials for ultimate comfort. Its stylish design will elevate your beach experience.\"),\n    (\"Kids' Swim Vest\", 24.99, 150, \"This kids' swim vest provides extra buoyancy for young swimmers. It's designed for safety while ensuring comfort in the water.\"),\n    (\"Swimwear Storage Box\", 29.99, 60, \"Keep your swimwear organized with this stylish storage box. It's perfect for storing swimsuits and accessories.\"),\n    (\"Colorful Swimwear Set\", 35.99, 85, \"This colorful swimwear set is perfect for making a splash this summer. Its fun design and comfortable fit make it a must-have.\"),\n    (\"Stylish Swim Skimpy\", 27.99, 90, \"This stylish swim skimpy is perfect for sunbathing or swimming. Its trendy design ensures you'll stand out at the beach.\"),\n    (\"Waterproof Bluetooth Speaker\", 49.99, 40, \"Enjoy your favorite tunes at the beach with this waterproof Bluetooth speaker. It's portable and perfect for outdoor fun.\"),\n    (\"Classic Stripe Bikini\", 29.99, 150, \"This classic stripe bikini is a timeless addition to your swimwear collection. Its comfortable fit makes it perfect for all-day wear.\"),\n    (\"Beach Ball\", 14.99, 200, \"Have fun in the sun with this colorful beach ball. It's perfect for games on the sand or in the water.\"),\n    (\"Swimwear Drying Rack\", 24.99, 70, \"This swimwear drying rack is perfect for keeping your swimsuits organized and dry. Its compact design makes it easy to store.\"),\n    (\"Oversized Beach Hat\", 29.99, 60, \"Stay stylish and protected from the sun with this oversized beach hat. It's perfect for adding a touch of glamour to your beach outfit.\"),\n    (\"Cute Animal Swim Float\", 19.99, 100, \"This cute animal swim float is perfect for kids and adults alike. It's great for relaxing in the pool or at the beach.\"),\n    (\"Swimwear Care Kit\", 22.99, 80, \"This swimwear care kit includes everything you need to keep your swimwear in top condition. It's a must-have for any swimmer.\"),\n    (\"Fashionable Swim Cover-Up\", 34.99, 65, \"This fashionable swim cover-up is perfect for transitioning from the beach to the boardwalk. Its stylish design ensures you'll turn heads.\"),\n    (\"Swim Training Board\", 29.99, 75, \"This swim training board is perfect for improving your technique and building strength. It's ideal for swimmers of all levels.\"),\n    (\"Beach Cruiser Bike\", 299.99, 15, \"Enjoy leisurely rides along the beach with this stylish beach cruiser bike. Its comfortable design makes it perfect for casual outings.\"),\n    (\"Kids' Swim Mask\", 15.99, 150, \"This kids' swim mask is perfect for underwater exploration. Its adjustable straps ensure a secure fit for young swimmers.\"),\n    (\"Bamboo Beach Chair\", 69.99, 30, \"Relax in style with this eco-friendly bamboo beach chair. It's lightweight and easy to transport, perfect for beach days.\"),\n    (\"Sunflower Print Swimsuit\", 39.99, 70, \"This sunflower print swimsuit is bright and cheerful, perfect for summer days. Its comfortable fit ensures you'll feel great while swimming.\"),\n    (\"Swim Ring with Cup Holder\", 24.99, 90, \"This fun swim ring features a cup holder for your favorite beverage. Perfect for lounging in the pool or at the beach.\"),\n    (\"Beach Sandals\", 19.99, 150, \"These comfortable beach sandals are perfect for walking on the sand. Their lightweight design ensures all-day comfort.\"),\n    (\"Kids' Swim Shorts with Pockets\", 22.99, 120, \"These kids' swim shorts come with handy pockets for storing small treasures. They're perfect for beach adventures.\"),\n    (\"Stylish Swim Top\", 34.99, 80, \"This stylish swim top features a trendy design that pairs well with various bottoms. It's perfect for mixing and matching.\"),\n    (\"Lightweight Beach Blanket\", 29.99, 60, \"This lightweight beach blanket is perfect for lounging on the sand. Its compact design makes it easy to carry.\"),\n    (\"Swimwear Fashion Magazine\", 9.99, 200, \"Stay updated on the latest swimwear trends with this fashion magazine. It's packed with tips and inspiration.\"),\n    (\"Kids' Swimsuit with SPF Protection\", 34.99, 90, \"This kids' swimsuit features built-in SPF protection for safe fun in the sun. It's both stylish and practical for young swimmers.\"),\n    (\"Classic Swim Tote Bag\", 29.99, 50, \"This classic swim tote bag is perfect for carrying all your beach essentials. Its spacious design ensures you can fit everything you need.\"),\n    (\"Waterproof Picnic Blanket\", 39.99, 40, \"This waterproof picnic blanket is perfect for beach picnics. Its durable material keeps you dry while enjoying the outdoors.\"),\n    (\"Stylish Swim Bandana\", 12.99, 150, \"This stylish swim bandana adds a unique touch to your swimwear. It's perfect for keeping hair out of your face while swimming.\"),\n    (\"Kids' Swim Ring\", 15.99, 130, \"This colorful kids' swim ring is perfect for learning to float. It's designed for safety and fun in the water.\")\n]"