"products = [\n    (\"Galaxy Tab S8\", 699.99, 30, \"The Galaxy Tab S8 features a stunning 11-inch display and powerful performance. Perfect for multitasking and entertainment, it also supports the S Pen for creative tasks.\"),\n    (\"iPad Pro 12.9\", 1099.99, 25, \"The iPad Pro 12.9 offers unmatched performance with its M1 chip and a gorgeous Liquid Retina display. Ideal for professionals and creatives, it supports advanced apps and multitasking.\"),\n    (\"Fire HD 10\", 149.99, 100, \"The Fire HD 10 is an affordable tablet with a vibrant 10.1-inch display. Great for streaming, reading, and browsing, it provides excellent value for everyday use.\"),\n    (\"Microsoft Surface Go 2\", 399.99, 40, \"The Surface Go 2 is a versatile 2-in-1 tablet that combines portability with performance. With a detachable keyboard, it's perfect for work or play on the go.\"),\n    (\"Lenovo Tab P11\", 249.99, 60, \"The Lenovo Tab P11 features an 11-inch display and a powerful Snapdragon processor. It's perfect for streaming videos and enjoying your favorite content.\"),\n    (\"Samsung Galaxy Tab A7\", 229.99, 70, \"The Galaxy Tab A7 boasts a sleek design and immersive sound, making it perfect for entertainment. With a long-lasting battery, you can enjoy your favorite shows for hours.\"),\n    (\"Huawei MatePad Pro\", 499.99, 20, \"The Huawei MatePad Pro is a premium tablet with a stunning display and powerful performance. It’s designed for productivity and creativity with its M-Pencil support.\"),\n    (\"Apple iPad Mini\", 499.99, 35, \"The iPad Mini is compact yet powerful, featuring a Retina display and A15 Bionic chip. Perfect for reading, gaming, and on-the-go productivity.\"),\n    (\"Asus ZenPad 3S 10\", 299.99, 15, \"The Asus ZenPad 3S 10 offers a sleek design and high-resolution display. It’s great for watching movies and browsing the web with its powerful audio.\"),\n    (\"Lenovo Yoga Smart Tab\", 199.99, 50, \"The Lenovo Yoga Smart Tab is a versatile tablet with a built-in stand and Google Assistant. Ideal for home entertainment and smart home control.\"),\n    (\"Microsoft Surface Pro 7\", 749.99, 20, \"The Surface Pro 7 is a powerful tablet that can replace your laptop. With a detachable keyboard and a high-resolution display, it’s perfect for professionals.\"),\n    (\"Samsung Galaxy Tab S6 Lite\", 349.99, 45, \"The Galaxy Tab S6 Lite features an S Pen for drawing and note-taking. It's great for students and creatives looking for a budget-friendly option.\"),\n    (\"Apple iPad Air\", 599.99, 30, \"The iPad Air combines power and portability with its A14 Bionic chip. Perfect for creative tasks, it supports the Apple Pencil for enhanced productivity.\"),\n    (\"Amazon Fire HD 8\", 89.99, 80, \"The Fire HD 8 is a budget-friendly tablet with a vibrant display. It’s perfect for reading, watching videos, and browsing the web.\"),\n    (\"Lenovo Tab M10 Plus\", 199.99, 55, \"The Lenovo Tab M10 Plus features a sleek design and dual speakers for immersive sound. Great for family entertainment and casual browsing.\"),\n    (\"Samsung Galaxy Tab Active3\", 499.99, 10, \"The Galaxy Tab Active3 is built for durability with its rugged design. Ideal for fieldwork, it offers great performance in challenging environments.\"),\n    (\"Google Pixel Slate\", 599.99, 15, \"The Google Pixel Slate is a powerful tablet with a stunning display and Chrome OS. Perfect for productivity and entertainment with access to Google services.\"),\n    (\"Apple iPad (9th Gen)\", 329.99, 40, \"The iPad 9th Gen offers a great balance of performance and price. With a Retina display and A13 Bionic chip, it's ideal for everyday tasks.\"),\n    (\"Huawei MediaPad M5\", 399.99, 25, \"The Huawei MediaPad M5 features a vibrant display and powerful speakers. It's perfect for multimedia consumption and casual gaming.\"),\n    (\"Microsoft Surface Duo\", 1399.99, 5, \"The Surface Duo is a dual-screen device that offers a unique mobile experience. Ideal for multitasking, it combines the functionality of a tablet and a phone.\"),\n    (\"Lenovo Tab P11 Pro\", 499.99, 15, \"The Lenovo Tab P11 Pro features an OLED display and powerful speakers, making it great for movies and gaming. It also supports a stylus for creative tasks.\"),\n    (\"Samsung Galaxy Tab S7\", 649.99, 20, \"The Galaxy Tab S7 features an expansive display and Snapdragon 865+ processor. Perfect for gaming and productivity, it includes the S Pen for added functionality.\"),\n    (\"Apple iPad Pro 11\", 799.99, 10, \"The iPad Pro 11 delivers exceptional performance with its M1 chip and ProMotion display. Great for creatives, it supports advanced applications and multitasking.\"),\n    (\"Fire HD 10 Plus\", 179.99, 50, \"The Fire HD 10 Plus is an upgraded version of the Fire HD 10 with wireless charging. Ideal for streaming and browsing, it offers enhanced performance.\"),\n    (\"Samsung Galaxy Tab A 8.4\", 199.99, 60, \"The Galaxy Tab A 8.4 is a compact tablet with a bright display. Great for reading and watching videos, it’s portable and easy to carry.\"),\n    (\"Microsoft Surface Book 3\", 1599.99, 5, \"The Surface Book 3 is a high-performance laptop that can also function as a tablet. It's perfect for professionals who need power and versatility in one device.\"),\n    (\"Lenovo Smart Tab M8\", 149.99, 70, \"The Lenovo Smart Tab M8 features a compact design and built-in Google Assistant. Ideal for smart home control and entertainment on the go.\"),\n    (\"Apple iPad Air (4th Gen)\", 599.99, 20, \"The iPad Air (4th Gen) combines a stunning display with powerful performance. It's perfect for work and play, supporting the latest apps and accessories.\"),\n    (\"Samsung Galaxy Tab S6\", 649.99, 15, \"The Galaxy Tab S6 features a vibrant AMOLED display and powerful performance. Ideal for multitasking and creative work, it includes the S Pen.\"),\n    (\"Huawei MatePad 10.8\", 399.99, 25, \"The Huawei MatePad 10.8 offers a high-resolution display and powerful audio. Perfect for entertainment and productivity, it supports the M-Pencil.\"),\n    (\"Fire HD 8 Plus\", 109.99, 60, \"The Fire HD 8 Plus is a budget-friendly tablet with a vibrant display. Great for entertainment and casual use, it comes with increased RAM for better performance.\"),\n    (\"Microsoft Surface Pro X\", 999.99, 10, \"The Surface Pro X features a sleek design and an ARM processor for excellent battery life. Perfect for professionals who need a lightweight device for work.\"),\n    (\"Samsung Galaxy Tab S5e\", 399.99, 30, \"The Galaxy Tab S5e is a lightweight tablet with a stunning display and great sound. Ideal for media consumption and casual browsing.\"),\n    (\"Apple iPad Pro 12.9 (2021)\", 1099.99, 15, \"The iPad Pro 12.9 (2021) features the powerful M1 chip and an exceptional Liquid Retina display. Perfect for creatives, it supports advanced applications and multitasking.\"),\n    (\"Lenovo Tab M8 HD\", 129.99, 80, \"The Lenovo Tab M8 HD is an affordable tablet with a compact design. Great for reading and streaming, it offers solid performance for everyday tasks.\"),\n    (\"Asus ZenPad 10\", 249.99, 40, \"The Asus ZenPad 10 features a sleek design and a large display. Perfect for watching movies and browsing the web, it delivers good performance for its price.\"),\n    (\"Samsung Galaxy Tab A 10.1\", 279.99, 50, \"The Galaxy Tab A 10.1 offers a large display and great sound quality. Ideal for family entertainment, it’s perfect for watching videos and playing games.\"),\n    (\"Apple iPad (8th Gen)\", 329.99, 30, \"The iPad (8th Gen) is a versatile tablet with a powerful A12 chip. Great for everyday tasks, it supports a wide range of apps and accessories.\"),\n    (\"Huawei MatePad T10\", 199.99, 60, \"The Huawei MatePad T10 features a bright display and a sleek design. Perfect for casual use, it offers great performance for reading and browsing.\"),\n    (\"Microsoft Surface Go 3\", 399.99, 20, \"The Surface Go 3 is a lightweight tablet that combines portability with performance. Ideal for students and professionals, it supports a detachable keyboard.\"),\n    (\"Samsung Galaxy Tab S7 FE\", 549.99, 15, \"The Galaxy Tab S7 FE features a large display and powerful performance. Great for productivity and entertainment, it includes the S Pen for creativity.\"),\n    (\"Apple iPad Mini (6th Gen)\", 499.99, 25, \"The iPad Mini (6th Gen) offers a compact design with powerful performance. Perfect for reading and gaming, it supports the Apple Pencil for drawing.\"),\n    (\"Lenovo Tab K10\", 199.99, 50, \"The Lenovo Tab K10 features a large display and dual speakers for immersive sound. Ideal for family entertainment and casual browsing.\"),\n    (\"Fire HD 10 Kids Edition\", 199.99, 30, \"The Fire HD 10 Kids Edition is designed specifically for children, featuring parental controls and a kid-proof case. Perfect for educational content and entertainment.\"),\n    (\"Samsung Galaxy Tab A Kids Edition\", 129.99, 40, \"The Galaxy Tab A Kids Edition is designed for young users with a durable case and parental controls. Great for educational apps and games, it’s kid-friendly.\"),\n    (\"Microsoft Surface Laptop Go\", 699.99, 10, \"The Surface Laptop Go is a lightweight laptop that also functions as a tablet. Perfect for students, it combines portability with a high-quality display.\"),\n    (\"Apple iPad Pro 11 (2021)\", 799.99, 15, \"The iPad Pro 11 (2021) features the powerful M1 chip and a stunning display. Ideal for creatives, it supports advanced applications and multitasking.\"),\n    (\"Huawei MatePad Pro 5G\", 699.99, 5, \"The Huawei MatePad Pro 5G combines powerful performance with connectivity. Perfect for professionals on the go, it supports a stylus for creative tasks.\"),\n    (\"Samsung Galaxy Tab S4\", 499.99, 20, \"The Galaxy Tab S4 features a stunning display and powerful performance. Ideal for productivity and entertainment, it includes the S Pen for added functionality.\"),\n    (\"Lenovo Tab 4 10 Plus\", 249.99, 30, \"The Lenovo Tab 4 10 Plus offers a large display and dual speakers for immersive audio. Great for watching movies and browsing the web.\"),\n    (\"Apple iPad Air (3rd Gen)\", 499.99, 15, \"The iPad Air (3rd Gen) features a Retina display and powerful A12 chip. Perfect for everyday tasks, it offers great performance and versatility.\"),\n    (\"Samsung Galaxy Tab S2\", 399.99, 10, \"The Galaxy Tab S2 boasts a sleek design and vibrant display. Ideal for media consumption, it’s lightweight and portable for on-the-go use.\"),\n    (\"Asus ZenPad 3S 10 Z500M\", 299.99, 20, \"The Asus ZenPad 3S 10 Z500M features a premium design and high-resolution display. Perfect for entertainment and productivity, it delivers solid performance.\"),\n    (\"Fire HD 10 Plus Kids Edition\", 219.99, 25, \"The Fire HD 10 Plus Kids Edition is designed for children with robust parental controls. Ideal for educational apps and entertainment, it comes with a kid-proof case.\"),\n    (\"Microsoft Surface Pro 6\", 899.99, 10, \"The Surface Pro 6 combines the power of a laptop with the portability of a tablet. Perfect for professionals, it features a high-resolution display and detachable keyboard.\"),\n    (\"Apple iPad Pro 10.5\", 649.99, 15, \"The iPad Pro 10.5 offers excellent performance and a stunning display. Great for creatives, it supports the Apple Pencil for drawing and note-taking.\"),\n    (\"Samsung Galaxy Tab A 7.0\", 149.99, 60, \"The Galaxy Tab A 7.0 is a compact and affordable tablet. Perfect for reading and casual browsing, it’s easy to carry and use on the go.\"),\n    (\"Lenovo Tab M10 FHD Plus\", 199.99, 50, \"The Lenovo Tab M10 FHD Plus features a full HD display and dual speakers. Ideal for streaming videos and casual gaming, it offers solid performance.\"),\n    (\"Huawei MatePad 11\", 399.99, 25, \"The Huawei MatePad 11 features a high-resolution display and powerful audio. Perfect for entertainment and productivity, it supports a stylus for creative tasks.\"),\n    (\"Fire HD 8 Kids Edition\", 139.99, 40, \"The Fire HD 8 Kids Edition is designed for children with parental controls and a kid-proof case. Great for educational content and entertainment.\"),\n    (\"Samsung Galaxy Tab S4 10.5\", 499.99, 10, \"The Galaxy Tab S4 10.5 features a stunning display and powerful performance. Ideal for productivity and entertainment, it includes the S Pen for creativity.\"),\n    (\"Apple iPad (7th Gen)\", 329.99, 30, \"The iPad (7th Gen) offers a great balance of performance and price. With a Retina display and A10 Fusion chip, it's ideal for everyday tasks.\"),\n    (\"Microsoft Surface Pro 5\", 799.99, 10, \"The Surface Pro 5 is a powerful tablet that can replace your laptop. With a detachable keyboard and a high-resolution display, it’s perfect for professionals.\"),\n    (\"Lenovo Tab P11 Plus\", 299.99, 20, \"The Lenovo Tab P11 Plus features a large display and Dolby Atmos speakers. Ideal for streaming and gaming, it provides an immersive experience.\"),\n    (\"Samsung Galaxy Tab S6 Lite 2022\", 349.99, 15, \"The Galaxy Tab S6 Lite 2022 offers a sleek design and S Pen support. Perfect for students and creatives, it delivers good performance for its price.\"),\n    (\"Apple iPad Pro 11 (2020)\", 799.99, 15, \"The iPad Pro 11 (2020) combines powerful performance with a stunning display. Great for creatives, it supports advanced applications and multitasking.\"),\n    (\"Huawei MatePad T10s\", 249.99, 30, \"The Huawei MatePad T10s features a bright display and a sleek design. Perfect for casual use, it offers great performance for reading and browsing.\"),\n    (\"Amazon Fire HD 10 (2021)\", 149.99, 50, \"The Fire HD 10 (2021) is an affordable tablet with a vibrant display. Great for streaming and browsing, it provides excellent value for everyday use.\"),\n    (\"Microsoft Surface Laptop Studio\", 1599.99, 5, \"The Surface Laptop Studio is designed for creatives with its versatile design and powerful hardware. Perfect for graphic design, video editing, and more.\"),\n    (\"Lenovo Tab M10 HD\", 149.99, 60, \"The Lenovo Tab M10 HD offers a large display and solid performance. Ideal for family entertainment, it’s great for streaming and casual browsing.\"),\n    (\"Samsung Galaxy Tab S5e 2022\", 399.99, 20, \"The Galaxy Tab S5e 2022 features a sleek design and immersive sound. Ideal for entertainment and productivity, it includes the S Pen for creativity.\"),\n    (\"Apple iPad Mini (5th Gen)\", 399.99, 25, \"The iPad Mini (5th Gen) offers a compact design with powerful performance. Perfect for reading and gaming, it supports the Apple Pencil for drawing.\"),\n    (\"Fire HD 10 Plus (2022)\", 179.99, 50, \"The Fire HD 10 Plus (2022) is an upgraded version of the Fire HD 10 with wireless charging. Ideal for streaming and browsing, it offers enhanced performance.\"),\n    (\"Samsung Galaxy Tab A 8.0 (2019)\", 149.99, 40, \"The Galaxy Tab A 8.0 (2019) is a compact tablet with a bright display. Great for reading and watching videos, it’s portable and easy to carry.\"),\n    (\"Microsoft Surface Go 2 (2022)\", 399.99, 20, \"The Surface Go 2 (2022) is a versatile 2-in-1 tablet that combines portability with performance. With a detachable keyboard, it's perfect for work or play on the go.\"),\n    (\"Huawei MatePad Pro 12.6\", 699.99, 5, \"The Huawei MatePad Pro 12.6 features a stunning display and powerful performance. Perfect for professionals on the go, it supports a stylus for creative tasks.\"),\n    (\"Apple iPad Air (5th Gen)\", 599.99, 15, \"The iPad Air (5th Gen) combines a stunning display with powerful performance. It's perfect for work and play, supporting the latest apps and accessories.\"),\n    (\"Lenovo Tab P11 5G\", 499.99, 10, \"The Lenovo Tab P11 5G features a high-resolution display and powerful audio. Perfect for entertainment and productivity, it supports a stylus for creative tasks.\"),\n    (\"Samsung Galaxy Tab S7 FE 5G\", 649.99, 5, \"The Galaxy Tab S7 FE 5G features a large display and powerful performance. Great for productivity and entertainment, it includes the S Pen for creativity.\"),\n    (\"Apple iPad Pro 12.9 (2022)\", 1099.99, 10, \"The iPad Pro 12.9 (2022) delivers exceptional performance with its M1 chip and ProMotion display. Ideal for creatives, it supports advanced applications and multitasking.\"),\n    (\"Microsoft Surface Pro 8\", 1099.99, 5, \"The Surface Pro 8 features a sleek design and powerful performance. Perfect for professionals, it combines the portability of a tablet with the functionality of a laptop.\"),\n    (\"Samsung Galaxy Tab A7 Lite\", 159.99, 30, \"The Galaxy Tab A7 Lite is an affordable tablet with a vibrant display. Great for reading, watching videos, and browsing, it provides excellent value for everyday use.\"),\n    (\"Lenovo Smart Tab P10\", 299.99, 20, \"The Lenovo Smart Tab P10 features a large display and powerful audio. Ideal for entertainment and casual browsing, it offers solid performance.\"),\n    (\"Apple iPad 10.2 (2021)\", 329.99, 30, \"The iPad 10.2 (2021) offers a great balance of performance and price. With a Retina display and A13 Bionic chip, it's ideal for everyday tasks.\"),\n    (\"Amazon Fire HD 10 Kids Edition (2022)\", 199.99, 25, \"The Fire HD 10 Kids Edition (2022) is designed specifically for children, featuring parental controls and a kid-proof case. Perfect for educational content and entertainment.\"),\n    (\"Samsung Galaxy Tab S6 Lite 2022\", 349.99, 15, \"The Galaxy Tab S6 Lite 2022 offers a sleek design and S Pen support. Perfect for students and creatives, it delivers good performance for its price.\"),\n    (\"Huawei MatePad 10.4\", 299.99, 25, \"The Huawei MatePad 10.4 features a bright display and a sleek design. Perfect for casual use, it offers great performance for reading and browsing.\"),\n    (\"Microsoft Surface Pro X (2022)\", 999.99, 5, \"The Surface Pro X (2022) features a sleek design and an ARM processor for excellent battery life. Perfect for professionals who need a lightweight device for work.\"),\n    (\"Apple iPad Air (2022)\", 599.99, 15, \"The iPad Air (2022) combines a stunning display with powerful performance. It's perfect for work and play, supporting the latest apps and accessories.\"),\n    (\"Lenovo Tab M10 Plus (2022)\", 199.99, 50, \"The Lenovo Tab M10 Plus (2022) features a large display and Dolby Atmos speakers. Ideal for streaming and gaming, it provides an immersive experience.\"),\n    (\"Samsung Galaxy Tab S8 Ultra\", 1199.99, 5, \"The Galaxy Tab S8 Ultra features a massive display and top-tier performance. Perfect for multitasking and creative work, it includes the S Pen for added functionality.\"),\n    (\"Apple iPad Mini (6th Gen) 2022\", 499.99, 10, \"The iPad Mini (6th Gen) 2022 offers a compact design with powerful performance. Perfect for reading and gaming, it supports the Apple Pencil for drawing.\"),\n    (\"Microsoft Surface Go 3 (2022)\", 399.99, 20, \"The Surface Go 3 (2022) is a versatile 2-in-1 tablet that combines portability with performance. With a detachable keyboard, it's perfect for work or play on the go.\"),\n    (\"Samsung Galaxy Tab A8\", 229.99, 40, \"The Galaxy Tab A8 features a large display and great sound quality. Ideal for family entertainment, it’s perfect for watching videos and playing games.\"),\n    (\"Lenovo Yoga Tab 11\", 299.99, 15, \"The Lenovo Yoga Tab 11 features a unique design with a built-in stand. Ideal for streaming and browsing, it provides an immersive experience.\"),\n    (\"Apple iPad Pro 11 (2023)\", 899.99, 5, \"The iPad Pro 11 (2023) combines powerful performance with a stunning display. Great for creatives, it supports advanced applications and multitasking.\"),\n    (\"Huawei MatePad 11 (2023)\", 399.99, 10, \"The Huawei MatePad 11 (2023) features a high-resolution display and powerful audio. Perfect for entertainment and productivity, it supports a stylus for creative tasks.\"),\n    (\"Amazon Fire HD 10 Plus (2023)\", 179.99, 30, \"The Fire HD 10 Plus (2023) is an upgraded version of the Fire HD 10 with wireless charging. Ideal for streaming and browsing, it offers enhanced performance.\"),\n    (\"Microsoft Surface Pro 9\", 1099.99, 5, \"The Surface Pro 9 features a sleek design and powerful performance. Perfect for professionals, it combines the portability of a tablet with the functionality of a laptop.\"),\n    (\"Samsung Galaxy Tab S9\", 999.99, 5, \"The Galaxy Tab S9 features a stunning display and top-tier performance. Perfect for multitasking and creative work, it includes the S Pen for added functionality.\"),\n    (\"Lenovo Tab P12 Pro\", 699.99, 5, \"The Lenovo Tab P12 Pro features a large display and powerful audio. Perfect for entertainment and productivity, it supports a stylus for creative tasks.\"),\n    (\"Apple iPad Air (2023)\", 599.99, 10, \"The iPad Air (2023) combines a stunning display with powerful performance. It's perfect for work and play, supporting the latest apps and accessories.\")\n]"