"[(\"Acrylic Paint Set\", 29.99, 100, \"This acrylic paint set includes 24 vibrant colors that blend easily. Perfect for artists of all levels looking to create stunning masterpieces.\"), \n(\"Watercolor Paints\", 19.99, 80, \"A set of 36 watercolor paints with rich pigments for smooth application. Ideal for both beginners and professional artists.\"), \n(\"Sketchbook\", 12.99, 150, \"This sketchbook features 100 pages of high-quality, acid-free paper. Perfect for sketching, drawing, and capturing your artistic ideas.\"), \n(\"Charcoal Pencils\", 9.99, 200, \"A set of 6 charcoal pencils that provide a rich, dark line for expressive drawings. Great for shading and blending techniques.\"), \n(\"Pastel Set\", 24.99, 75, \"This pastel set includes 48 soft pastels in a variety of colors. Ideal for creating vibrant and textured artwork.\"), \n(\"Canvas Panels\", 34.99, 60, \"Pack of 10 canvas panels, perfect for oil or acrylic painting. Sturdy and ready to use for your next art project.\"), \n(\"Paint Brushes\", 16.99, 120, \"A set of 12 assorted paint brushes for different techniques and effects. Suitable for acrylic, watercolor, and oil painting.\"), \n(\"Easel\", 49.99, 30, \"A sturdy, adjustable easel for artists of all levels. Perfect for holding your canvas while you create.\"), \n(\"Palette Knives\", 14.99, 50, \"Set of 5 palette knives for mixing and applying paint. Great for creating unique textures and effects.\"), \n(\"Oil Paint Set\", 39.99, 40, \"This oil paint set contains 24 rich colors that blend beautifully. Ideal for experienced artists and beginners alike.\"), \n(\"Drawing Pencils\", 10.99, 90, \"A complete set of 12 drawing pencils ranging from soft to hard. Perfect for sketching, shading, and detailed work.\"), \n(\"Coloring Markers\", 15.99, 70, \"A set of 36 vibrant coloring markers with fine tips for detailed work. Perfect for coloring books and artistic projects.\"), \n(\"Fabric Paints\", 22.99, 55, \"This fabric paint set includes 10 colors that are permanent and washable. Ideal for customizing clothing and fabric crafts.\"), \n(\"Spray Paint\", 8.99, 150, \"A can of high-quality spray paint in a bright color. Perfect for graffiti, arts and crafts, and DIY projects.\"), \n(\"Glitter Set\", 11.99, 100, \"A set of 12 glitter jars in various colors to add sparkle to your projects. Great for scrapbooking, card making, and more.\"), \n(\"Modeling Clay\", 25.99, 40, \"This modeling clay set includes 24 vibrant colors that are easy to mold. Perfect for sculpting and creative projects.\"), \n(\"Artistic Stencils\", 18.99, 85, \"A set of 10 reusable stencils for adding intricate designs to your artwork. Great for scrapbooking and mixed media.\"), \n(\"Paint Roller Set\", 27.99, 30, \"This paint roller set includes various sizes for different applications. Ideal for covering large areas quickly and evenly.\"), \n(\"Calligraphy Set\", 32.99, 25, \"A complete calligraphy set with pens, ink, and practice sheets. Perfect for beginners and experienced calligraphers.\"), \n(\"Chalk Pastels\", 21.99, 65, \"This set of 48 chalk pastels offers a soft, blendable texture for vibrant artwork. Ideal for drawing and mixed media.\"), \n(\"Art Apron\", 19.99, 50, \"A durable art apron to protect your clothes while you create. Features pockets for holding tools and supplies.\"), \n(\"Watercolor Brushes\", 17.99, 45, \"A set of 6 watercolor brushes designed for smooth application. Perfect for detailed work and blending colors.\"), \n(\"Mixed Media Paper\", 14.99, 90, \"This mixed media paper is perfect for a variety of art techniques. Acid-free and durable for long-lasting projects.\"), \n(\"Oil Pastels\", 23.99, 55, \"A set of 48 oil pastels that provide rich, vibrant colors. Ideal for blending and layering techniques.\"), \n(\"Art Portfolio\", 29.99, 30, \"An art portfolio to store and protect your artwork. Features a durable cover and multiple sleeves for organization.\"), \n(\"Sculpting Tools\", 15.99, 40, \"A set of 10 sculpting tools for adding detail to clay projects. Perfect for both beginners and experienced sculptors.\"), \n(\"Color Wheel\", 9.99, 100, \"A color wheel to help artists understand color relationships. Essential for mixing and creating harmonious palettes.\"), \n(\"Canvas Tote Bag\", 12.99, 80, \"A sturdy canvas tote bag for carrying art supplies. Features a spacious interior and comfortable straps.\"), \n(\"Artistic Tape\", 8.99, 150, \"A roll of washi tape for decorative purposes. Perfect for scrapbooking, journaling, and adding flair to your projects.\"), \n(\"Graphite Pencils\", 11.99, 90, \"A set of 10 graphite pencils in various hardnesses. Ideal for sketching, shading, and detailed drawings.\"), \n(\"Painting Knife\", 12.99, 70, \"A versatile painting knife for mixing and applying paint. Great for creating texture and unique effects.\"), \n(\"Chalkboard Paint\", 18.99, 30, \"A can of chalkboard paint that turns any surface into a writable board. Perfect for creative projects and home decor.\"), \n(\"Art Stickers\", 9.99, 100, \"A collection of fun art-themed stickers for decorating your projects. Great for scrapbooking and personalizing items.\"), \n(\"Palette\", 7.99, 150, \"A traditional wooden palette for mixing paints. Essential for any painter looking to create their best work.\"), \n(\"Embossing Tools\", 15.99, 45, \"A set of embossing tools for adding texture and dimension to your projects. Perfect for card making and scrapbooking.\"), \n(\"Paint Marker Set\", 19.99, 60, \"This paint marker set includes 12 vibrant colors for various surfaces. Ideal for detailed artwork and crafts.\"), \n(\"Artistic Ruler\", 5.99, 200, \"A clear ruler with artistic measurements for precise drawing. Perfect for creating straight lines and angles.\"), \n(\"Stretched Canvas\", 34.99, 50, \"A pack of 5 pre-stretched canvases ready for your next masterpiece. Ideal for oil and acrylic painting.\"), \n(\"Stamping Supplies\", 22.99, 35, \"A set of stamping supplies including ink pads and various stamps. Great for card making and creative projects.\"), \n(\"Brush Cleaner\", 8.99, 100, \"A gentle brush cleaner to keep your brushes in top condition. Essential for maintaining the lifespan of your tools.\"), \n(\"Artistic Glues\", 10.99, 80, \"A set of glues for various crafting needs, including fabric, paper, and more. Perfect for all your art projects.\"), \n(\"Felt Tip Pens\", 14.99, 60, \"A set of 24 felt tip pens in vibrant colors for drawing and coloring. Ideal for art projects and schoolwork.\"), \n(\"Art Journal\", 19.99, 50, \"An art journal with thick, textured pages for sketching and painting. Perfect for capturing your creative ideas.\"), \n(\"Origami Paper\", 9.99, 100, \"A pack of colorful origami paper for creating beautiful designs. Great for beginners and experienced folders alike.\"), \n(\"Collage Materials\", 12.99, 70, \"A collection of various collage materials including papers and embellishments. Perfect for mixed media projects.\"), \n(\"Fabric Markers\", 16.99, 40, \"A set of fabric markers in 10 colors for customizing clothing and textiles. Permanent and washable for long-lasting designs.\"), \n(\"Artistic Stamps\", 11.99, 90, \"A set of 20 artistic stamps for adding unique designs to your projects. Great for scrapbooking and card making.\"), \n(\"Modeling Tools\", 14.99, 60, \"A set of modeling tools for sculpting and shaping clay. Essential for any serious sculptor.\"), \n(\"Artistic Guides\", 9.99, 100, \"A collection of artistic guides covering various techniques and styles. Perfect for artists looking to improve their skills.\"), \n(\"Chalk Pastel Paper\", 12.99, 45, \"Specially designed paper for chalk pastels with a textured surface. Ideal for blending and creating vibrant artwork.\"), \n(\"Artistic Clamps\", 15.99, 30, \"A set of 4 artistic clamps to hold your projects in place. Great for mixed media and crafting.\"), \n(\"Watercolor Pencils\", 19.99, 50, \"A set of 24 watercolor pencils that can be used dry or wet. Perfect for detailed artwork and blending.\"), \n(\"Artistic Scissors\", 8.99, 100, \"A pair of high-quality scissors designed for precision cutting. Ideal for all your crafting needs.\"), \n(\"Canvas Tote\", 24.99, 40, \"A stylish canvas tote for carrying your art supplies. Spacious and durable for everyday use.\"), \n(\"Artistic Charcoal\", 9.99, 80, \"A set of compressed charcoal sticks for rich, dark lines. Perfect for sketching and drawing.\"), \n(\"Decorative Paper\", 11.99, 70, \"A collection of decorative papers for scrapbooking and crafts. Ideal for adding flair to your projects.\"), \n(\"Artistic Ribbons\", 14.99, 50, \"A set of colorful ribbons for embellishing your artwork and crafts. Perfect for gift wrapping and decorating.\"), \n(\"Paint Mixing Set\", 12.99, 90, \"A set of paint mixing tools for achieving the perfect color. Essential for any painter.\"), \n(\"Artistic Stencils\", 10.99, 100, \"A collection of artistic stencils for adding designs to your projects. Great for scrapbooking and card making.\"), \n(\"Sculpting Clay\", 22.99, 40, \"A high-quality sculpting clay that is easy to mold and shape. Perfect for creating detailed sculptures.\"), \n(\"Artistic Markers\", 19.99, 60, \"A set of 24 artistic markers with fine tips for detailed work. Ideal for drawing and coloring.\"), \n(\"Painting Smock\", 15.99, 30, \"A protective painting smock for kids and adults alike. Keeps clothes clean while you create.\"), \n(\"Artistic Brushes\", 16.99, 50, \"A set of 10 artistic brushes for various painting techniques. Perfect for acrylics, oils, and watercolors.\"), \n(\"Artistic Stamps\", 11.99, 90, \"A collection of artistic stamps for adding unique designs to your projects. Great for scrapbooking and card making.\"), \n(\"Foam Brushes\", 9.99, 100, \"A set of foam brushes for smooth application of paint. Ideal for craft projects and home decor.\"), \n(\"Artistic Glaze\", 14.99, 45, \"A high-quality glaze for adding shine and protection to your artwork. Perfect for finishing touches.\"), \n(\"Artistic Sponges\", 8.99, 150, \"A set of sponges for applying paint and creating textures. Great for various painting techniques.\"), \n(\"Coloring Book\", 12.99, 80, \"A beautiful coloring book filled with intricate designs. Perfect for relaxation and creativity.\"), \n(\"Artistic Tools\", 10.99, 100, \"A versatile set of artistic tools for various crafting needs. Essential for any artist's toolkit.\"), \n(\"Watercolor Paper\", 14.99, 70, \"High-quality watercolor paper designed for optimal paint absorption. Perfect for watercolor artists.\"), \n(\"Artistic Pencils\", 9.99, 100, \"A set of colored pencils for vibrant and detailed artwork. Ideal for drawing and coloring.\"), \n(\"Mixed Media Set\", 24.99, 30, \"A comprehensive mixed media set that includes various supplies for creative projects. Great for artists of all levels.\"), \n(\"Artistic Templates\", 12.99, 50, \"A collection of artistic templates for creating precise designs. Perfect for drawing and crafting.\"), \n(\"Artistic Paint\", 19.99, 40, \"A bottle of high-quality paint in a vibrant color. Ideal for all your artistic needs.\"), \n(\"Artistic Clips\", 8.99, 100, \"A set of clips for holding your artwork in place while you work. Essential for any artist.\"), \n(\"Artistic Notebooks\", 14.99, 80, \"A set of artistic notebooks for jotting down ideas and sketches. Perfect for artists on the go.\"), \n(\"Artistic Stencils\", 10.99, 90, \"A collection of stencils for adding unique designs to your projects. Great for scrapbooking and card making.\"), \n(\"Artistic Tape\", 5.99, 200, \"A roll of decorative tape for adding flair to your projects. Perfect for scrapbooking and crafting.\")]"