"[(\"Condenser Microphone\", 129.99, 30, \"A high-quality condenser microphone designed for studio recording. It captures vocals and instruments with exceptional clarity and warmth.\"), \n(\"Dynamic Microphone\", 99.99, 40, \"This dynamic microphone is perfect for live performances and studio recordings. It offers durability and excellent sound reproduction.\"), \n(\"Audio Interface\", 199.99, 25, \"An audio interface that connects your instruments and microphones to your computer. It features high-definition audio conversion for professional results.\"), \n(\"Studio Headphones\", 89.99, 50, \"These studio headphones provide accurate sound reproduction for mixing and mastering. They are comfortable for long sessions and have excellent noise isolation.\"), \n(\"Portable Recorder\", 249.99, 15, \"A compact portable recorder that captures high-quality audio on the go. It features built-in microphones and easy-to-use controls.\"), \n(\"Pop Filter\", 29.99, 70, \"A pop filter designed to reduce plosive sounds when recording vocals. It helps achieve cleaner recordings without distortion.\"), \n(\"Microphone Stand\", 39.99, 60, \"A sturdy microphone stand that provides stability and flexibility during recordings. It is adjustable to suit various recording setups.\"), \n(\"Mixer\", 499.99, 10, \"A professional audio mixer with multiple channels for live sound and studio use. It offers a range of effects and EQ options for enhanced sound control.\"), \n(\"Shock Mount\", 49.99, 45, \"This shock mount helps isolate your microphone from vibrations and handling noise. It ensures clean audio capture in any environment.\"), \n(\"Studio Monitors\", 349.99, 20, \"High-fidelity studio monitors designed for accurate sound reproduction. They are essential for mixing and mastering your audio projects.\"), \n(\"USB Microphone\", 89.99, 55, \"A USB microphone that connects directly to your computer for easy recording. It delivers professional-quality audio without the need for additional equipment.\"), \n(\"Acoustic Panels\", 199.99, 12, \"Acoustic panels designed to reduce sound reflections and improve recording quality. They are perfect for home studios and professional environments.\"), \n(\"Field Recorder\", 299.99, 8, \"A versatile field recorder that captures high-quality audio in various environments. It features multiple input options and long battery life.\"), \n(\"MIDI Controller\", 129.99, 35, \"A MIDI controller that allows you to create and control music software with ease. It features velocity-sensitive keys and customizable controls.\"), \n(\"Soundproofing Foam\", 79.99, 25, \"Soundproofing foam designed to absorb sound waves and reduce echo. Ideal for treating recording spaces for better audio quality.\"), \n(\"Drum Machine\", 199.99, 18, \"A drum machine that offers a wide range of sounds and rhythms for music production. It features intuitive controls for easy programming.\"), \n(\"Guitar Interface\", 149.99, 28, \"An interface that connects your guitar to your computer for recording. It provides high-quality sound and low latency for seamless performance.\"), \n(\"Reverb Pedal\", 89.99, 22, \"A reverb pedal that adds depth and ambiance to your guitar sound. It features multiple reverb types and easy-to-use controls.\"), \n(\"Studio Microphone\", 249.99, 14, \"A premium studio microphone ideal for vocals and instruments. It delivers rich, detailed sound with low self-noise.\"), \n(\"DJ Controller\", 299.99, 10, \"A DJ controller that integrates seamlessly with your software for live performances. It features jog wheels, faders, and performance pads.\"), \n(\"Headphone Amplifier\", 99.99, 30, \"A headphone amplifier that boosts the audio signal for better sound quality. It is perfect for use with high-impedance headphones.\"), \n(\"Wireless Microphone System\", 499.99, 5, \"A professional wireless microphone system that provides freedom of movement during performances. It features reliable transmission and excellent sound quality.\"), \n(\"Cables and Adapters Kit\", 39.99, 50, \"A comprehensive kit of cables and adapters for all your audio needs. It includes various lengths and types for versatile connectivity.\"), \n(\"Singing Machine Karaoke\", 149.99, 15, \"A portable karaoke machine that brings the party to life. It features built-in speakers and a variety of pre-loaded songs.\"), \n(\"Digital Audio Workstation Software\", 199.99, 20, \"A powerful digital audio workstation software for music production. It offers a range of tools for recording, editing, and mixing audio.\"), \n(\"External Hard Drive\", 129.99, 25, \"An external hard drive that provides ample storage for your audio projects. It features fast transfer speeds and reliable performance.\"), \n(\"Voice Recorder\", 59.99, 40, \"A compact voice recorder for capturing lectures, meetings, and interviews. It features easy-to-use controls and long battery life.\"), \n(\"Guitar Effects Pedal\", 99.99, 30, \"A versatile guitar effects pedal that adds various effects to your sound. It features multiple modes for creative sound shaping.\"), \n(\"Sonic Enhancer\", 79.99, 20, \"A sonic enhancer that improves the clarity and depth of your recordings. It is perfect for adding richness to your audio.\"), \n(\"Microphone Windscreen\", 19.99, 100, \"A microphone windscreen that reduces wind noise during outdoor recordings. It is essential for capturing clear audio in windy conditions.\"), \n(\"Studio Lighting Kit\", 199.99, 8, \"A studio lighting kit designed for video and photography. It provides adjustable lighting for optimal recording conditions.\"), \n(\"Voiceover Kit\", 249.99, 10, \"A complete voiceover kit that includes a microphone, headphones, and audio interface. It is perfect for aspiring voice artists.\"), \n(\"Headphone Splitter\", 19.99, 75, \"A headphone splitter that allows multiple users to listen to the same audio source. It is perfect for collaborative work and sharing.\"), \n(\"Bluetooth Speaker\", 89.99, 40, \"A portable Bluetooth speaker that delivers impressive sound quality. It is ideal for enjoying music on the go.\"), \n(\"Digital Mixer\", 599.99, 6, \"A digital mixer that offers advanced features for live sound and studio recording. It includes touch screens and customizable settings.\"), \n(\"Music Production Software\", 149.99, 22, \"A music production software that provides tools for composing, recording, and mixing music. It is user-friendly and feature-rich.\"), \n(\"Sound Card\", 89.99, 35, \"An external sound card that enhances audio quality for recordings and playback. It features multiple input/output options.\"), \n(\"Audio Analyzer\", 299.99, 10, \"An audio analyzer that provides real-time analysis of sound waves. It is essential for mastering and optimizing audio quality.\"), \n(\"DJ Mixer\", 349.99, 6, \"A DJ mixer designed for professionals with multiple channels and effects. It offers seamless transitions and creative mixing options.\"), \n(\"Vocal Booth\", 499.99, 4, \"A portable vocal booth that isolates sound for clearer recordings. It is perfect for home studios and on-the-go recording.\"), \n(\"Drum Pad Controller\", 129.99, 25, \"A drum pad controller that allows you to create beats and rhythms easily. It features responsive pads and customizable settings.\"), \n(\"Portable PA System\", 399.99, 7, \"A portable PA system that is perfect for events and gatherings. It features powerful sound and easy setup.\"), \n(\"Acoustic Guitar Pickup\", 49.99, 55, \"An acoustic guitar pickup that enhances the sound of your instrument. It provides a natural tone for live performances.\"), \n(\"Voice Changer\", 29.99, 60, \"A voice changer that adds fun effects to your voice. It is perfect for parties and creative projects.\"), \n(\"Sound Mixer App\", 19.99, 100, \"A sound mixer app that allows you to mix audio tracks on your mobile device. It features intuitive controls and various effects.\"), \n(\"Recording Software\", 99.99, 30, \"Recording software that provides tools for capturing and editing audio. It is suitable for both beginners and professionals.\"), \n(\"Portable Studio\", 399.99, 5, \"A portable studio setup that includes a microphone, interface, and headphones. It is perfect for recording music anywhere.\"), \n(\"Smartphone Microphone\", 49.99, 70, \"A smartphone microphone that enhances audio quality for videos and podcasts. It is compact and easy to use.\"), \n(\"Loop Station\", 199.99, 12, \"A loop station that allows musicians to create layers of sound in real-time. It is perfect for live performances and practice.\"), \n(\"Bass Guitar Amplifier\", 249.99, 8, \"A bass guitar amplifier that delivers powerful sound for performances. It features multiple EQ settings for tone shaping.\"), \n(\"Studio Desk\", 299.99, 10, \"A studio desk designed for audio production with ample space for equipment. It combines functionality and style.\"), \n(\"Wireless Earbuds\", 79.99, 45, \"Wireless earbuds that provide high-quality audio without the hassle of wires. They are perfect for listening on the go.\"), \n(\"Guitar Strap\", 19.99, 90, \"A comfortable guitar strap that provides support during performances. It is adjustable and available in various designs.\"), \n(\"Microphone Cable\", 29.99, 100, \"A durable microphone cable that ensures clear audio transmission. It is essential for connecting your microphone to an interface.\"), \n(\"Studio Monitor Isolation Pads\", 39.99, 50, \"Isolation pads that reduce vibrations and improve sound quality for studio monitors. They are essential for accurate monitoring.\"), \n(\"Digital Recorder\", 199.99, 15, \"A digital recorder that captures high-quality audio with ease. It features intuitive controls and long battery life.\"), \n(\"Karaoke Microphone\", 39.99, 80, \"A karaoke microphone that connects to your device for singing along. It features built-in speakers and fun sound effects.\"), \n(\"Guitar Capo\", 15.99, 100, \"A guitar capo that allows for quick key changes during performances. It is easy to use and fits most guitar necks.\"), \n(\"Microphone Preamp\", 129.99, 20, \"A microphone preamp that enhances the quality of your recordings. It provides clean gain and low noise.\"), \n(\"Vocal Effects Processor\", 199.99, 10, \"A vocal effects processor that adds various effects to your voice. It is perfect for live performances and studio recordings.\"), \n(\"Audio Splitter\", 29.99, 75, \"An audio splitter that allows you to connect multiple devices to a single audio source. It is useful for various audio setups.\"), \n(\"Drumsticks\", 9.99, 200, \"A pair of drumsticks that are perfect for drummers of all levels. They are durable and provide a great feel for playing.\"), \n(\"Singing Machine Microphone\", 49.99, 60, \"A wireless microphone designed for use with karaoke machines. It features a comfortable grip and excellent sound quality.\"), \n(\"Guitar Tuner\", 19.99, 90, \"A digital guitar tuner that ensures your instrument is always in tune. It is compact and easy to use.\"), \n(\"Rehearsal Space Rental\", 50.00, 10, \"A rehearsal space available for musicians to practice and collaborate. It is equipped with soundproofing and essential gear.\"), \n(\"Sound Level Meter\", 79.99, 25, \"A sound level meter that measures sound intensity in decibels. It is essential for ensuring proper audio levels in recordings.\"), \n(\"DJ Headphones\", 99.99, 30, \"DJ headphones designed for clarity and comfort during long sessions. They feature swivel ear cups and a durable build.\"), \n(\"Acoustic Guitar\", 299.99, 10, \"An acoustic guitar with a rich sound and beautiful craftsmanship. It is perfect for both beginners and experienced players.\"), \n(\"Electric Guitar\", 499.99, 5, \"An electric guitar that delivers powerful sound and versatility. It features high-quality pickups and a sleek design.\"), \n(\"Portable Studio Monitors\", 199.99, 15, \"Portable studio monitors that provide accurate sound in a compact form. Ideal for mobile setups and small spaces.\"), \n(\"Music Stand\", 39.99, 50, \"A sturdy music stand that holds your sheet music securely. It is adjustable for height and angle.\"), \n(\"Guitar Pedal Board\", 99.99, 20, \"A guitar pedal board that keeps your effects organized and easily accessible. It features a durable construction for on-the-go use.\"), \n(\"Saxophone Microphone\", 129.99, 15, \"A specialized microphone for capturing the rich tones of a saxophone. It is designed to minimize feedback and enhance sound quality.\"), \n(\"Bass Guitar\", 399.99, 8, \"A bass guitar that provides deep, resonant tones for any music genre. It is built for durability and playability.\"), \n(\"Recording Studio Rental\", 100.00, 5, \"A professional recording studio available for rent. It is equipped with high-end gear and soundproofing for optimal recording.\"), \n(\"Folk Instruments\", 49.99, 40, \"A collection of folk instruments ideal for traditional music. They are perfect for beginners and enthusiasts alike.\"), \n(\"Piano Keyboard\", 199.99, 10, \"A digital piano keyboard that offers realistic sound and touch. It is perfect for practicing and composing music.\"), \n(\"Music Production Bundle\", 499.99, 5, \"A complete music production bundle that includes software, samples, and instruments. It provides everything you need to start creating music.\"), \n(\"Vocal Microphone\", 99.99, 50, \"A vocal microphone designed for live performances and studio recording. It captures vocals with clarity and precision.\"), \n(\"Digital Audio Recorder\", 149.99, 30, \"A digital audio recorder that offers high-quality sound capture. It is compact and easy to use for various recording needs.\"), \n(\"Violin Microphone\", 129.99, 12, \"A microphone specifically designed for capturing the sound of violins. It provides a natural tone and minimizes background noise.\"), \n(\"Singing Lessons\", 75.00, 10, \"Professional singing lessons to improve your vocal technique. Tailored to your skill level, these lessons help you reach your singing goals.\"), \n(\"Drum Kit\", 599.99, 3, \"A complete drum kit that includes everything you need to start playing. It features high-quality drums and cymbals for professional sound.\"), \n(\"Music Theory Book\", 29.99, 100, \"A comprehensive music theory book that covers all essential concepts. It is perfect for musicians looking to deepen their understanding of music.\") ]"