"[(\"All-Purpose Flour\", 2.99, 100, \"A versatile flour perfect for a wide range of baking recipes. It provides the ideal texture and structure for cookies, cakes, and bread.\"), \n(\"Granulated Sugar\", 1.49, 150, \"Classic white sugar that sweetens your baked goods to perfection. Ideal for cookies, cakes, and frostings.\"), \n(\"Brown Sugar\", 1.79, 120, \"Rich and moist, this brown sugar adds a deep flavor to your baking. Perfect for cookies, pies, and sauces.\"), \n(\"Baking Powder\", 0.99, 200, \"A leavening agent that helps baked goods rise. Essential for fluffy cakes and light pastries.\"), \n(\"Baking Soda\", 0.89, 180, \"A key ingredient for many recipes, this baking soda helps cookies and breads rise. It's also great for cleaning!\" ), \n(\"Vanilla Extract\", 4.99, 50, \"Pure vanilla extract that enhances the flavor of your baked goods. A must-have for cookies, cakes, and custards.\"), \n(\"Cocoa Powder\", 3.49, 80, \"Rich cocoa powder perfect for chocolate cakes and brownies. Adds a deep chocolate flavor to any dessert.\"), \n(\"Yeast\", 1.29, 75, \"Active dry yeast that helps bread rise and become fluffy. Essential for making homemade bread and rolls.\"), \n(\"Chocolate Chips\", 2.99, 100, \"Semi-sweet chocolate chips perfect for cookies and desserts. Great for adding a touch of sweetness to your baking.\"), \n(\"Parchment Paper\", 5.99, 60, \"Non-stick parchment paper for easy baking and cleanup. Ideal for lining baking sheets and pans.\"), \n(\"Butter\", 3.49, 50, \"Unsalted butter that adds richness to your baked goods. Perfect for cookies, cakes, and pastries.\"), \n(\"Eggs\", 2.99, 120, \"Fresh eggs that are essential for baking. They provide moisture and structure to cakes and cookies.\"), \n(\"Milk\", 2.49, 80, \"Whole milk that adds creaminess to your baked goods. Great for cakes, muffins, and pancakes.\"), \n(\"Powdered Sugar\", 2.19, 90, \"Finely ground sugar perfect for frosting and dusting. Adds a sweet finish to cakes and pastries.\"), \n(\"Honey\", 3.99, 40, \"Pure honey that adds natural sweetness to your baking. Perfect for cookies, breads, and glazes.\"), \n(\"Almond Extract\", 3.49, 50, \"A sweet and nutty extract that enhances the flavor of baked goods. Ideal for cookies, cakes, and pastries.\"), \n(\"Cinnamon\", 1.29, 100, \"Ground cinnamon that adds warmth and spice to your baked goods. Perfect for cookies, cakes, and breads.\"), \n(\"Nutmeg\", 1.49, 80, \"Ground nutmeg that adds a warm, aromatic flavor to your baking. Great for pies, cakes, and spice blends.\"), \n(\"Baking Mat\", 9.99, 30, \"Reusable silicone baking mat that provides a non-stick surface. Perfect for rolling out dough and baking cookies.\"), \n(\"Sprinkles\", 1.99, 70, \"Colorful sprinkles that add fun and flair to your baked goods. Perfect for decorating cakes and cupcakes.\"), \n(\"Cake Pan Set\", 14.99, 25, \"A set of durable cake pans for baking all your favorite cakes. Made from high-quality materials for even baking.\"), \n(\"Muffin Tin\", 9.99, 40, \"A non-stick muffin tin perfect for baking delicious muffins. Ideal for breakfast or snacks.\"), \n(\"Rolling Pin\", 8.49, 35, \"A classic wooden rolling pin for rolling out dough. Essential for making cookies, pies, and pastries.\"), \n(\"Whisk\", 4.99, 50, \"A sturdy whisk for mixing batters and whipping cream. Great for achieving the perfect texture in your recipes.\"), \n(\"Measuring Cups\", 7.99, 30, \"A set of measuring cups for precise ingredient measurements. Essential for baking accuracy.\"), \n(\"Measuring Spoons\", 4.99, 40, \"A set of measuring spoons for accurate measurements of dry and liquid ingredients. Perfect for baking.\"), \n(\"Silicone Spatula\", 3.99, 60, \"A flexible silicone spatula for mixing and scraping bowls. Ideal for baking and cooking.\"), \n(\"Oven Mitts\", 12.99, 20, \"Durable oven mitts that protect your hands while baking. Essential for handling hot pans and dishes.\"), \n(\"Cooling Rack\", 6.99, 25, \"A wire cooling rack for cooling baked goods evenly. Keeps cookies and cakes from becoming soggy.\"), \n(\"Pastry Brush\", 2.49, 50, \"A handy pastry brush for glazing and basting. Perfect for adding egg wash to pastries.\"), \n(\"Cookie Cutters\", 5.99, 30, \"A set of fun cookie cutters for shaping cookies. Great for holiday baking and themed treats.\"), \n(\"Pie Dish\", 9.99, 25, \"A classic pie dish for baking delicious pies. Made from durable materials for even cooking.\"), \n(\"Sifter\", 3.49, 40, \"A fine mesh sifter for aerating and combining dry ingredients. Essential for light and fluffy cakes.\"), \n(\"Baking Sheet\", 10.99, 35, \"A heavy-duty baking sheet for cookies and pastries. Ensures even baking and browning.\"), \n(\"Springform Pan\", 12.99, 20, \"A versatile springform pan for cheesecakes and delicate desserts. Easy to release and serve.\"), \n(\"Tart Pan\", 8.99, 25, \"A fluted tart pan with a removable bottom for easy serving. Perfect for baking tarts and quiches.\"), \n(\"Food Processor\", 49.99, 10, \"A powerful food processor that makes mixing and chopping ingredients a breeze. Ideal for making dough and batters.\"), \n(\"Stand Mixer\", 299.99, 5, \"A high-performance stand mixer that takes the effort out of baking. Perfect for whipping, mixing, and kneading.\"), \n(\"Hand Mixer\", 29.99, 25, \"A compact hand mixer for quick mixing and blending. Ideal for small batches and easy storage.\"), \n(\"Baking Scale\", 19.99, 15, \"A digital kitchen scale for precise measurements. Essential for consistent baking results.\"), \n(\"Cake Decorating Kit\", 14.99, 20, \"A complete cake decorating kit for creating stunning cakes. Includes piping bags, tips, and tools.\"), \n(\"Fondant\", 5.99, 30, \"Smooth and pliable fondant for cake decorating. Perfect for creating beautiful cake designs.\"), \n(\"Edible Glitter\", 3.99, 40, \"Sparkling edible glitter to add a touch of magic to your baked goods. Great for decorating cakes and cupcakes.\"), \n(\"Marzipan\", 6.49, 25, \"Sweet almond paste that can be molded into shapes for decorating. Perfect for cakes and pastries.\"), \n(\"Cake Box\", 4.99, 50, \"Sturdy cake boxes for transporting your baked creations. Keeps cakes safe and secure.\"), \n(\"Spray Oil\", 2.49, 70, \"Non-stick spray oil for easy baking and cleanup. Ideal for greasing pans and baking sheets.\"), \n(\"Fruit Filling\", 3.99, 40, \"Delicious fruit filling for pies and pastries. Adds a burst of flavor to your baked goods.\"), \n(\"Pudding Mix\", 2.49, 60, \"Instant pudding mix for quick and easy desserts. Perfect for layering in cakes and parfaits.\"), \n(\"Gelatin\", 1.99, 80, \"Unflavored gelatin for thickening and stabilizing desserts. Essential for making jellies and mousses.\"), \n(\"Cake Mix\", 3.49, 100, \"Convenient cake mix for quick baking. Just add eggs and water for a delicious cake.\"), \n(\"Brownie Mix\", 2.99, 90, \"Easy brownie mix for fudgy and delicious brownies. Perfect for satisfying your chocolate cravings.\"), \n(\"Pancake Mix\", 2.99, 80, \"Fluffy pancake mix for a quick breakfast. Just add water for delicious pancakes.\"), \n(\"Cornstarch\", 1.29, 100, \"Fine cornstarch for thickening sauces and puddings. A versatile ingredient for baking and cooking.\"), \n(\"Coconut Flakes\", 2.49, 70, \"Sweetened coconut flakes for adding texture and flavor to your baked goods. Great for cookies and cakes.\"), \n(\"Dried Fruits\", 3.99, 50, \"A mix of dried fruits for adding natural sweetness to your baking. Perfect for muffins and breads.\"), \n(\"Chopped Nuts\", 4.99, 40, \"Chopped walnuts and pecans for adding crunch to your baked goods. Great for cookies and cakes.\"), \n(\"Cake Pop Sticks\", 2.99, 60, \"Sturdy sticks for making cake pops at home. Perfect for fun and festive treats.\"), \n(\"Chocolate Fondue\", 8.99, 20, \"Rich chocolate fondue for dipping fruits and pastries. A delightful treat for any occasion.\"), \n(\"Bakery Boxes\", 10.99, 15, \"Sturdy bakery boxes for packaging baked goods. Ideal for gifts and special occasions.\"), \n(\"Ice Cream Maker\", 49.99, 5, \"A compact ice cream maker for creating homemade ice cream. Perfect for summer treats.\"), \n(\"Cupcake Liners\", 3.49, 50, \"Colorful cupcake liners for baking and serving cupcakes. Adds a fun touch to your treats.\"), \n(\"Baking Cookbook\", 19.99, 10, \"A comprehensive baking cookbook filled with delicious recipes. Perfect for bakers of all levels.\"), \n(\"Bread Machine\", 99.99, 5, \"A convenient bread machine for making fresh bread at home. Just add ingredients and let it do the work.\"), \n(\"Baking Timer\", 12.99, 20, \"A reliable baking timer to ensure your baked goods are perfectly timed. Essential for baking success.\"), \n(\"Pastry Cutter\", 4.99, 30, \"A handy pastry cutter for blending butter into flour. Perfect for making flaky pie crusts.\"), \n(\"Lemon Zester\", 2.49, 50, \"A zester for adding fresh citrus flavor to your baking. Great for cookies, cakes, and frostings.\"), \n(\"Chocolate Molds\", 5.99, 25, \"Silicone molds for shaping chocolate into fun designs. Perfect for candy making and decorating.\"), \n(\"Baking Apron\", 14.99, 20, \"A stylish baking apron to keep you clean while you bake. Perfect for home bakers and professionals.\"), \n(\"Kitchen Towels\", 9.99, 30, \"Soft kitchen towels for drying dishes and hands. Essential for any baking setup.\"), \n(\"Baking Bookends\", 19.99, 10, \"Decorative bookends for organizing your baking books. A stylish addition to any kitchen.\"), \n(\"Pizza Stone\", 29.99, 15, \"A baking stone for making crispy homemade pizzas. Ideal for achieving a restaurant-quality crust.\"), \n(\"Scone Mix\", 3.49, 50, \"Easy scone mix for quick and delicious scones. Perfect for breakfast or tea time.\"), \n(\"Frosting Mix\", 2.99, 70, \"Convenient frosting mix for quick cake decorating. Just add butter and water for creamy frosting.\"), \n(\"Pasta Maker\", 79.99, 5, \"A manual pasta maker for creating fresh pasta at home. Perfect for Italian cuisine lovers.\"), \n(\"Biscuit Cutter\", 3.49, 30, \"A round biscuit cutter for making perfectly shaped biscuits. Essential for breakfast and brunch.\"), \n(\"Flavored Extracts\", 4.99, 40, \"A variety of flavored extracts for enhancing your baking. Perfect for cookies, cakes, and more.\"), \n(\"Baking Stone\", 19.99, 15, \"A durable baking stone for even heat distribution. Ideal for bread and pizza baking.\")]"