"products = [\n    (\"SoundWave Pro\", 149.99, 30, \"The SoundWave Pro delivers crystal-clear audio with deep bass. Its portable design makes it perfect for any occasion, whether at home or on the go.\"),\n    (\"AquaBeat Speaker\", 89.99, 25, \"This waterproof Bluetooth speaker is perfect for pool parties or beach outings. Enjoy your favorite tunes without worrying about splashes.\"),\n    (\"BassBoomer\", 129.99, 40, \"Experience powerful sound with the BassBoomer, featuring enhanced bass and a rugged design. It's built to withstand outdoor adventures.\"),\n    (\"MiniSound Cube\", 49.99, 100, \"A compact Bluetooth speaker that packs a punch in sound quality. It's lightweight and easy to carry, making it a great travel companion.\"),\n    (\"PartyBlast 360\", 199.99, 20, \"With 360-degree sound, the PartyBlast 360 is perfect for gatherings. Its colorful LED lights sync with the music to enhance the party atmosphere.\"),\n    (\"EcoSound\", 79.99, 35, \"Made from sustainable materials, the EcoSound speaker offers great sound while being environmentally friendly. It's perfect for eco-conscious music lovers.\"),\n    (\"UltraBass Speaker\", 159.99, 15, \"The UltraBass Speaker is designed for bass enthusiasts, delivering deep, rich sound. Its stylish design makes it a great addition to any room.\"),\n    (\"TravelTune\", 69.99, 50, \"This portable Bluetooth speaker is designed for travel, offering long battery life and rugged durability. Enjoy music wherever your adventures take you.\"),\n    (\"SmartSound\", 119.99, 45, \"A smart Bluetooth speaker with voice assistant integration. Control your music and smart home devices with just your voice.\"),\n    (\"ChicSound\", 89.99, 60, \"The ChicSound speaker combines elegance with powerful sound. Its stylish design makes it a perfect fit for any modern home.\"),\n    (\"BassBlaster 2000\", 199.99, 10, \"With its high wattage output, the BassBlaster 2000 is perfect for large gatherings. Experience music like never before with its booming sound.\"),\n    (\"PocketParty Speaker\", 39.99, 80, \"A pocket-sized speaker that delivers impressive sound quality. Perfect for impromptu gatherings or solo listening.\"),\n    (\"SoundSphere\", 159.99, 20, \"The SoundSphere features a unique design that optimizes sound dispersion. Enjoy your music in any setting with this stylish speaker.\"),\n    (\"VibeBox\", 99.99, 55, \"The VibeBox is designed for the ultimate music experience, featuring customizable sound settings. Perfect for audiophiles who love to tweak their audio.\"),\n    (\"RuggedSound\", 79.99, 30, \"Built for adventure, the RuggedSound speaker is shockproof and waterproof. Take it on your hikes, camping trips, or beach days without worry.\"),\n    (\"NeonGlow Speaker\", 89.99, 25, \"This Bluetooth speaker features vibrant LED lights that dance to your music. It's perfect for parties and adds a fun atmosphere to any gathering.\"),\n    (\"HomeTheater Pro\", 249.99, 5, \"Transform your living room into a home theater with the HomeTheater Pro. It offers surround sound capabilities that enhance your movie-watching experience.\"),\n    (\"JungleBeat\", 69.99, 40, \"The JungleBeat speaker is designed for outdoor use with a rugged exterior. Enjoy your favorite tracks while camping or hiking.\"),\n    (\"FashionSound\", 59.99, 70, \"A stylish Bluetooth speaker that complements any outfit. It's perfect for those who want to look good while enjoying their music.\"),\n    (\"BassWave\", 139.99, 20, \"The BassWave speaker offers rich bass and clear highs for an immersive audio experience. It's ideal for music lovers who appreciate quality sound.\"),\n    (\"SoundBlast\", 99.99, 50, \"The SoundBlast speaker is perfect for outdoor events with its powerful sound and long battery life. Bring your music to life wherever you go.\"),\n    (\"SonicBoom\", 129.99, 15, \"Experience the power of sound with the SonicBoom speaker. Its high-performance audio makes it a must-have for any music enthusiast.\"),\n    (\"WaveRider\", 89.99, 30, \"The WaveRider is designed for beach lovers, featuring a waterproof design and buoyant body. Enjoy music by the water without fear.\"),\n    (\"CrystalSound\", 119.99, 25, \"Enjoy crystal-clear audio with the CrystalSound speaker, which features advanced sound technology. Perfect for both casual listening and serious audiophiles.\"),\n    (\"VibeSpeaker\", 49.99, 60, \"A compact and affordable speaker that delivers good sound quality. It's great for casual listening at home or on the go.\"),\n    (\"RetroSound\", 79.99, 45, \"This vintage-style Bluetooth speaker combines classic design with modern technology. Enjoy your favorite tunes with a nostalgic flair.\"),\n    (\"OutdoorBeats\", 99.99, 35, \"The OutdoorBeats speaker is designed for outdoor enthusiasts, with a durable and waterproof build. Perfect for camping trips and beach days.\"),\n    (\"PartyPal\", 149.99, 10, \"The PartyPal speaker features a built-in light show that syncs with your music. It's the ultimate addition to any party or event.\"),\n    (\"SoundLink\", 119.99, 20, \"The SoundLink speaker offers seamless connectivity and impressive sound quality. It's perfect for streaming music from your favorite devices.\"),\n    (\"BoomBox Pro\", 179.99, 8, \"With its powerful sound and retro design, the BoomBox Pro is perfect for nostalgic music lovers. Take your music anywhere with style.\"),\n    (\"SonicWave\", 99.99, 50, \"The SonicWave speaker is designed for powerful audio performance. Its sleek design makes it a great addition to any space.\"),\n    (\"Bluetooth Buddy\", 49.99, 60, \"A user-friendly Bluetooth speaker that connects effortlessly to your devices. Perfect for casual listening and everyday use.\"),\n    (\"WaveSound\", 89.99, 40, \"The WaveSound speaker features a sleek design and balanced audio performance. It's ideal for both music and podcasts.\"),\n    (\"PulseSpeaker\", 129.99, 15, \"The PulseSpeaker offers dynamic sound with a built-in light show that reacts to the beat. Perfect for parties and gatherings.\"),\n    (\"TravelBeats\", 69.99, 50, \"A lightweight and portable speaker that delivers impressive sound quality. Perfect for travelers who want to enjoy music on the go.\"),\n    (\"ChillBox\", 79.99, 30, \"The ChillBox speaker is designed for relaxation, offering soothing sounds and ambient lighting. Ideal for unwinding after a long day.\"),\n    (\"SoundWave Mini\", 39.99, 80, \"A mini Bluetooth speaker that delivers surprisingly powerful sound. Perfect for small spaces or personal use.\"),\n    (\"AdventureSound\", 99.99, 25, \"Built for outdoor adventures, the AdventureSound speaker is rugged and waterproof. Enjoy your music wherever your journey takes you.\"),\n    (\"Gamer's Sound\", 149.99, 15, \"The Gamer's Sound speaker enhances your gaming experience with immersive audio. It's designed for gamers who demand high-quality sound.\"),\n    (\"MoodMusic\", 89.99, 35, \"The MoodMusic speaker features customizable lighting to set the perfect atmosphere. Ideal for relaxing or entertaining.\"),\n    (\"SmartBass\", 129.99, 20, \"The SmartBass speaker offers advanced audio technology for a rich listening experience. Control it easily with your smartphone.\"),\n    (\"SoundWave X\", 159.99, 10, \"Experience the next level of sound with the SoundWave X, featuring high-fidelity audio. Perfect for audiophiles who appreciate quality.\"),\n    (\"VibrantSound\", 79.99, 45, \"The VibrantSound speaker offers colorful LED lights and robust audio performance. It's perfect for parties and casual gatherings.\"),\n    (\"TechSound\", 99.99, 50, \"A technologically advanced speaker that offers excellent sound quality and connectivity options. Ideal for tech enthusiasts.\"),\n    (\"EcoBeats\", 69.99, 30, \"The EcoBeats speaker is made from recycled materials, promoting sustainability without compromising sound quality. Great for eco-conscious consumers.\"),\n    (\"FusionSound\", 149.99, 15, \"The FusionSound speaker combines modern design with powerful audio capabilities. Perfect for both home use and outdoor adventures.\"),\n    (\"SoundCraft\", 119.99, 20, \"The SoundCraft speaker offers a unique blend of style and performance. Enjoy your music in high quality with this elegant speaker.\"),\n    (\"DJ Speaker\", 199.99, 8, \"The DJ Speaker is designed for professional use, offering high output and customizable sound settings. Perfect for DJs and music enthusiasts.\"),\n    (\"BassMaster\", 139.99, 15, \"The BassMaster speaker delivers deep bass and clear highs, making it perfect for all music genres. Experience your music like never before.\"),\n    (\"PocketSound\", 49.99, 60, \"A compact speaker that fits in your pocket, delivering great sound on the go. Perfect for casual listening anywhere.\"),\n    (\"UrbanSound\", 89.99, 35, \"The UrbanSound speaker combines modern aesthetics with powerful audio performance. Ideal for city dwellers who love music.\"),\n    (\"SoundWave Pro X\", 159.99, 10, \"The SoundWave Pro X offers studio-quality sound in a portable format. Perfect for music lovers who demand the best.\"),\n    (\"ChillSpeaker\", 79.99, 50, \"The ChillSpeaker is designed for relaxation, offering soothing sounds and a sleek design. Perfect for unwinding after a long day.\"),\n    (\"RoboSound\", 99.99, 25, \"The RoboSound speaker features futuristic design and advanced sound technology. Enjoy your favorite tracks with a modern twist.\"),\n    (\"SoundSphere Mini\", 49.99, 75, \"A mini version of the SoundSphere, offering great sound in a compact design. Perfect for small spaces or personal use.\"),\n    (\"PartyWave\", 129.99, 20, \"The PartyWave speaker features a built-in light show that syncs with your music. It's the ultimate addition to any celebration.\"),\n    (\"SoundMate\", 69.99, 40, \"The SoundMate speaker is designed for easy connectivity and good sound quality. Perfect for casual listening at home or on the go.\"),\n    (\"BassBoom\", 99.99, 30, \"The BassBoom speaker delivers impressive sound quality with deep bass. Perfect for music lovers who appreciate good audio.\"),\n    (\"WaveRider Pro\", 149.99, 15, \"The WaveRider Pro is designed for outdoor use, offering powerful sound and rugged durability. Enjoy your favorite music wherever you go.\"),\n    (\"SoundScape\", 119.99, 20, \"The SoundScape speaker offers immersive audio performance with a sleek design. Perfect for enhancing your home entertainment experience.\"),\n    (\"VibeBeats\", 89.99, 35, \"The VibeBeats speaker combines vibrant design with quality sound. It's perfect for parties and casual gatherings.\"),\n    (\"SoundWave Lite\", 39.99, 80, \"A lightweight and affordable Bluetooth speaker that delivers good sound quality. Ideal for casual listening and everyday use.\"),\n    (\"BassBlitz\", 139.99, 10, \"The BassBlitz speaker features powerful audio performance and a stylish design. Perfect for music lovers who want quality sound.\"),\n    (\"TravelTunes\", 69.99, 50, \"A portable speaker designed for travel, offering long battery life and great sound. Perfect for on-the-go music lovers.\"),\n    (\"SoundBox\", 99.99, 25, \"The SoundBox speaker delivers impressive sound quality in a compact design. Perfect for home use or outdoor adventures.\"),\n    (\"ChicBeat\", 89.99, 40, \"The ChicBeat speaker combines style with powerful audio performance. It's perfect for those who want to enjoy music in style.\"),\n    (\"SonicPulse\", 129.99, 15, \"The SonicPulse speaker features advanced sound technology for a rich listening experience. Perfect for audiophiles who appreciate quality.\"),\n    (\"RuggedWave\", 79.99, 30, \"Built for adventure, the RuggedWave speaker is shockproof and waterproof. Enjoy your music wherever your journey takes you.\"),\n    (\"SoundBolt\", 99.99, 50, \"The SoundBolt speaker offers dynamic sound with a sleek design. Perfect for both casual listening and serious audiophiles.\"),\n    (\"PartySpeaker\", 149.99, 10, \"The PartySpeaker features a built-in light show that syncs with your music. It's the ultimate addition to any celebration.\"),\n    (\"EcoWave\", 69.99, 35, \"The EcoWave speaker is made from sustainable materials, promoting eco-friendliness without sacrificing sound quality. Great for conscious consumers.\"),\n    (\"SoundWave 2.0\", 159.99, 15, \"Experience upgraded sound quality with the SoundWave 2.0, featuring high-fidelity audio. Perfect for audiophiles who demand the best.\"),\n    (\"VibeBox Mini\", 39.99, 75, \"A mini version of the VibeBox, offering great sound in a compact design. Perfect for small spaces or personal use.\"),\n    (\"FusionSound Pro\", 199.99, 5, \"The FusionSound Pro combines modern design with powerful audio capabilities. Perfect for home use and outdoor adventures.\"),\n    (\"DJ Beats\", 129.99, 20, \"The DJ Beats speaker is designed for professional use, offering high output and customizable sound settings. Perfect for DJs and music enthusiasts.\"),\n    (\"PocketBass\", 49.99, 60, \"A pocket-sized speaker that delivers surprisingly powerful sound. Perfect for casual listening anywhere.\"),\n    (\"OutdoorVibe\", 99.99, 25, \"The OutdoorVibe speaker is designed for outdoor enthusiasts, with a durable and waterproof build. Enjoy your music wherever your journey takes you.\"),\n    (\"WaveSound Pro\", 159.99, 10, \"Experience the next level of sound with the WaveSound Pro, featuring high-fidelity audio. Perfect for audiophiles who appreciate quality.\"),\n    (\"SoundWave Fusion\", 119.99, 20, \"The SoundWave Fusion speaker offers a unique blend of style and performance. Enjoy your music in high quality with this elegant speaker.\"),\n    (\"ChillWave\", 79.99, 50, \"The ChillWave speaker is designed for relaxation, offering soothing sounds and ambient lighting. Ideal for unwinding after a long day.\"),\n    (\"BassRider\", 139.99, 15, \"The BassRider speaker delivers deep bass and clear highs, making it perfect for all music genres. Experience your music like never before.\"),\n    (\"SoundSphere Pro\", 89.99, 35, \"The SoundSphere Pro features a sleek design and balanced audio performance. It's ideal for both music and podcasts.\"),\n    (\"RetroBeats\", 79.99, 40, \"This vintage-style Bluetooth speaker combines classic design with modern technology. Enjoy your favorite tunes with a nostalgic flair.\"),\n    (\"SonicWave Mini\", 49.99, 75, \"A mini version of the SonicWave, offering great sound in a compact design. Perfect for small spaces or personal use.\"),\n    (\"PartyPulse\", 129.99, 20, \"The PartyPulse speaker offers dynamic sound with a built-in light show. Perfect for parties and gatherings.\"),\n    (\"SoundMate Pro\", 69.99, 50, \"The SoundMate Pro speaker is designed for easy connectivity and good sound quality. Perfect for casual listening at home or on the go.\"),\n    (\"WaveRider X\", 149.99, 15, \"The WaveRider X is designed for outdoor use, offering powerful sound and rugged durability. Enjoy your favorite music wherever you go.\"),\n    (\"SoundWave Lite Pro\", 39.99, 80, \"A lightweight and affordable Bluetooth speaker that delivers good sound quality. Ideal for casual listening and everyday use.\"),\n    (\"VibeSpeaker Pro\", 89.99, 35, \"The VibeSpeaker Pro combines vibrant design with quality sound. It's perfect for parties and casual gatherings.\"),\n    (\"TravelSound\", 69.99, 50, \"A portable speaker designed for travel, offering long battery life and great sound. Perfect for on-the-go music lovers.\"),\n    (\"PulseWave\", 99.99, 25, \"The PulseWave speaker features dynamic sound and a sleek design. Perfect for both casual listening and serious audiophiles.\"),\n    (\"AdventureBeats\", 79.99, 30, \"The AdventureBeats speaker is built for outdoor use, with a rugged and waterproof design. Enjoy your music wherever your journey takes you.\"),\n    (\"SoundCraft Pro\", 119.99, 20, \"The SoundCraft Pro speaker offers advanced audio technology for a rich listening experience. Perfect for audiophiles who appreciate quality.\"),\n    (\"DJ SoundBox\", 199.99, 5, \"The DJ SoundBox is designed for professional use, offering high output and customizable sound settings. Perfect for DJs and music enthusiasts.\"),\n    (\"PocketSound Pro\", 49.99, 60, \"A pocket-sized speaker that delivers surprisingly powerful sound. Perfect for casual listening anywhere.\"),\n    (\"UrbanBeats\", 89.99, 35, \"The UrbanBeats speaker combines modern aesthetics with powerful audio performance. Ideal for city dwellers who love music.\"),\n    (\"FusionWave\", 159.99, 10, \"Experience upgraded sound quality with the FusionWave, featuring high-fidelity audio. Perfect for audiophiles who demand the best.\"),\n    (\"SoundWave X Pro\", 159.99, 10, \"The SoundWave X Pro offers studio-quality sound in a portable format. Perfect for music lovers who demand the best.\"),\n    (\"ChicWave\", 79.99, 50, \"The ChicWave speaker is designed for relaxation, offering soothing sounds and ambient lighting. Ideal for unwinding after a long day.\"),\n    (\"BassMaster Pro\", 139.99, 15, \"The BassMaster Pro speaker delivers deep bass and clear highs, making it perfect for all music genres. Experience your music like never before.\"),\n    (\"WaveSound Mini\", 49.99, 75, \"A mini version of the WaveSound, offering great sound in a compact design. Perfect for small spaces or personal use.\"),\n    (\"SoundSphere Lite\", 39.99, 80, \"A lightweight and affordable Bluetooth speaker that delivers good sound quality. Ideal for casual listening and everyday use.\"),\n    (\"RuggedBeats\", 99.99, 25, \"The RuggedBeats speaker is built for outdoor adventures, with a durable and waterproof design. Enjoy your music wherever your journey takes you.\"),\n    (\"SonicPulse Pro\", 129.99, 20, \"The SonicPulse Pro speaker features advanced sound technology for a rich listening experience. Perfect for audiophiles who appreciate quality.\"),\n    (\"SoundWave Fusion Pro\", 119.99, 20, \"The SoundWave Fusion Pro speaker offers a unique blend of style and performance. Enjoy your music in high quality with this elegant speaker.\"),\n    (\"ChillBeats\", 79.99, 50, \"The ChillBeats speaker is designed for relaxation, offering soothing sounds and ambient lighting. Ideal for unwinding after a long day.\"),\n    (\"PocketWave\", 49.99, 60, \"A pocket-sized speaker that delivers surprisingly powerful sound. Perfect for casual listening anywhere.\"),\n    (\"DJ Vibe\", 129.99, 20, \"The DJ Vibe speaker is designed for professional use, offering high output and customizable sound settings. Perfect for DJs and music enthusiasts.\"),\n    (\"TravelWave\", 69.99, 50, \"A portable speaker designed for travel, offering long battery life and great sound. Perfect for on-the-go music lovers.\"),\n]"