"products = [\n    (\"Canon EOS R5\", 3899.99, 15, \"The Canon EOS R5 is a groundbreaking mirrorless camera with a full-frame sensor. It offers exceptional image quality and impressive autofocus capabilities.\"),\n    (\"Nikon Z6 II\", 1999.99, 25, \"The Nikon Z6 II is a versatile mirrorless camera that excels in both photography and videography. It features dual card slots and improved autofocus performance.\"),\n    (\"Sony Alpha a7 III\", 1999.99, 30, \"The Sony Alpha a7 III is a full-frame mirrorless camera known for its outstanding low-light performance. It combines speed, versatility, and exceptional image quality.\"),\n    (\"Fujifilm X-T4\", 1699.99, 20, \"The Fujifilm X-T4 is a stylish mirrorless camera that offers in-body image stabilization. Its unique film simulation modes provide creative options for photographers.\"),\n    (\"Panasonic Lumix GH5\", 1299.99, 18, \"The Panasonic Lumix GH5 is a micro four-thirds camera designed for professional videographers. It boasts 4K video capabilities and advanced video features.\"),\n    (\"Olympus OM-D E-M1 Mark III\", 1499.99, 22, \"The Olympus OM-D E-M1 Mark III is a compact mirrorless camera with excellent weather sealing. It offers advanced autofocus and high-speed continuous shooting.\"),\n    (\"GoPro HERO10 Black\", 499.99, 40, \"The GoPro HERO10 Black is an action camera that captures stunning 5.3K video and 23MP photos. It's built for adventure with rugged durability and waterproof design.\"),\n    (\"DJI Osmo Pocket 2\", 349.99, 35, \"The DJI Osmo Pocket 2 is a compact gimbal camera that delivers smooth video and high-quality images. Its pocket-sized design makes it perfect for vlogging and travel.\"),\n    (\"Leica Q2\", 4995.00, 10, \"The Leica Q2 is a premium compact camera with a full-frame sensor and a fixed 28mm lens. It offers exceptional image quality and a classic design.\"),\n    (\"Ricoh GR III\", 899.99, 28, \"The Ricoh GR III is a pocket-sized camera known for its superb image quality and street photography capabilities. Its large APS-C sensor delivers stunning detail.\"),\n    (\"Sony ZV-1\", 748.00, 45, \"The Sony ZV-1 is a compact camera designed specifically for vloggers. It features a fast lens and advanced autofocus for capturing high-quality video.\"),\n    (\"Nikon D850\", 2999.99, 12, \"The Nikon D850 is a professional-grade DSLR with a 45.7MP full-frame sensor. It excels in both photography and videography, offering stunning detail and dynamic range.\"),\n    (\"Canon PowerShot G7 X Mark III\", 749.99, 33, \"The Canon PowerShot G7 X Mark III is a compact camera ideal for content creators. It features 4K video recording and a fast lens for low-light performance.\"),\n    (\"Sigma fp\", 1999.00, 14, \"The Sigma fp is a compact full-frame mirrorless camera that focuses on video performance. Its modular design allows for versatile shooting options.\"),\n    (\"Panasonic Lumix S5\", 1999.99, 17, \"The Panasonic Lumix S5 is a full-frame mirrorless camera that excels in both stills and video. It features advanced autofocus and dual native ISO for low-light shooting.\"),\n    (\"Fujifilm GFX 100S\", 5999.00, 8, \"The Fujifilm GFX 100S is a medium format camera with a 102MP sensor. It offers stunning image quality and is perfect for landscape and portrait photography.\"),\n    (\"Canon EOS M50 Mark II\", 599.99, 50, \"The Canon EOS M50 Mark II is a versatile mirrorless camera designed for content creators. It features improved autofocus and live streaming capabilities.\"),\n    (\"Nikon Coolpix P1000\", 999.99, 20, \"The Nikon Coolpix P1000 is a bridge camera with an incredible 125x optical zoom. It's perfect for wildlife and sports photography, offering great versatility.\"),\n    (\"Sony A6400\", 898.00, 37, \"The Sony A6400 is a compact mirrorless camera with fast autofocus and 4K video capabilities. Its lightweight design makes it ideal for travel and everyday use.\"),\n    (\"Panasonic Lumix TZ200\", 649.99, 21, \"The Panasonic Lumix TZ200 is a compact travel camera with a 1-inch sensor for improved image quality. It features a versatile zoom lens and 4K video recording.\"),\n    (\"GoPro MAX\", 499.99, 27, \"The GoPro MAX is a 360-degree action camera that captures immersive footage. It features HyperSmooth stabilization and is perfect for adventurous content creators.\"),\n    (\"Leica M10\", 7995.00, 5, \"The Leica M10 is a classic rangefinder camera that combines timeless design with modern technology. It offers exceptional image quality and a unique shooting experience.\"),\n    (\"Olympus Tough TG-6\", 449.99, 30, \"The Olympus Tough TG-6 is a rugged compact camera built for adventure. It's waterproof, shockproof, and features a bright lens for low-light conditions.\"),\n    (\"Sony RX100 VII\", 1299.99, 16, \"The Sony RX100 VII is a premium compact camera with a 1-inch sensor and fast autofocus. It's perfect for travel, offering high-quality images in a small package.\"),\n    (\"Nikon Z50\", 849.99, 23, \"The Nikon Z50 is a compact mirrorless camera with an APS-C sensor. It features a user-friendly design and is great for both photography and video.\"),\n    (\"Canon EOS 90D\", 1199.99, 11, \"The Canon EOS 90D is a versatile DSLR camera with a 32.5MP sensor. It offers excellent autofocus and video capabilities, making it ideal for enthusiasts.\"),\n    (\"Fujifilm X100V\", 1399.99, 18, \"The Fujifilm X100V is a stylish compact camera with a fixed 23mm lens. It features a hybrid viewfinder and exceptional image quality, perfect for street photography.\"),\n    (\"Sony A7R IV\", 3299.99, 9, \"The Sony A7R IV is a high-resolution mirrorless camera with a 61MP full-frame sensor. It offers exceptional detail and dynamic range for professional photographers.\"),\n    (\"Canon EOS RP\", 999.99, 20, \"The Canon EOS RP is an entry-level full-frame mirrorless camera. It combines impressive image quality with a lightweight design, making it great for travel.\"),\n    (\"Nikon D7500\", 1249.99, 15, \"The Nikon D7500 is a powerful DSLR designed for enthusiasts. It features a 20.9MP sensor and 4K video recording capabilities.\"),\n    (\"Panasonic Lumix GX85\", 599.99, 20, \"The Panasonic Lumix GX85 is a compact mirrorless camera with dual image stabilization. It's perfect for both photography and videography in various conditions.\"),\n    (\"Ricoh Theta Z1\", 999.99, 12, \"The Ricoh Theta Z1 is a premium 360-degree camera that captures high-resolution images. It's ideal for virtual tours and immersive content creation.\"),\n    (\"DJI Mavic Air 2\", 799.00, 25, \"The DJI Mavic Air 2 is a powerful drone that features a 48MP camera and 4K video capabilities. It's perfect for aerial photography and videography.\"),\n    (\"Canon EOS 6D Mark II\", 1399.99, 10, \"The Canon EOS 6D Mark II is a full-frame DSLR camera with a 26.2MP sensor. It offers excellent image quality and is great for portrait and landscape photography.\"),\n    (\"Nikon Z7 II\", 2999.99, 8, \"The Nikon Z7 II is a high-resolution full-frame mirrorless camera with a 45.7MP sensor. It excels in detail and dynamic range for professional use.\"),\n    (\"Sony A9 II\", 4499.99, 6, \"The Sony A9 II is a professional mirrorless camera designed for sports and wildlife photography. It features high-speed continuous shooting and advanced autofocus.\"),\n    (\"Fujifilm X-T3\", 1399.99, 14, \"The Fujifilm X-T3 is a versatile mirrorless camera with a 26.1MP sensor. It offers excellent video capabilities and a wide range of film simulation modes.\"),\n    (\"Olympus PEN E-PL10\", 649.99, 30, \"The Olympus PEN E-PL10 is a stylish and compact mirrorless camera. It features a variety of creative shooting modes and built-in Wi-Fi for easy sharing.\"),\n    (\"Canon EOS Rebel T8i\", 899.99, 20, \"The Canon EOS Rebel T8i is an entry-level DSLR camera with a 24.1MP sensor. It's user-friendly and perfect for beginners looking to explore photography.\"),\n    (\"Nikon D5600\", 699.99, 15, \"The Nikon D5600 is a compact DSLR with a 24.2MP sensor. It features a touchscreen and built-in Wi-Fi, making it easy to share your photos.\"),\n    (\"Sony A6000\", 548.00, 40, \"The Sony A6000 is a compact mirrorless camera with a 24.3MP sensor. Its fast autofocus and continuous shooting make it great for capturing action.\"),\n    (\"Panasonic Lumix FZ80\", 399.99, 50, \"The Panasonic Lumix FZ80 is a bridge camera with a powerful zoom lens. It features 4K video recording and is ideal for wildlife and sports photography.\"),\n    (\"Ricoh GR II\", 599.99, 20, \"The Ricoh GR II is a compact camera designed for street photography. Its large APS-C sensor delivers stunning images in a pocket-sized body.\"),\n    (\"GoPro HERO9 Black\", 399.99, 30, \"The GoPro HERO9 Black is an action camera that captures stunning 5K video and 20MP photos. It's perfect for adventure seekers and outdoor enthusiasts.\"),\n    (\"DJI Ronin-S\", 749.00, 10, \"The DJI Ronin-S is a handheld gimbal stabilizer designed for DSLR and mirrorless cameras. It offers smooth video stabilization for professional filmmakers.\"),\n    (\"Leica CL\", 2795.00, 7, \"The Leica CL is a compact mirrorless camera that combines classic design with modern technology. It offers exceptional image quality and a user-friendly interface.\"),\n    (\"Olympus OM-D E-M10 Mark III\", 649.99, 25, \"The Olympus OM-D E-M10 Mark III is a stylish mirrorless camera with in-body stabilization. It's perfect for everyday photography and travel.\"),\n    (\"Sony FX3\", 3899.99, 8, \"The Sony FX3 is a compact cinema camera designed for filmmakers. It features a full-frame sensor and advanced video capabilities, making it a versatile choice.\"),\n    (\"Nikon P1000\", 999.99, 15, \"The Nikon P1000 is a bridge camera with an incredible 125x optical zoom. It's perfect for capturing distant subjects with incredible detail.\"),\n    (\"Canon EOS R6\", 2499.99, 10, \"The Canon EOS R6 is a full-frame mirrorless camera that excels in low-light conditions. It offers fast autofocus and 20fps continuous shooting for action photography.\"),\n    (\"Fujifilm X-S10\", 999.99, 20, \"The Fujifilm X-S10 is a compact mirrorless camera with in-body image stabilization. It's user-friendly and perfect for both photography and videography.\"),\n    (\"Sony A7C\", 1799.99, 15, \"The Sony A7C is a compact full-frame mirrorless camera designed for travel. It features advanced autofocus and 4K video capabilities.\"),\n    (\"Panasonic Lumix G85\", 899.99, 18, \"The Panasonic Lumix G85 is a versatile mirrorless camera with dual image stabilization. It's great for both photography and videography in various conditions.\"),\n    (\"Ricoh Theta SC2\", 299.99, 30, \"The Ricoh Theta SC2 is a user-friendly 360-degree camera. It's perfect for capturing immersive photos and videos with ease.\"),\n    (\"DJI Mini 2\", 449.00, 25, \"The DJI Mini 2 is a lightweight drone that captures 4K video and 12MP photos. It's perfect for aerial photography and travel enthusiasts.\"),\n    (\"Leica Q-P\", 4995.00, 5, \"The Leica Q-P is a premium compact camera with a full-frame sensor and fixed 28mm lens. It offers exceptional image quality and a classic design.\"),\n    (\"Olympus Tough TG-5\", 379.99, 20, \"The Olympus Tough TG-5 is a rugged compact camera built for adventure. It's waterproof, shockproof, and features a bright lens for low-light conditions.\"),\n    (\"Canon EOS M200\", 599.99, 28, \"The Canon EOS M200 is a compact mirrorless camera designed for beginners. It features a user-friendly interface and excellent image quality.\"),\n    (\"Nikon Z fc\", 999.99, 15, \"The Nikon Z fc is a stylish mirrorless camera that combines retro design with modern features. It offers excellent image quality and a variety of creative options.\"),\n    (\"Sony A7S III\", 3499.99, 9, \"The Sony A7S III is a full-frame mirrorless camera designed for video creators. It features exceptional low-light performance and advanced video capabilities.\"),\n    (\"Fujifilm GFX 50S II\", 3999.00, 6, \"The Fujifilm GFX 50S II is a medium format camera that delivers stunning image quality. It's perfect for professional photographers seeking the highest detail.\"),\n    (\"Panasonic Lumix S1\", 1999.99, 12, \"The Panasonic Lumix S1 is a full-frame mirrorless camera with advanced video capabilities. It features dual image stabilization and a rugged design.\"),\n    (\"GoPro HERO8 Black\", 299.99, 30, \"The GoPro HERO8 Black is an action camera that captures stunning 4K video. It's compact and rugged, perfect for adventure seekers.\"),\n    (\"DJI Osmo Action\", 199.99, 40, \"The DJI Osmo Action is an action camera with dual screens and 4K video capabilities. It's designed for capturing immersive adventures.\"),\n    (\"Sigma 35mm F1.4 DG HSM Art Lens\", 849.99, 18, \"The Sigma 35mm F1.4 DG HSM Art Lens is known for its exceptional optical quality. It's perfect for portrait and low-light photography.\"),\n    (\"Tamron 28-75mm F2.8 Di III RXD Lens\", 879.99, 15, \"The Tamron 28-75mm F2.8 is a versatile zoom lens for Sony mirrorless cameras. It offers excellent image quality and a constant aperture.\"),\n    (\"Canon EF 50mm F1.8 STM Lens\", 125.00, 50, \"The Canon EF 50mm F1.8 STM Lens is a compact and affordable prime lens. It's perfect for portraits and low-light photography.\"),\n    (\"Nikon AF-S NIKKOR 24-70mm F2.8E ED VR Lens\", 1999.99, 8, \"The Nikon AF-S NIKKOR 24-70mm F2.8E ED VR Lens is a professional-grade zoom lens. It offers exceptional image quality and versatility for various shooting situations.\"),\n    (\"Sony FE 24-105mm F4 G OSS Lens\", 1398.00, 10, \"The Sony FE 24-105mm F4 G OSS Lens is a versatile zoom lens for full-frame mirrorless cameras. It offers excellent image quality and a constant aperture.\"),\n    (\"Fujifilm XF 18-55mm F2.8-4 R LM OIS Lens\", 699.99, 15, \"The Fujifilm XF 18-55mm F2.8-4 R LM OIS Lens is a compact and versatile zoom lens. It features optical image stabilization and is ideal for everyday photography.\"),\n    (\"Olympus M.Zuiko Digital ED 12-40mm F2.8 PRO Lens\", 999.99, 6, \"The Olympus M.Zuiko 12-40mm F2.8 PRO Lens is a professional-grade zoom lens. It's weather-sealed and offers excellent image quality.\"),\n    (\"Canon RF 85mm F1.2L USM Lens\", 2799.99, 4, \"The Canon RF 85mm F1.2L USM Lens is a premium portrait lens with stunning image quality. It features a fast aperture for beautiful bokeh.\"),\n    (\"Nikon Z 14-30mm F4 S Lens\", 1299.99, 5, \"The Nikon Z 14-30mm F4 S Lens is a wide-angle zoom lens for mirrorless cameras. It offers exceptional image quality and is compact for travel.\"),\n    (\"Sony FE 70-200mm F2.8 GM OSS Lens\", 2599.99, 3, \"The Sony FE 70-200mm F2.8 GM OSS Lens is a professional telephoto zoom lens. It delivers outstanding image quality and fast autofocus.\"),\n    (\"Tamron 70-180mm F2.8 Di III VXD Lens\", 1199.99, 7, \"The Tamron 70-180mm F2.8 Di III VXD Lens is a lightweight telephoto zoom lens for Sony cameras. It offers excellent image quality and fast autofocus.\"),\n    (\"Sigma 14-24mm F2.8 DG DN Art Lens\", 1299.99, 6, \"The Sigma 14-24mm F2.8 DG DN Art Lens is a wide-angle zoom lens for mirrorless cameras. It delivers exceptional optical performance and is ideal for landscapes.\"),\n    (\"Canon RF 24-70mm F2.8L IS USM Lens\", 2299.99, 5, \"The Canon RF 24-70mm F2.8L IS USM Lens is a professional-grade zoom lens. It features image stabilization and excellent image quality.\"),\n    (\"Nikon Z 24-200mm F4-6.3 VR Lens\", 999.99, 10, \"The Nikon Z 24-200mm F4-6.3 VR Lens is a versatile all-in-one zoom lens. It's perfect for travel and everyday photography.\"),\n    (\"Sony E 10-18mm F4 OSS Lens\", 848.00, 12, \"The Sony E 10-18mm F4 OSS Lens is a wide-angle zoom lens for APS-C mirrorless cameras. It's great for landscapes and architecture.\"),\n    (\"Fujifilm XF 50-140mm F2.8 R LM OIS WR Lens\", 1599.99, 5, \"The Fujifilm XF 50-140mm F2.8 R LM OIS WR Lens is a professional telephoto zoom lens. It features weather sealing and excellent image stabilization.\"),\n    (\"Olympus M.Zuiko Digital ED 45mm F1.8 Lens\", 399.99, 20, \"The Olympus M.Zuiko 45mm F1.8 Lens is a compact prime lens ideal for portraits. It offers beautiful bokeh and sharp images.\"),\n    (\"Canon EF 24-105mm F4L IS II USM Lens\", 1099.99, 8, \"The Canon EF 24-105mm F4L IS II USM Lens is a versatile zoom lens for full-frame DSLRs. It features image stabilization and excellent image quality.\"),\n    (\"Nikon AF-S NIKKOR 50mm F1.4G Lens\", 449.99, 10, \"The Nikon AF-S NIKKOR 50mm F1.4G Lens is a classic prime lens known for its sharpness. It's perfect for portraits and low-light photography.\"),\n    (\"Sony E 35mm F1.8 OSS Lens\", 448.00, 15, \"The Sony E 35mm F1.8 OSS Lens is a compact prime lens for APS-C mirrorless cameras. It offers excellent low-light performance and image stabilization.\"),\n    (\"Tamron 17-28mm F2.8 Di III RXD Lens\", 899.99, 12, \"The Tamron 17-28mm F2.8 Di III RXD Lens is a wide-angle zoom lens for Sony mirrorless cameras. It features a fast aperture and compact design.\"),\n    (\"Sigma 24-70mm F2.8 DG DN Art Lens\", 1199.99, 5, \"The Sigma 24-70mm F2.8 DG DN Art Lens is a professional-grade zoom lens. It delivers exceptional optical performance and is ideal for various photography styles.\"),\n    (\"Canon RF 15-35mm F2.8L IS USM Lens\", 2299.99, 4, \"The Canon RF 15-35mm F2.8L IS USM Lens is a wide-angle zoom lens for mirrorless cameras. It features image stabilization and excellent image quality.\"),\n    (\"Nikon Z 24-50mm F4-6.3 Lens\", 649.99, 10, \"The Nikon Z 24-50mm F4-6.3 Lens is a compact zoom lens for mirrorless cameras. It's lightweight and perfect for travel photography.\"),\n    (\"Sony FE 50mm F1.2 GM Lens\", 1998.00, 3, \"The Sony FE 50mm F1.2 GM Lens is a premium prime lens known for its stunning image quality. It features a fast aperture for beautiful bokeh.\"),\n    (\"Fujifilm XF 16-80mm F4 R OIS WR Lens\", 799.99, 8, \"The Fujifilm XF 16-80mm F4 R OIS WR Lens is a versatile zoom lens with weather resistance. It's perfect for travel and everyday photography.\"),\n    (\"Olympus M.Zuiko Digital ED 12-100mm F4 IS PRO Lens\", 1299.99, 5, \"The Olympus M.Zuiko 12-100mm F4 IS PRO Lens is a professional-grade zoom lens. It features in-body image stabilization and excellent versatility.\"),\n    (\"Canon RF 70-200mm F2.8L IS USM Lens\", 2699.99, 4, \"The Canon RF 70-200mm F2.8L IS USM Lens is a professional telephoto zoom lens. It offers outstanding image quality and fast autofocus.\"),\n    (\"Nikon Z 85mm F1.8 S Lens\", 799.99, 6, \"The Nikon Z 85mm F1.8 S Lens is a premium portrait lens with stunning image quality. It features a fast aperture for beautiful bokeh.\"),\n    (\"Sony E 16-55mm F2.8 G Lens\", 998.00, 10, \"The Sony E 16-55mm F2.8 G Lens is a versatile zoom lens for APS-C mirrorless cameras. It offers excellent image quality and a constant aperture.\"),\n    (\"Tamron 11-20mm F2.8 Di III-A RXD Lens\", 849.99, 5, \"The Tamron 11-20mm F2.8 Di III-A RXD Lens is a wide-angle zoom lens for Sony E-mount cameras. It features a fast aperture and compact design.\"),\n    (\"Sigma 105mm F2.8 DG DN Macro Art Lens\", 699.99, 7, \"The Sigma 105mm F2.8 DG DN Macro Art Lens is a professional macro lens. It delivers stunning detail and sharpness for close-up photography.\"),\n    (\"Canon RF 24mm F1.8 Macro IS STM Lens\", 599.99, 8, \"The Canon RF 24mm F1.8 Macro IS STM Lens is a versatile wide-angle lens. It features image stabilization and is great for macro photography.\"),\n    (\"Nikon Z 35mm F1.8 S Lens\", 849.99, 5, \"The Nikon Z 35mm F1.8 S Lens is a premium prime lens with exceptional image quality. It's perfect for street and portrait photography.\"),\n    (\"Sony FE 24mm F1.4 GM Lens\", 1398.00, 3, \"The Sony FE 24mm F1.4 GM Lens is a premium wide-angle lens known for its stunning optical performance. It features a fast aperture for low-light shooting.\"),\n    (\"Fujifilm XF 23mm F2 R WR Lens\", 449.99, 20, \"The Fujifilm XF 23mm F2 R WR Lens is a compact prime lens with weather resistance. It's perfect for street photography and everyday use.\"),\n]"