"[(\"Toothbrush\", 3.99, 150, \"A soft-bristled toothbrush designed to gently clean teeth and gums. Its ergonomic handle provides a comfortable grip for effective brushing.\"), \n (\"Toothpaste\", 2.49, 200, \"Fluoride toothpaste that helps prevent cavities and freshens breath. Its mint flavor leaves your mouth feeling clean and refreshed.\"), \n (\"Dental Floss\", 4.99, 100, \"Waxed dental floss that easily glides between teeth to remove plaque and food particles. Essential for maintaining gum health and preventing cavities.\"), \n (\"Mouthwash\", 5.99, 80, \"An alcohol-free mouthwash that kills germs and freshens breath. It provides a refreshing clean without the burn of traditional mouthwashes.\"), \n (\"Electric Toothbrush\", 49.99, 30, \"A rechargeable electric toothbrush with multiple cleaning modes for a personalized brushing experience. It features a timer to ensure optimal brushing time.\"), \n (\"Teeth Whitening Strips\", 29.99, 50, \"Whitening strips that help remove stains and brighten your smile in just a few applications. Easy to use and provide professional-level results at home.\"), \n (\"Interdental Brushes\", 7.99, 70, \"Small brushes designed to clean between teeth where traditional toothbrushes can't reach. Ideal for maintaining oral hygiene and preventing gum disease.\"), \n (\"Tongue Scraper\", 2.99, 120, \"A stainless steel tongue scraper that effectively removes bacteria and debris from the tongue's surface. Promotes fresher breath and better oral health.\"), \n (\"Dental Chews for Dogs\", 12.99, 40, \"Tasty dental chews that help reduce plaque and tartar buildup in dogs. They are made with natural ingredients and are safe for daily use.\"), \n (\"Fluoride Rinse\", 6.49, 60, \"A fluoride mouth rinse that strengthens enamel and helps prevent cavities. It has a pleasant flavor and is suitable for both adults and children.\"), \n (\"Whitening Toothpaste\", 4.99, 90, \"Toothpaste formulated to gently whiten teeth while protecting against cavities. Its unique formula helps remove surface stains for a brighter smile.\"), \n (\"Kids' Toothbrush\", 3.49, 150, \"A colorful toothbrush designed specifically for children, featuring fun characters. Its soft bristles are gentle on young teeth and gums.\"), \n (\"Kids' Toothpaste\", 2.99, 180, \"Fluoride toothpaste with a kid-friendly flavor that encourages good dental hygiene. It's safe for children and helps protect against cavities.\"), \n (\"Dental Care Kit\", 19.99, 50, \"A complete dental care kit that includes a toothbrush, toothpaste, floss, and mouthwash. Perfect for maintaining oral hygiene at home or on the go.\"), \n (\"Charcoal Toothpaste\", 5.49, 70, \"Activated charcoal toothpaste that helps whiten teeth and remove impurities. It provides a deep clean while being gentle on enamel.\"), \n (\"Electric Flosser\", 39.99, 25, \"An electric water flosser that effectively cleans between teeth and along the gum line. It is easy to use and provides a thorough clean.\"), \n (\"Sensitive Toothpaste\", 4.49, 100, \"Toothpaste specially formulated for sensitive teeth, providing relief from discomfort while cleaning effectively. It helps strengthen enamel and freshen breath.\"), \n (\"Toothbrush Holder\", 8.99, 90, \"A stylish toothbrush holder that keeps your toothbrushes organized and hygienic. Its modern design fits well in any bathroom decor.\"), \n (\"Teeth Cleaning Kit\", 24.99, 40, \"A professional teeth cleaning kit that includes tools for plaque removal and gum care. Ideal for at-home dental maintenance.\"), \n (\"Gum Care Gel\", 11.99, 60, \"A soothing gel designed to promote gum health and reduce inflammation. It can be applied directly to the gums for targeted relief.\"), \n (\"Dental Mirror\", 5.99, 80, \"A handy dental mirror that allows you to check your teeth and gums easily. It's a useful tool for maintaining oral hygiene.\"), \n (\"Breath Freshening Spray\", 3.49, 120, \"A portable breath freshening spray that instantly refreshes your breath. Perfect for on-the-go use after meals or snacks.\"), \n (\"Oral B Interdental Picks\", 4.99, 50, \"Interdental picks that make cleaning between teeth easy and effective. They are a great alternative to floss for those with tight spaces.\"), \n (\"Natural Toothpaste\", 6.99, 70, \"Organic toothpaste made with natural ingredients that cleans teeth without harsh chemicals. It provides a gentle clean and freshens breath.\"), \n (\"Dental Wax\", 2.49, 150, \"Wax that provides relief from braces and other dental appliances. It soothes irritation and protects sensitive areas in the mouth.\"), \n (\"Fluoride Varnish\", 15.99, 30, \"A professional fluoride varnish that helps strengthen teeth and prevent decay. It's applied by dentists for optimal results.\"), \n (\"Chewing Gum\", 1.99, 200, \"Sugar-free chewing gum that freshens breath while promoting saliva production. It's a great snack for maintaining oral health.\"), \n (\"Dental Sticks for Dogs\", 10.99, 40, \"Dental sticks that help clean your dog's teeth while they chew. Made with natural ingredients, they are a tasty treat for your furry friend.\"), \n (\"Teeth Whitening Pen\", 19.99, 35, \"A convenient teeth whitening pen that allows for targeted whitening on the go. It helps remove stains and brighten your smile.\"), \n (\"Toothbrush Sanitizer\", 29.99, 20, \"A UV toothbrush sanitizer that kills 99.9% of germs on your toothbrush. It ensures your toothbrush stays clean and hygienic.\"), \n (\"Gum Stimulator\", 6.49, 80, \"A gum stimulator that promotes healthy gums by increasing blood flow. It can be used alongside regular brushing and flossing.\"), \n (\"Dental Health Book\", 14.99, 50, \"An informative book about maintaining dental health and hygiene. It provides tips and advice for a healthy smile.\"), \n (\"Portable Water Flosser\", 39.99, 25, \"A compact water flosser that is perfect for travel. It provides a thorough clean and is easy to use anywhere.\"), \n (\"Breath Freshening Mints\", 2.99, 150, \"Sugar-free mints that freshen breath and are easy to carry. A perfect solution for quick freshness on the go.\"), \n (\"Coconut Oil Toothpaste\", 5.49, 70, \"Natural toothpaste made with coconut oil that helps whiten teeth and promote oral health. It's free from artificial additives.\"), \n (\"Dental Care Subscription Box\", 29.99, 30, \"A monthly subscription box that delivers dental care products to your doorstep. Each box includes a variety of essential items for oral hygiene.\"), \n (\"Toothbrush Travel Case\", 9.99, 60, \"A protective travel case for your toothbrush, keeping it clean and hygienic while on the go. It's compact and easy to carry.\"), \n (\"Enamel Repair Toothpaste\", 5.99, 90, \"Toothpaste designed to repair and strengthen enamel, protecting against sensitivity and decay. It provides a deep clean with every use.\"), \n (\"Xylitol Chewing Gum\", 3.49, 120, \"Chewing gum sweetened with xylitol that helps reduce cavities and freshen breath. It's a delicious way to support oral health.\"), \n (\"Dental Care App\", 0.00, 100, \"A free app that helps track your dental care routine and reminds you of appointments. It offers tips for maintaining your oral health.\"), \n (\"Tooth Stain Remover\", 15.99, 40, \"A specialized gel that targets and removes stubborn tooth stains. It helps restore your natural tooth color effectively.\"), \n (\"Herbal Mouthwash\", 7.99, 70, \"A natural mouthwash made with herbal ingredients that freshens breath and promotes gum health. It's free from artificial flavors.\"), \n (\"Teeth Grinding Guard\", 29.99, 30, \"A custom-fit teeth grinding guard that protects your teeth from damage during sleep. It provides comfort and relief from jaw tension.\"), \n (\"Tongue Cleaner\", 3.99, 100, \"A plastic tongue cleaner that helps remove bacteria and debris from the tongue. It's an easy addition to your daily oral care routine.\"), \n (\"Dental Insurance Plan\", 0.00, 100, \"An affordable dental insurance plan that covers preventive care and treatments. It ensures you have access to quality dental services.\"), \n (\"Flavored Dental Floss\", 4.49, 90, \"Flavored dental floss that makes flossing a more enjoyable experience. It effectively removes plaque while leaving a fresh taste.\"), \n (\"Toothbrush with Timer\", 12.99, 50, \"A toothbrush equipped with a timer to ensure you brush for the recommended two minutes. It helps improve your brushing habits.\"), \n (\"Mouth Guard for Sports\", 14.99, 40, \"A protective mouth guard designed for athletes to prevent dental injuries. It offers a comfortable fit and maximum protection.\"), \n (\"Herbal Toothpaste\", 6.49, 80, \"Toothpaste made with herbal ingredients that naturally clean teeth and freshen breath. It's a great alternative for those seeking natural products.\"), \n (\"Eco-Friendly Toothbrush\", 4.99, 100, \"A biodegradable toothbrush made from sustainable materials. It provides effective cleaning while being environmentally friendly.\"), \n (\"Dental Care Planner\", 9.99, 50, \"A planner designed to help you track your dental appointments and care routines. It's a great tool for maintaining oral health.\"), \n (\"Charcoal Mouthwash\", 8.99, 60, \"A mouthwash infused with activated charcoal that helps detoxify the mouth and whiten teeth. It provides a refreshing clean.\"), \n (\"Dental Hygiene Stickers\", 3.49, 150, \"Fun stickers that encourage kids to brush and floss regularly. They make dental hygiene a fun and engaging activity.\"), \n (\"Teeth Cleaning Wipes\", 5.99, 80, \"Convenient wipes that help clean teeth and freshen breath on the go. They are perfect for travel or after meals.\"), \n (\"Natural Mouthwash\", 7.49, 70, \"A mouthwash made with all-natural ingredients that promotes oral health without harsh chemicals. It leaves your mouth feeling fresh.\"), \n (\"Sugar-Free Tooth Candy\", 2.99, 150, \"Delicious sugar-free candy that helps freshen breath and is safe for your teeth. A sweet treat without the guilt.\"), \n (\"Dental Hygiene Course\", 0.00, 100, \"An online course that provides education on proper dental hygiene practices. It's suitable for all ages and promotes healthy habits.\"), \n (\"Toothbrush Timer App\", 0.00, 100, \"A free app that helps you time your brushing sessions for optimal oral care. It includes reminders and tips for better brushing.\"), \n (\"Sensitive Mouthwash\", 5.49, 90, \"A gentle mouthwash formulated for sensitive mouths, providing relief while freshening breath. It is alcohol-free and soothing.\"), \n (\"Toothpaste Dispenser\", 9.99, 50, \"A convenient toothpaste dispenser that helps you get the right amount every time. It reduces waste and keeps your bathroom tidy.\"), \n (\"Dental Health Tracker\", 0.00, 100, \"An app that tracks your dental health and reminds you of upcoming appointments. It provides personalized tips for maintaining oral hygiene.\"), \n (\"Floss Picks\", 3.99, 150, \"Easy-to-use floss picks that make flossing quick and convenient. They are perfect for on-the-go dental care.\"), \n (\"Breath Freshening Strips\", 4.49, 90, \"Thin strips that dissolve in your mouth to freshen breath instantly. They are portable and easy to use anywhere.\"), \n (\"Non-Alcoholic Mouthwash\", 6.99, 70, \"A mouthwash that provides a refreshing clean without the sting of alcohol. It is suitable for all ages.\"), \n (\"Teeth Whitening Kit\", 39.99, 25, \"A complete teeth whitening kit that includes everything you need for a brighter smile at home. It offers professional results in a convenient package.\"), \n (\"Bamboo Toothbrush\", 3.99, 150, \"An eco-friendly bamboo toothbrush that is biodegradable and sustainable. It provides effective cleaning while being kind to the planet.\"), \n (\"Dental Care Gift Set\", 29.99, 40, \"A thoughtful gift set that includes essential dental care products for a complete oral hygiene routine. Perfect for friends and family.\"), \n (\"Toothpaste Tablets\", 9.99, 60, \"Innovative toothpaste tablets that are easy to use and great for travel. They provide a fresh clean without the mess of traditional toothpaste.\"), \n (\"Portable Flossing Device\", 24.99, 30, \"A compact and portable flossing device that makes it easy to maintain oral hygiene on the go. It is battery-operated and user-friendly.\"), \n (\"Herbal Breath Spray\", 5.99, 80, \"A natural breath spray made with herbal extracts that freshens breath instantly. It's a great alternative to traditional breath mints.\"), \n (\"Dental Care Rewards Program\", 0.00, 100, \"A rewards program that offers points for regular dental check-ups and good oral hygiene practices. Redeem points for discounts on dental products.\"), \n (\"Toothbrush and Toothpaste Combo\", 8.99, 90, \"A convenient combo pack that includes a toothbrush and toothpaste for a complete dental care solution. Perfect for travel or everyday use.\"), \n (\"Plaque Disclosing Tablets\", 4.99, 70, \"Tablets that help reveal plaque on teeth, making it easier to see areas that need more attention. They are a fun way to encourage better brushing habits.\"), \n (\"Dental Care Journal\", 14.99, 50, \"A journal designed to help you track your dental health and care routines. It includes tips for maintaining a healthy smile.\"), \n (\"Toothbrush with Replaceable Heads\", 12.99, 50, \"A toothbrush designed with replaceable heads to reduce waste. It offers effective cleaning while being environmentally friendly.\"), \n (\"Sugar-Free Breath Spray\", 3.99, 150, \"A sugar-free breath spray that freshens breath instantly without any calories. It's perfect for those looking to maintain their oral health.\"), \n (\"Organic Mouthwash\", 8.49, 70, \"An organic mouthwash made with natural ingredients that promotes oral health and freshens breath. It's free from artificial additives.\"), \n (\"Toothbrush with Pressure Sensor\", 29.99, 30, \"An electric toothbrush that features a pressure sensor to prevent over-brushing. It helps protect gums while ensuring a thorough clean.\"), \n (\"Kids' Floss Picks\", 3.49, 120, \"Fun and colorful floss picks designed for kids to make flossing enjoyable. They are easy to use and promote good dental habits.\"), \n (\"Dental Care Workshop\", 0.00, 100, \"A free workshop focused on educating individuals about dental care and hygiene. It covers essential topics for maintaining a healthy smile.\"), \n (\"Toothbrush with Tongue Cleaner\", 9.99, 60, \"A toothbrush that includes a built-in tongue cleaner for comprehensive oral hygiene. It helps freshen breath and maintain overall dental health.\"), \n (\"Breath Freshening Gel\", 7.99, 70, \"A gel that freshens breath and can be applied directly to the tongue or gums. It offers long-lasting freshness in a convenient format.\"), \n (\"Dental Care Checklist\", 0.00, 100, \"A printable checklist that helps you keep track of your dental care routine. It includes reminders for brushing, flossing, and dental visits.\"), \n (\"Teeth Cleaning Spray\", 5.49, 90, \"A spray designed to help clean teeth and freshen breath quickly. It's perfect for use after meals or snacks when brushing isn't possible.\"), \n (\"Toothbrush with Built-in Timer\", 12.99, 50, \"A toothbrush that features a built-in timer to help you brush for the recommended duration. It encourages better brushing habits.\"), \n (\"Dental Care Rewards App\", 0.00, 100, \"An app that allows you to track your dental care routine and earn rewards for good habits. It includes reminders for appointments and tips for oral health.\")]"