"products = [\n    (\"Kindle Paperwhite\", 129.99, 150, \"The Kindle Paperwhite features a high-resolution display that reads like real paper, even in bright sunlight. With a waterproof design, it's perfect for reading by the pool or at the beach.\"),\n    (\"Kobo Clara HD\", 109.99, 80, \"The Kobo Clara HD offers a customizable reading experience with adjustable front light and various font sizes. Its compact design makes it easy to carry anywhere.\"),\n    (\"Nook GlowLight 3\", 119.99, 70, \"The Nook GlowLight 3 combines an easy-to-read display with a comfortable design for long reading sessions. It includes built-in access to a vast library of eBooks.\"),\n    (\"Amazon Kindle Oasis\", 249.99, 40, \"The Kindle Oasis is designed for avid readers, featuring a larger screen and ergonomic design. Its adjustable warm light makes reading comfortable in any lighting.\"),\n    (\"Kobo Libra H2O\", 169.99, 60, \"The Kobo Libra H2O is waterproof and features a 7-inch display with ComfortLight for reading in any environment. It supports multiple file formats for versatile reading options.\"),\n    (\"PocketBook InkPad 3\", 199.99, 30, \"The PocketBook InkPad 3 boasts a large 7.8-inch display with a high-resolution screen for an enhanced reading experience. It supports a wide range of eBook formats and has a built-in dictionary.\"),\n    (\"Onyx Boox Nova 3\", 299.99, 20, \"The Onyx Boox Nova 3 is a powerful e-reader with a 10.3-inch display and Android operating system for added functionality. It allows for note-taking and supports various apps.\"),\n    (\"Barnes & Noble Nook Tablet 10\", 199.99, 50, \"The Nook Tablet 10 combines the features of a tablet and an e-reader, offering access to a vast library of books and apps. Its HD display is perfect for both reading and streaming.\"),\n    (\"Kindle Kids Edition\", 109.99, 100, \"The Kindle Kids Edition comes with a kid-friendly cover and a year of Amazon Kids+. It's designed to encourage a love for reading with parental controls and a built-in dictionary.\"),\n    (\"Kobo Forma\", 249.99, 25, \"The Kobo Forma features a large, lightweight design with an ergonomic grip for comfortable reading. Its adjustable front light makes it ideal for any reading environment.\"),\n    (\"Amazon Fire HD 10\", 149.99, 40, \"The Fire HD 10 is a versatile tablet that doubles as an e-reader, featuring a vibrant display and access to a wide range of apps. Its long battery life ensures hours of reading enjoyment.\"),\n    (\"Kindle Scribe\", 339.99, 15, \"The Kindle Scribe is the first Kindle designed for reading and writing, featuring a large screen and stylus. It's perfect for taking notes directly on your eBooks.\"),\n    (\"Kobo Elipsa\", 399.99, 10, \"The Kobo Elipsa is an all-in-one e-reader and note-taking device with a 10.3-inch screen. It allows users to read, annotate, and organize their notes seamlessly.\"),\n    (\"ReMarkable 2\", 399.99, 5, \"The ReMarkable 2 is a digital paper tablet that feels like writing on real paper. It’s designed for note-taking, sketching, and reading documents.\"),\n    (\"Sony DPT-CP1\", 599.99, 8, \"The Sony DPT-CP1 is a premium e-paper tablet with a 10.3-inch display, ideal for reading and annotating PDFs. Its lightweight design makes it easy to carry.\"),\n    (\"Kobo Nia\", 99.99, 120, \"The Kobo Nia is an affordable e-reader with a 6-inch display and ComfortLight feature. It provides access to millions of eBooks and a simple user interface.\"),\n    (\"Kindle Fire HD 8\", 89.99, 90, \"The Kindle Fire HD 8 is a compact tablet that also serves as an e-reader, featuring a bright display and a wide range of content. Its portable size makes it perfect for travel.\"),\n    (\"PocketBook Touch HD 3\", 169.99, 45, \"The PocketBook Touch HD 3 offers a 6-inch display with a front light and a customizable interface. It supports various eBook formats and has a built-in audio player.\"),\n    (\"Barnes & Noble Nook GlowLight Plus\", 199.99, 35, \"The Nook GlowLight Plus features a waterproof design and a high-resolution display for an enhanced reading experience. It's perfect for reading in any environment.\"),\n    (\"Kindle Fire HD 7\", 79.99, 95, \"The Kindle Fire HD 7 is an entry-level tablet that provides access to eBooks, games, and apps. Its affordable price makes it a great choice for casual readers.\"),\n    (\"Kobo Aura Edition 2\", 129.99, 55, \"The Kobo Aura Edition 2 offers a sleek design and ComfortLight for reading in low-light conditions. It's lightweight and easy to navigate, making it user-friendly.\"),\n    (\"Kindle Voyage\", 199.99, 30, \"The Kindle Voyage features a high-resolution display and adaptive front light for optimal reading conditions. Its premium design makes it a favorite among book lovers.\"),\n    (\"Amazon Kindle\", 89.99, 100, \"The basic Amazon Kindle offers an affordable way to enjoy eBooks with a glare-free display. It's lightweight and easy to use, making it perfect for new readers.\"),\n    (\"Kobo Glo HD\", 129.99, 40, \"The Kobo Glo HD features a high-definition display and ComfortLight for reading at night. It supports numerous eBook formats for versatile reading options.\"),\n    (\"Nook Tablet 7\", 49.99, 150, \"The Nook Tablet 7 is an affordable tablet that provides access to eBooks and apps. Its compact size makes it great for reading on the go.\"),\n    (\"Kindle Oasis 32GB\", 289.99, 20, \"The Kindle Oasis 32GB offers ample storage for thousands of books. Its ergonomic design and warm light feature make it perfect for long reading sessions.\"),\n    (\"Kobo Aura H2O\", 179.99, 25, \"The Kobo Aura H2O is waterproof and features a large display for an immersive reading experience. It supports multiple formats, including EPUB and PDF.\"),\n    (\"PocketBook InkPad Color\", 249.99, 15, \"The PocketBook InkPad Color features a 7.8-inch color display, perfect for reading comics and magazines. It supports various file formats for flexibility.\"),\n    (\"Kindle Fire HD 10 Plus\", 189.99, 30, \"The Kindle Fire HD 10 Plus offers a larger display and enhanced performance for reading and streaming. Its long battery life ensures you can enjoy it all day.\"),\n    (\"Kobo Libra 2\", 169.99, 50, \"The Kobo Libra 2 features a 7-inch display and is waterproof, making it perfect for reading anywhere. Its adjustable light helps you read comfortably in any condition.\"),\n    (\"Barnes & Noble Nook GlowLight 4\", 199.99, 20, \"The Nook GlowLight 4 features a sleek design and a high-resolution display for an enjoyable reading experience. It provides easy access to a vast library of eBooks.\"),\n    (\"Kindle Paperwhite Signature Edition\", 189.99, 10, \"The Kindle Paperwhite Signature Edition features wireless charging and auto-adjusting front light. It's designed for avid readers who want the best reading experience.\"),\n    (\"Kobo Elipsa 2E\", 399.99, 8, \"The Kobo Elipsa 2E offers a large screen for reading and note-taking. It supports various eBook formats and features a stylus for easy annotation.\"),\n    (\"Onyx Boox Poke 3\", 199.99, 25, \"The Onyx Boox Poke 3 is a compact e-reader with a 6-inch display and Android OS. It provides access to a wide range of apps and eBook formats.\"),\n    (\"Amazon Kindle Fire HD 8 Plus\", 139.99, 35, \"The Kindle Fire HD 8 Plus is a powerful tablet that also serves as an e-reader. Its vibrant display and extensive app support make it perfect for entertainment.\"),\n    (\"Kobo Nia 8GB\", 99.99, 100, \"The Kobo Nia 8GB is an entry-level e-reader with a comfortable design and easy navigation. It provides access to millions of eBooks at your fingertips.\"),\n    (\"Kindle Oasis 64GB\", 349.99, 10, \"The Kindle Oasis 64GB offers extensive storage for your eBook library. Its ergonomic design and adjustable warm light make it perfect for nighttime reading.\"),\n    (\"PocketBook Touch Lux 5\", 159.99, 40, \"The PocketBook Touch Lux 5 features a 6-inch display with a front light for easy reading. It supports multiple eBook formats and has a built-in dictionary.\"),\n    (\"Barnes & Noble Nook Color\", 149.99, 30, \"The Nook Color is a versatile tablet that doubles as an e-reader, offering access to a vast library of books and apps. Its colorful display makes reading enjoyable.\"),\n    (\"Kindle Fire HD 10 Kids Edition\", 199.99, 15, \"The Kindle Fire HD 10 Kids Edition is designed for young readers, featuring parental controls and a durable case. It includes a year of Amazon Kids+ for endless reading options.\"),\n    (\"Kobo Clara 2E\", 129.99, 50, \"The Kobo Clara 2E is made from recycled materials and features a 6-inch display. Its adjustable light and waterproof design make it perfect for any reading adventure.\"),\n    (\"Amazon Kindle Paperwhite 11th Gen\", 139.99, 45, \"The Kindle Paperwhite 11th Gen features a 6.8-inch display and adjustable warm light. It's designed for comfortable reading in any environment.\"),\n    (\"Kobo Aura One\", 229.99, 12, \"The Kobo Aura One features a large 7.8-inch display and is waterproof, making it perfect for reading by the pool. It includes a ComfortLight for nighttime reading.\"),\n    (\"Kindle Fire HD 8 Kids Edition\", 139.99, 20, \"The Kindle Fire HD 8 Kids Edition is perfect for young readers, featuring a kid-friendly interface and parental controls. It comes with a durable case and a year of Amazon Kids+.\"),\n    (\"PocketBook InkPad 4\", 199.99, 15, \"The PocketBook InkPad 4 features a large 10.3-inch display for an immersive reading experience. It supports various formats and includes a built-in audio player.\"),\n    (\"Nook GlowLight 3 Special Edition\", 129.99, 25, \"The Nook GlowLight 3 Special Edition features a unique design and adjustable light for comfortable reading. It includes access to a vast library of eBooks.\"),\n    (\"Kindle Fire HD 10 32GB\", 159.99, 30, \"The Kindle Fire HD 10 32GB offers ample storage for books, apps, and media. Its vibrant display and long battery life make it perfect for entertainment.\"),\n    (\"Kobo Libra H2O 32GB\", 189.99, 10, \"The Kobo Libra H2O 32GB features a waterproof design and a large display for an enjoyable reading experience. It supports multiple formats for versatile reading.\"),\n    (\"Amazon Kindle Fire HD 8 Plus 64GB\", 179.99, 15, \"The Kindle Fire HD 8 Plus 64GB is a powerful tablet that serves as an e-reader. Its extensive app support and vibrant display make it perfect for entertainment.\"),\n    (\"PocketBook Touch HD 3 16GB\", 169.99, 20, \"The PocketBook Touch HD 3 16GB offers a 6-inch display with adjustable front light. It supports various eBook formats and has a built-in audio player.\"),\n    (\"Barnes & Noble Nook Tablet 10.1\", 199.99, 10, \"The Nook Tablet 10.1 offers a large display and access to a vast library of eBooks and apps. Its powerful performance makes it great for reading and entertainment.\"),\n    (\"Kindle Scribe 64GB\", 389.99, 8, \"The Kindle Scribe 64GB is perfect for readers and writers, featuring a large display and stylus. It allows for seamless note-taking and reading.\"),\n    (\"Kobo Elipsa 32GB\", 349.99, 5, \"The Kobo Elipsa 32GB combines reading and note-taking functionality with a large display. It supports various eBook formats and includes a stylus for easy annotation.\"),\n    (\"Onyx Boox Max Lumi\", 599.99, 3, \"The Onyx Boox Max Lumi features a massive 13.3-inch display for reading and annotating documents. Its Android OS allows for extensive app support.\"),\n    (\"Kindle Fire HD 10 64GB\", 179.99, 10, \"The Kindle Fire HD 10 64GB is a powerful tablet that provides ample storage for books and media. Its long battery life and vibrant display enhance your reading experience.\"),\n    (\"Kobo Clara HD 16GB\", 129.99, 20, \"The Kobo Clara HD 16GB features a high-resolution display and adjustable light for comfortable reading. It's lightweight and easy to use, making it perfect for any reader.\"),\n    (\"Barnes & Noble Nook GlowLight 4e\", 199.99, 15, \"The Nook GlowLight 4e features a sleek design and a high-resolution display for an enjoyable reading experience. It provides access to a vast library of eBooks.\"),\n]"