"products = [\n    (\"CityCruiser E-Scooter\", 499.99, 30, \"The CityCruiser is designed for urban commuting with a lightweight frame and fast charging capabilities. Its compact design allows for easy storage and transport.\"),\n    (\"Speedster Pro Electric Scooter\", 799.99, 25, \"Experience the thrill of speed with the Speedster Pro, offering a powerful motor and high-speed performance. Ideal for adventurous riders looking to cover long distances quickly.\"),\n    (\"EcoRide E-Scooter\", 349.99, 40, \"The EcoRide is an environmentally friendly option, featuring a low-energy motor and sustainable materials. Perfect for eco-conscious commuters who want to reduce their carbon footprint.\"),\n    (\"Urban Glide 3000\", 599.99, 20, \"The Urban Glide 3000 combines style and performance, making it perfect for city dwellers. With its smooth ride and robust build, it handles rough terrain with ease.\"),\n    (\"SmartFold Electric Scooter\", 399.99, 35, \"The SmartFold offers a unique folding design for easy portability, making it a great choice for commuters. Its smart technology includes app connectivity for tracking rides.\"),\n    (\"Racer X Electric Scooter\", 899.99, 15, \"The Racer X is built for speed enthusiasts, featuring advanced suspension and high-performance tires. Experience unmatched acceleration and agility on your rides.\"),\n    (\"Commuter Buddy E-Scooter\", 299.99, 50, \"The Commuter Buddy is a budget-friendly option designed for daily use. Its durable construction and reliable battery life make it a dependable choice for city travel.\"),\n    (\"Adventure E-Scooter\", 749.99, 10, \"The Adventure E-Scooter is designed for off-road enthusiasts, featuring rugged tires and a powerful motor. Tackle any terrain with confidence and ease.\"),\n    (\"Lightweight Urban E-Scooter\", 249.99, 60, \"This lightweight scooter is perfect for quick trips around town. Its compact design and easy handling make it suitable for riders of all ages.\"),\n    (\"Luxury Ride Electric Scooter\", 1,199.99, 5, \"Indulge in the ultimate riding experience with the Luxury Ride, featuring premium materials and cutting-edge technology. Enjoy a smooth and comfortable journey every time.\"),\n    (\"Pioneer E-Scooter\", 449.99, 45, \"The Pioneer is an all-around scooter suitable for both beginners and experienced riders. Its user-friendly features and sturdy build ensure a safe and enjoyable ride.\"),\n    (\"Metro E-Scooter\", 379.99, 55, \"The Metro E-Scooter is designed for urban environments, offering a sleek look and efficient performance. It is perfect for navigating through busy streets.\"),\n    (\"Family Fun Electric Scooter\", 599.99, 20, \"The Family Fun scooter is designed for shared enjoyment, featuring a spacious deck and dual seating. Perfect for family outings and leisurely rides.\"),\n    (\"Zippy E-Scooter\", 299.99, 50, \"The Zippy E-Scooter is perfect for quick errands, featuring a compact design and lightweight frame. Its agile handling makes it a favorite among city riders.\"),\n    (\"SleekRide E-Scooter\", 499.99, 30, \"The SleekRide combines elegance with performance, offering a smooth and stylish ride. Ideal for those who appreciate aesthetics without compromising on functionality.\"),\n    (\"All-Terrain Electric Scooter\", 699.99, 15, \"The All-Terrain scooter is built to handle diverse landscapes, from city streets to rugged trails. Its robust construction ensures durability in all conditions.\"),\n    (\"Youth E-Scooter\", 199.99, 70, \"Designed specifically for younger riders, this scooter features safety features and a lightweight build. It's perfect for kids to enjoy outdoor adventures safely.\"),\n    (\"Cruise Control E-Scooter\", 599.99, 25, \"The Cruise Control offers a unique speed control feature for a relaxed ride. It's perfect for leisurely trips around the neighborhood or park.\"),\n    (\"Compact Commuter E-Scooter\", 349.99, 40, \"The Compact Commuter is ideal for those with limited storage space, folding easily for transport. Its efficient motor provides a reliable ride for daily commutes.\"),\n    (\"Electric Scooter for Seniors\", 399.99, 30, \"This scooter is designed with seniors in mind, featuring a comfortable seat and easy controls. It ensures a safe and enjoyable riding experience for older adults.\"),\n    (\"High-Performance E-Scooter\", 899.99, 10, \"The High-Performance E-Scooter is for thrill-seekers, equipped with a powerful motor and advanced suspension. Experience the rush of high speeds and smooth rides.\"),\n    (\"Budget-Friendly E-Scooter\", 249.99, 60, \"This budget-friendly option offers reliability without breaking the bank. It's perfect for those looking to explore their surroundings on a budget.\"),\n    (\"TravelMate Electric Scooter\", 549.99, 20, \"The TravelMate is designed for those who love to explore, featuring a long-range battery and durable construction. Perfect for weekend getaways and adventures.\"),\n    (\"Sporty E-Scooter\", 699.99, 15, \"The Sporty E-Scooter combines performance with style, featuring a sleek design and powerful acceleration. Ideal for riders looking to make a statement.\"),\n    (\"Electric Scooter with Bluetooth\", 399.99, 35, \"Stay connected on the go with this electric scooter featuring Bluetooth connectivity. Enjoy music and navigation while riding in style.\"),\n    (\"Urban Explorer E-Scooter\", 499.99, 30, \"The Urban Explorer is perfect for those who love to discover new places, featuring a sturdy frame and comfortable ride. Ideal for city adventures and sightseeing.\"),\n    (\"Electric Scooter with LED Lights\", 349.99, 40, \"This scooter comes equipped with bright LED lights for enhanced visibility at night. It's perfect for evening rides and adds a touch of style.\"),\n    (\"Family Cruiser Electric Scooter\", 799.99, 10, \"The Family Cruiser offers ample space for two riders, making it perfect for family outings. Enjoy quality time together while exploring your neighborhood.\"),\n    (\"Eco-Friendly Commuter E-Scooter\", 299.99, 50, \"This eco-friendly scooter is made from sustainable materials and features a low-energy motor. It's an ideal choice for environmentally conscious commuters.\"),\n    (\"Ultimate Comfort E-Scooter\", 599.99, 20, \"Experience unparalleled comfort with the Ultimate Comfort E-Scooter, featuring a cushioned seat and ergonomic design. Perfect for long rides around town.\"),\n    (\"Mini E-Scooter\", 199.99, 70, \"The Mini E-Scooter is compact and lightweight, making it easy to carry and store. It's a great option for short trips and quick errands.\"),\n    (\"Electric Scooter with Removable Battery\", 399.99, 35, \"This scooter features a removable battery for convenient charging and extended range. Perfect for riders who need flexibility in their commuting.\"),\n    (\"Adventure Series E-Scooter\", 749.99, 15, \"The Adventure Series is built for those who love off-road riding, featuring rugged tires and a powerful motor. Tackle any trail with confidence and ease.\"),\n    (\"Smart E-Scooter\", 499.99, 30, \"The Smart E-Scooter features advanced technology, including GPS tracking and smartphone integration. Stay connected and informed while you ride.\"),\n    (\"Electric Scooter with Extra Storage\", 349.99, 40, \"This scooter comes with additional storage options, making it perfect for carrying essentials. Ideal for commuting and running errands.\"),\n    (\"Rugged Terrain E-Scooter\", 699.99, 10, \"Designed for rugged terrains, this electric scooter features heavy-duty tires and a robust frame. Conquer any landscape with ease and confidence.\"),\n    (\"Portable E-Scooter\", 299.99, 50, \"The Portable E-Scooter is lightweight and easy to fold, making it perfect for commuters. Its compact design allows for hassle-free transportation.\"),\n    (\"Electric Scooter with Smart Display\", 399.99, 35, \"This scooter features a smart display to monitor speed, battery life, and distance traveled. Stay informed while enjoying your ride.\"),\n    (\"Urban Cruiser E-Scooter\", 549.99, 20, \"The Urban Cruiser combines comfort and style, making it perfect for city rides. Its sleek design and smooth handling are sure to impress.\"),\n    (\"Electric Scooter for Kids\", 199.99, 70, \"This kid-friendly electric scooter features safety features and a fun design. It's perfect for young riders looking to explore their neighborhood.\"),\n    (\"Long Range Electric Scooter\", 799.99, 15, \"The Long Range Electric Scooter is designed for extended rides, featuring a high-capacity battery. Perfect for those who love to travel far.\"),\n    (\"Electric Scooter with Adjustable Seat\", 399.99, 35, \"This scooter features an adjustable seat for added comfort during rides. Ideal for riders of various heights and preferences.\"),\n    (\"Compact Electric Scooter\", 249.99, 60, \"The Compact Electric Scooter is perfect for urban environments, offering a slim design and easy maneuverability. It's great for quick trips around town.\"),\n    (\"Electric Scooter with Anti-Lock Brakes\", 499.99, 30, \"Stay safe with the Anti-Lock Brakes feature on this electric scooter. Ideal for riders who prioritize safety without sacrificing performance.\"),\n    (\"Stylish E-Scooter\", 599.99, 20, \"The Stylish E-Scooter features a modern design and vibrant colors, making it a standout choice. Enjoy a fashionable ride while commuting.\"),\n    (\"Electric Scooter with Suspension\", 399.99, 35, \"This scooter features advanced suspension for a smoother ride over bumps and uneven surfaces. Perfect for urban commuting and recreational riding.\"),\n    (\"Electric Scooter with Fast Charging\", 349.99, 40, \"Enjoy the convenience of fast charging with this electric scooter, allowing you to get back on the road quickly. Ideal for busy commuters.\"),\n    (\"Electric Scooter with Bluetooth Speakers\", 499.99, 30, \"This scooter features built-in Bluetooth speakers, allowing you to enjoy music while you ride. Perfect for those who love to ride in style.\"),\n    (\"Electric Scooter for Commuters\", 299.99, 50, \"Designed specifically for commuters, this scooter offers a reliable ride and easy handling. It's perfect for navigating busy streets.\"),\n    (\"Electric Scooter with LED Display\", 399.99, 35, \"The LED display on this scooter provides real-time information on speed and battery life. Stay informed and enjoy your ride with confidence.\"),\n    (\"Electric Scooter with High Weight Capacity\", 599.99, 20, \"This scooter is designed to support a higher weight capacity, making it suitable for a wider range of riders. Enjoy a sturdy and reliable ride.\"),\n    (\"Electric Scooter with Safety Lights\", 349.99, 40, \"Stay visible and safe with the built-in safety lights on this electric scooter. Ideal for evening rides and enhancing overall safety.\"),\n    (\"Electric Scooter with Puncture-Resistant Tires\", 499.99, 30, \"This scooter features puncture-resistant tires, ensuring a worry-free ride on various surfaces. Perfect for those who ride frequently.\"),\n    (\"Electric Scooter with GPS Tracking\", 599.99, 20, \"Stay on track with the GPS tracking feature on this electric scooter. Ideal for riders who want to monitor their routes and distances.\"),\n    (\"Electric Scooter with Child Seat\", 399.99, 35, \"This scooter comes with a child seat attachment, making it perfect for family rides. Enjoy quality time together while exploring your surroundings.\"),\n    (\"Electric Scooter with Dual Motors\", 799.99, 10, \"Experience enhanced power and performance with dual motors on this electric scooter. Perfect for tackling steep hills and rough terrains.\"),\n    (\"Electric Scooter with Customizable Colors\", 299.99, 50, \"This scooter allows you to customize colors and designs, making it a unique choice for riders. Express your personality while enjoying the ride.\"),\n    (\"Electric Scooter with Smart Lock\", 399.99, 35, \"Keep your scooter secure with the smart lock feature, providing peace of mind while parked. Ideal for urban environments where security is a concern.\"),\n    (\"Electric Scooter with Extended Warranty\", 499.99, 30, \"This scooter comes with an extended warranty for added assurance. Ideal for riders looking for a reliable and long-lasting option.\"),\n    (\"Electric Scooter with App Integration\", 349.99, 40, \"Enjoy app integration with this electric scooter, allowing you to track rides and monitor performance. Perfect for tech-savvy riders.\"),\n    (\"Electric Scooter with Comfortable Grips\", 399.99, 35, \"This scooter features comfortable grips for a better riding experience. Ideal for long rides and ensuring comfort during commutes.\"),\n    (\"Electric Scooter with High Visibility\", 299.99, 50, \"Stay safe with this high-visibility electric scooter, designed for urban riding. Its bright colors and reflective materials enhance safety.\"),\n    (\"Electric Scooter with Easy Assembly\", 249.99, 60, \"This scooter is designed for easy assembly, allowing you to get on the road quickly. Perfect for those who want a hassle-free setup.\"),\n    (\"Electric Scooter with Water Resistance\", 399.99, 35, \"Ride with confidence in various weather conditions with this water-resistant electric scooter. Ideal for those who ride year-round.\"),\n    (\"Electric Scooter with Enhanced Stability\", 499.99, 30, \"Experience enhanced stability with this electric scooter, designed for a smooth ride. Perfect for riders seeking comfort and control.\"),\n    (\"Electric Scooter with Adjustable Speed Settings\", 349.99, 40, \"This scooter features adjustable speed settings, allowing riders to customize their experience. Ideal for beginners and experienced riders alike.\"),\n    (\"Electric Scooter with Ergonomic Design\", 599.99, 20, \"The ergonomic design of this scooter ensures comfort during long rides. Perfect for commuters looking for a reliable and comfortable option.\"),\n    (\"Electric Scooter with High Torque Motor\", 699.99, 15, \"Experience powerful acceleration with the high torque motor on this electric scooter. Ideal for riders who enjoy a thrilling ride.\"),\n    (\"Electric Scooter with Child-Friendly Features\", 199.99, 70, \"This scooter includes child-friendly features, making it safe and fun for young riders. Perfect for family outings and adventures.\"),\n    (\"Electric Scooter with Foldable Handlebars\", 349.99, 35, \"The foldable handlebars on this scooter make it easy to store and transport. Ideal for commuters with limited space.\"),\n    (\"Electric Scooter with Enhanced Battery Life\", 399.99, 30, \"Enjoy longer rides with the enhanced battery life of this electric scooter. Perfect for those who want to travel further without frequent charging.\"),\n    (\"Electric Scooter with Quick Release Wheels\", 299.99, 50, \"This scooter features quick-release wheels for easy maintenance and storage. Ideal for riders who want convenience and efficiency.\"),\n    (\"Electric Scooter with Integrated Kickstand\", 249.99, 60, \"The integrated kickstand on this scooter provides stability when parked. Perfect for urban riders looking for practicality.\"),\n    (\"Electric Scooter with Safety Helmets Included\", 399.99, 35, \"This package includes a safety helmet with the scooter for added protection. Ideal for riders who prioritize safety while enjoying their ride.\"),\n    (\"Electric Scooter with Anti-Theft Features\", 499.99, 30, \"Stay secure with the anti-theft features on this electric scooter. Perfect for urban environments where security is a concern.\"),\n    (\"Electric Scooter with High-Performance Battery\", 599.99, 20, \"The high-performance battery on this scooter ensures longer rides and faster charging times. Ideal for those who ride frequently.\"),\n    (\"Electric Scooter with Adjustable Suspension\", 699.99, 15, \"Experience a smooth ride with adjustable suspension on this electric scooter. Perfect for tackling various terrains with ease.\")\n]"