"[(\"Fire Extinguisher ABC 5lb\", 29.99, 150, \"This ABC fire extinguisher is ideal for use on ordinary combustibles, flammable liquids, and electrical fires. Its compact size makes it perfect for home or office use.\"), \n(\"Smoke Detector\", 19.99, 200, \"A reliable smoke detector that provides early warning of smoke and fire. It features a loud alarm and a test button for easy functionality checks.\"), \n(\"Fire Blanket\", 24.99, 75, \"This fire blanket is designed to smother flames and can be used on small fires in kitchens or other areas. It is easy to use and made from high-quality fiberglass.\"), \n(\"Fire Hose Reel\", 149.99, 30, \"A durable fire hose reel that ensures quick access to water in case of a fire. It comes with a 30-meter hose and is suitable for commercial and industrial use.\"), \n(\"Carbon Monoxide Detector\", 39.99, 100, \"This carbon monoxide detector alerts you to dangerous levels of CO in your home. It features a digital display and a loud alarm for your safety.\"), \n(\"Fire Axe\", 34.99, 50, \"A heavy-duty fire axe designed for emergency situations. Its sharp blade and sturdy handle make it perfect for breaking through obstacles during a fire.\"), \n(\"Emergency Exit Sign\", 15.99, 120, \"An illuminated emergency exit sign that guides occupants to safety during an evacuation. It is energy-efficient and easy to install.\"), \n(\"Fire Safety Kit\", 49.99, 40, \"This comprehensive fire safety kit includes a fire extinguisher, smoke detector, and fire blanket. It is perfect for homes and small businesses.\"), \n(\"Fire Alarm System\", 199.99, 25, \"A complete fire alarm system that includes smoke detectors, heat detectors, and a central control panel. It provides comprehensive coverage for large spaces.\"), \n(\"Portable Fire Extinguisher\", 39.99, 80, \"This portable fire extinguisher is lightweight and easy to carry. It is effective against small fires and is perfect for vehicles and outdoor activities.\"), \n(\"Fire Safety Training Manual\", 14.99, 150, \"A detailed manual that provides essential information on fire safety practices and emergency response. It is a great resource for training employees.\"), \n(\"Fire Escape Ladder\", 59.99, 60, \"A sturdy fire escape ladder that provides a safe way to exit a building in an emergency. It is easy to deploy and can support multiple users.\"), \n(\"Flame Retardant Spray\", 19.99, 90, \"This flame retardant spray can be used on fabrics and materials to reduce flammability. It is ideal for home use and outdoor events.\"), \n(\"Fire Safety Poster\", 9.99, 200, \"An educational fire safety poster that outlines important fire prevention tips and emergency procedures. It is suitable for schools and workplaces.\"), \n(\"Fireproof Safe\", 129.99, 35, \"A fireproof safe designed to protect your valuables from fire damage. It features a secure locking mechanism and is spacious enough for documents and electronics.\"), \n(\"Heat Detector\", 29.99, 110, \"A heat detector that triggers an alarm when it senses a rapid increase in temperature. It is ideal for kitchens and garages where smoke detectors may not be effective.\"), \n(\"Fire Resistant Gloves\", 14.99, 100, \"These fire-resistant gloves provide protection when handling hot materials or equipment. They are durable and comfortable for extended use.\"), \n(\"First Aid Kit for Fire Emergencies\", 39.99, 45, \"A specialized first aid kit designed for fire-related injuries. It includes burn dressings, antiseptic wipes, and other essential supplies.\"), \n(\"Fire Door\", 199.99, 20, \"A certified fire door that helps prevent the spread of fire and smoke. It is designed for commercial buildings and meets all safety regulations.\"), \n(\"Flame Detector\", 89.99, 30, \"A highly sensitive flame detector that provides early warning of fire. It is suitable for industrial applications and can be integrated into fire alarm systems.\"), \n(\"Emergency Fire Exit Plan\", 12.99, 150, \"A customizable emergency fire exit plan that helps occupants know their escape routes. It is essential for businesses to ensure safety compliance.\"), \n(\"Fire Safety Vest\", 24.99, 80, \"A high-visibility fire safety vest that is worn by firefighters and safety personnel. It ensures they are easily identifiable in emergency situations.\"), \n(\"Fire Hydrant Wrench\", 19.99, 65, \"A specialized wrench designed for opening fire hydrants in emergencies. It is constructed from durable materials for long-lasting use.\"), \n(\"Fire Safety Checklist\", 9.99, 200, \"A practical checklist that helps individuals and businesses assess their fire safety measures. It is an essential tool for regular safety audits.\"), \n(\"Fire Escape Plan Template\", 14.99, 150, \"A template that helps families and businesses create a fire escape plan. It includes guidelines for practicing drills and identifying exits.\"), \n(\"Fire Alarm Control Panel\", 299.99, 15, \"A sophisticated fire alarm control panel that manages multiple detectors and alarms. It is ideal for large commercial buildings.\"), \n(\"Flame Resistant Clothing\", 49.99, 70, \"Clothing made from flame-resistant materials, perfect for workers in hazardous environments. It ensures safety without sacrificing comfort.\"), \n(\"Fire Safety Training Course\", 99.99, 25, \"An online training course that educates participants on fire safety protocols and emergency response. Ideal for workplace training.\"), \n(\"Fire Extinguisher Inspection Tag\", 4.99, 250, \"A durable inspection tag that helps track the maintenance of fire extinguishers. Essential for compliance in commercial settings.\"), \n(\"Fire Pump\", 399.99, 10, \"A powerful fire pump that provides high-pressure water flow for firefighting. It is suitable for industrial and agricultural applications.\"), \n(\"Fire Safety Audit Service\", 199.99, 5, \"A professional fire safety audit service that evaluates your premises for potential fire hazards. It provides actionable recommendations for improvement.\"), \n(\"Fire Retardant Curtains\", 89.99, 40, \"These fire retardant curtains are designed to slow the spread of flames and smoke. Perfect for theaters, hotels, and other public spaces.\"), \n(\"Fire Safety Awareness Brochure\", 0.99, 500, \"An informative brochure that raises awareness about fire safety practices. Ideal for distribution in schools and community centers.\"), \n(\"Fire Escape Window\", 159.99, 25, \"A specially designed window that allows for quick escape during a fire. It meets all safety standards for residential buildings.\"), \n(\"Fire Alarm Battery Backup\", 24.99, 80, \"A battery backup system that ensures your fire alarms remain operational during power outages. It is essential for continuous safety.\"), \n(\"Fire Safety Mobile App\", 9.99, 150, \"An innovative mobile app that provides fire safety tips and emergency contacts. It is a handy tool for quick access to safety information.\"), \n(\"Thermal Imaging Camera\", 299.99, 12, \"A thermal imaging camera that helps identify heat sources during firefighting operations. It is an invaluable tool for first responders.\"), \n(\"Fire Safety Drill Kit\", 34.99, 50, \"A kit that includes materials for conducting fire safety drills in schools and workplaces. It promotes preparedness and safety awareness.\"), \n(\"Fire Resistant Storage Box\", 39.99, 40, \"A fire-resistant storage box designed to protect important documents from fire damage. It is compact and easy to store.\"), \n(\"Fire Safety Equipment Sign\", 14.99, 100, \"A clear sign indicating the location of fire safety equipment. It is crucial for ensuring quick access in emergencies.\"), \n(\"Firefighter's Helmet\", 89.99, 30, \"A high-quality firefighter's helmet designed for maximum protection and comfort. It meets all safety standards for firefighting gear.\"), \n(\"Emergency Fire Whistle\", 7.99, 250, \"A loud emergency whistle that can be used to signal for help during a fire. It is compact and easy to carry.\"), \n(\"Fire Safety Awareness Program\", 199.99, 5, \"A comprehensive program that educates employees about fire safety in the workplace. It includes training materials and resources.\"), \n(\"Fire Resistant Tarpaulin\", 59.99, 40, \"A durable fire-resistant tarpaulin that can be used to cover equipment or materials. It provides protection against sparks and flames.\"), \n(\"Fire Extinguisher Training Simulator\", 499.99, 8, \"A realistic training simulator that allows individuals to practice using a fire extinguisher safely. Ideal for training sessions.\"), \n(\"Fire Safety Compliance Kit\", 99.99, 15, \"A kit that includes everything needed to ensure fire safety compliance in your business. It contains checklists, signage, and safety equipment.\"), \n(\"Fire Hose Nozzle\", 29.99, 100, \"A high-quality fire hose nozzle that allows for adjustable water flow. It is essential for effective firefighting.\"), \n(\"Fire Alarm Testing Kit\", 79.99, 20, \"A testing kit designed to ensure your fire alarm system is functioning properly. It includes all necessary tools for maintenance.\"), \n(\"Fire Safety Awareness Workshop\", 149.99, 10, \"A hands-on workshop that teaches participants about fire prevention and emergency response. It is perfect for community organizations.\"), \n(\"Fire Escape Chair\", 299.99, 5, \"A specially designed chair that assists in the evacuation of individuals with mobility issues during a fire. It is easy to use and transport.\"), \n(\"Fire Safety Coordinator Certification\", 199.99, 12, \"A certification program for individuals responsible for fire safety in organizations. It covers regulations, emergency planning, and risk assessment.\"), \n(\"Fire Hose Storage Rack\", 49.99, 30, \"A sturdy storage rack designed to hold fire hoses securely. It helps keep hoses organized and easily accessible.\"), \n(\"Fire Safety Inspection Service\", 249.99, 8, \"A professional inspection service that evaluates fire safety measures in your building. It provides a detailed report and recommendations.\"), \n(\"Fire Hydrant Sign\", 11.99, 150, \"A clear sign that indicates the location of fire hydrants. It is essential for quick access by emergency services.\"), \n(\"Fire Safety Evacuation Chair\", 349.99, 7, \"An evacuation chair designed to assist individuals with disabilities during a fire emergency. It is easy to maneuver and provides safety.\"), \n(\"Fire Safety Equipment Checklist\", 9.99, 200, \"A checklist that helps ensure all necessary fire safety equipment is in place. It is a valuable tool for businesses and homes.\"), \n(\"Fire Safety Awareness Campaign Materials\", 49.99, 25, \"Materials designed to promote fire safety awareness in communities. Includes posters, brochures, and educational resources.\"), \n(\"Fire Alarm Monitoring Service\", 199.99, 10, \"A monitoring service that ensures your fire alarm system is always operational. It provides peace of mind for businesses and homeowners.\"), \n(\"Fire Safety Compliance Audit\", 299.99, 5, \"A thorough audit that assesses your fire safety compliance with local regulations. It provides a comprehensive report and recommendations.\"), \n(\"Fire Safety Training DVD\", 19.99, 100, \"A training DVD that covers essential fire safety practices and emergency response. Ideal for workplace training sessions.\"), \n(\"Fire Department Approved Equipment\", 399.99, 3, \"High-quality fire safety equipment approved by the fire department. Ensures compliance with safety standards and regulations.\"), \n(\"Fire Safety Gear Bag\", 29.99, 50, \"A durable gear bag designed to hold all your fire safety equipment. It is spacious and easy to carry.\"), \n(\"Fire Safety Awareness Stickers\", 0.99, 500, \"Stickers promoting fire safety awareness that can be placed in schools and workplaces. A fun way to remind everyone to stay safe.\"), \n(\"Fire Safety Training Workbook\", 24.99, 80, \"A comprehensive workbook that complements fire safety training programs. It includes exercises and quizzes to reinforce learning.\"), \n(\"Fire Safety Emergency Response Plan\", 49.99, 40, \"A detailed plan that outlines emergency response procedures in case of fire. It is essential for businesses and organizations.\"), \n(\"Fire Safety Equipment Maintenance Log\", 9.99, 200, \"A logbook designed to track the maintenance of fire safety equipment. Helps ensure compliance and safety.\"), \n(\"Fire Safety Awareness T-Shirt\", 19.99, 100, \"A comfortable t-shirt promoting fire safety awareness. Perfect for community events and educational programs.\"), \n(\"Fire Safety Consultant Services\", 299.99, 5, \"Professional consulting services that help businesses develop fire safety plans. Includes risk assessments and training.\"), \n(\"Fire Safety Training Certification\", 99.99, 15, \"A certification program that validates knowledge of fire safety practices. Ideal for professionals in safety management.\"), \n(\"Firefighter Training Manual\", 34.99, 50, \"A manual that provides essential training information for aspiring firefighters. Covers techniques, safety protocols, and emergency response.\"), \n(\"Fire Safety Awareness Calendar\", 14.99, 100, \"An educational calendar that highlights fire safety tips for each month. A great resource for homes and offices.\"), \n(\"Fire Safety Equipment Display Case\", 89.99, 20, \"A display case designed to showcase fire safety equipment in educational settings. It promotes awareness and understanding of fire safety.\"), \n(\"Fire Safety Awareness Video\", 29.99, 80, \"An engaging video that educates viewers about fire safety practices. Ideal for schools and community organizations.\"), \n(\"Fire Safety Workshops for Kids\", 149.99, 10, \"Interactive workshops designed to teach children about fire safety in a fun way. Includes hands-on activities and demonstrations.\"), \n(\"Fire Safety Awareness Resource Kit\", 39.99, 45, \"A resource kit that includes materials for promoting fire safety awareness. Perfect for schools and community centers.\"), \n(\"Fire Safety Compliance Training\", 199.99, 5, \"Training designed to ensure employees understand fire safety regulations and compliance. Essential for businesses in high-risk industries.\"), \n(\"Fire Safety Awareness Quiz\", 4.99, 300, \"A quiz designed to test knowledge of fire safety practices. A fun way to engage participants in learning.\"), \n(\"Fire Safety Equipment Inspection Service\", 249.99, 8, \"A professional service that inspects fire safety equipment for compliance and functionality. Ensures your safety measures are up to date.\"), \n(\"Fire Safety Awareness Workshop for Seniors\", 99.99, 10, \"A workshop tailored for seniors to educate them on fire safety. It includes practical tips and emergency response training.\"), \n(\"Fire Safety Equipment Donation Program\", 0.00, 500, \"A program that accepts donations of fire safety equipment for communities in need. Help us promote safety for all.\"), \n(\"Fire Safety Training for Caregivers\", 149.99, 10, \"Training specifically designed for caregivers on fire safety practices. It covers emergency response and prevention strategies.\"), \n(\"Fire Safety Awareness Day Event\", 99.99, 15, \"An event dedicated to promoting fire safety awareness in the community. Includes demonstrations, giveaways, and educational materials.\"), \n(\"Fire Safety Equipment Recycling Program\", 0.00, 500, \"A program that encourages the recycling of old fire safety equipment. Help us reduce waste while promoting fire safety.\"), \n(\"Fire Safety Awareness for Pets\", 19.99, 100, \"A guide that provides tips on keeping pets safe during a fire. It includes emergency planning and evacuation strategies for pet owners.\"), \n(\"Fire Safety Equipment Sponsorship Program\", 0.00, 500, \"A sponsorship program that supports local fire safety initiatives. Help us provide essential equipment to those in need.\")]"