"[(\"Garden Trowel\", 12.99, 150, \"A sturdy garden trowel made of stainless steel for durability. Perfect for digging, planting, and transferring soil.\"), \n(\"Pruning Shears\", 24.99, 75, \"High-quality pruning shears designed for precision cutting. Ideal for maintaining healthy plants and shaping your garden.\"), \n(\"Hand Rake\", 8.99, 200, \"A lightweight hand rake that is perfect for loosening soil and removing debris. Its compact size makes it easy to handle in tight spaces.\"), \n(\"Garden Hose\", 29.99, 100, \"A flexible garden hose that expands when filled with water. It is lightweight and kink-resistant, making watering your garden a breeze.\"), \n(\"Weeder\", 10.99, 150, \"An essential tool for removing weeds from your garden. Its sharp blade cuts through roots effortlessly, ensuring a weed-free space.\"), \n(\"Garden Gloves\", 15.99, 120, \"Durable garden gloves that provide protection while working in the soil. They are breathable and flexible, allowing for easy movement.\"), \n(\"Spade\", 22.99, 80, \"A heavy-duty spade designed for digging and turning soil. Its sharp blade cuts through tough ground with ease.\"), \n(\"Garden Fork\", 18.99, 70, \"A robust garden fork perfect for aerating soil and mixing compost. Its strong tines make it ideal for heavy-duty tasks.\"), \n(\"Watering Can\", 19.99, 60, \"A stylish watering can with a long spout for precise watering. Its ergonomic handle ensures comfort while carrying.\"), \n(\"Seedling Tray\", 9.99, 150, \"A set of seedling trays designed for starting your plants indoors. Each tray has drainage holes to prevent overwatering.\"), \n(\"Garden Kneeler\", 34.99, 40, \"A comfortable garden kneeler that doubles as a seat. It helps reduce strain on your knees and back while gardening.\"), \n(\"Compost Bin\", 49.99, 30, \"An eco-friendly compost bin for turning kitchen scraps into nutrient-rich compost. Its design promotes airflow for faster decomposition.\"), \n(\"Plant Labels\", 7.99, 200, \"A pack of durable plant labels for organizing your garden. These labels are waterproof and easy to write on.\"), \n(\"Garden Edger\", 29.99, 50, \"A manual garden edger that creates clean lines along your garden beds. Its ergonomic handle provides comfort during use.\"), \n(\"Soil Moisture Meter\", 15.99, 100, \"A handy soil moisture meter that helps you monitor the moisture level in your plants. It ensures you water them just right.\"), \n(\"Garden Cart\", 79.99, 20, \"A heavy-duty garden cart for transporting tools, plants, and soil. Its durable wheels make it easy to maneuver on any terrain.\"), \n(\"Pruning Saw\", 29.99, 45, \"A sharp pruning saw designed for cutting through thick branches. Its ergonomic handle provides a comfortable grip for extended use.\"), \n(\"Plant Watering Spike\", 12.99, 100, \"A set of plant watering spikes that automatically water your plants. Perfect for keeping your plants hydrated while you're away.\"), \n(\"Garden Hoe\", 18.99, 60, \"A classic garden hoe for cultivating and breaking up soil. Its sharp blade makes weeding and soil preparation efficient.\"), \n(\"Garden Rake\", 25.99, 55, \"A sturdy garden rake for leveling soil and gathering leaves. Its wide head allows for quick and efficient raking.\"), \n(\"Hedge Shears\", 39.99, 35, \"Professional-grade hedge shears for shaping and trimming hedges. The long blades provide excellent reach and precision.\"), \n(\"Plant Fertilizer\", 14.99, 100, \"A balanced plant fertilizer that promotes healthy growth. It's suitable for a variety of plants and easy to apply.\"), \n(\"Garden Sprayer\", 24.99, 70, \"A versatile garden sprayer for applying pesticides and fertilizers. Its adjustable nozzle allows for different spray patterns.\"), \n(\"Garden Apron\", 19.99, 90, \"A durable garden apron with multiple pockets for tools. It keeps your essentials handy while you work in the garden.\"), \n(\"Bulb Planter\", 12.99, 80, \"A handy bulb planter that makes planting bulbs easy and efficient. Its sharp edge ensures clean holes in the soil.\"), \n(\"Garden Scissors\", 14.99, 120, \"Precision garden scissors for delicate trimming and cutting. Their sharp blades make them ideal for floral arrangements.\"), \n(\"Raised Garden Bed Kit\", 89.99, 25, \"A complete raised garden bed kit for growing vegetables and flowers. It includes everything needed for easy assembly.\"), \n(\"Garden Lighting\", 39.99, 40, \"Solar-powered garden lights that illuminate your outdoor space. They add beauty and safety to your garden at night.\"), \n(\"Garden Trellis\", 49.99, 30, \"A decorative garden trellis for supporting climbing plants. Its elegant design enhances the beauty of your garden.\"), \n(\"Compost Turner\", 59.99, 15, \"A manual compost turner that makes aerating your compost easy. It helps speed up the decomposition process.\"), \n(\"Garden Seed Pack\", 9.99, 200, \"A collection of assorted seeds for various vegetables and flowers. Perfect for starting your own garden from scratch.\"), \n(\"Garden Sprinkler\", 34.99, 50, \"An adjustable garden sprinkler that covers a large area. It's perfect for keeping your lawn and garden well-watered.\"), \n(\"Garden Tool Set\", 49.99, 40, \"A complete garden tool set that includes essential tools for every gardener. It's perfect for both beginners and experienced gardeners.\"), \n(\"Plant Stand\", 29.99, 55, \"A stylish plant stand for displaying your favorite plants. Its sturdy design makes it suitable for indoor and outdoor use.\"), \n(\"Garden Pest Control\", 19.99, 80, \"An organic pest control solution for protecting your plants. Safe for use around pets and children.\"), \n(\"Garden Shade Cloth\", 24.99, 45, \"A lightweight shade cloth that protects plants from harsh sunlight. It helps maintain optimal growing conditions.\"), \n(\"Garden Soil Test Kit\", 29.99, 30, \"A soil test kit that measures pH and nutrient levels. It helps you understand your soil's needs for better gardening.\"), \n(\"Garden Gnome\", 14.99, 100, \"A charming garden gnome that adds a whimsical touch to your outdoor space. Made from durable materials for long-lasting enjoyment.\"), \n(\"Mulching Fork\", 22.99, 40, \"A versatile mulching fork for spreading mulch and compost. Its strong tines make it easy to handle heavy materials.\"), \n(\"Garden Hose Reel\", 39.99, 25, \"A wall-mounted garden hose reel that keeps your hose organized. It prevents tangling and makes watering more convenient.\"), \n(\"Garden Sprout Kit\", 19.99, 70, \"A complete kit for starting your own sprouts at home. It's easy to use and perfect for healthy snacking.\"), \n(\"Garden Sickle\", 14.99, 50, \"A traditional garden sickle for cutting grass and weeds. Its curved blade makes it highly effective for clearing overgrowth.\"), \n(\"Plant Care Guide\", 9.99, 150, \"An informative guide on plant care and maintenance. It offers tips for keeping your plants healthy and thriving.\"), \n(\"Garden Wheelbarrow\", 79.99, 20, \"A heavy-duty wheelbarrow for transporting soil, plants, and tools. Its sturdy construction ensures it can handle heavy loads.\"), \n(\"Garden Borders\", 34.99, 30, \"Decorative garden borders that define your garden space. They add a touch of style while keeping soil and mulch in place.\"), \n(\"Vertical Garden Planter\", 59.99, 25, \"A vertical planter for maximizing space in small gardens. It's perfect for growing herbs, flowers, and vegetables.\"), \n(\"Garden Trellis Netting\", 14.99, 100, \"Durable netting for supporting climbing plants. It helps plants grow vertically, saving space and promoting healthy growth.\"), \n(\"Organic Mulch\", 19.99, 80, \"Natural mulch that helps retain soil moisture and suppress weeds. It enriches the soil as it breaks down.\"), \n(\"Garden Baskets\", 24.99, 60, \"A set of woven garden baskets for collecting fruits and vegetables. Perfect for harvesting and transporting your produce.\"), \n(\"Garden Pest Trap\", 12.99, 100, \"An effective pest trap that attracts and captures unwanted insects. It's a safe and eco-friendly solution for pest control.\"), \n(\"Garden Harvesting Knife\", 15.99, 70, \"A sharp harvesting knife designed for cutting fruits and vegetables. Its ergonomic handle ensures a comfortable grip.\"), \n(\"Garden Seedling Labels\", 8.99, 150, \"A pack of waterproof seedling labels for organizing your garden. They help you keep track of your plants as they grow.\"), \n(\"Garden Soil Amendment\", 24.99, 40, \"A nutrient-rich soil amendment that improves soil quality. It enhances drainage and promotes healthy plant growth.\"), \n(\"Garden Hand Saw\", 19.99, 50, \"A compact hand saw designed for cutting branches and small logs. Its sharp blade makes pruning tasks easier.\"), \n(\"Garden Sprayer Backpack\", 59.99, 20, \"A comfortable backpack sprayer for applying fertilizers and pesticides. Its adjustable straps ensure a perfect fit.\"), \n(\"Garden Planting Guide\", 9.99, 100, \"A handy guide for planting and caring for various plants. It offers tips for successful gardening throughout the year.\"), \n(\"Garden Shade Structure\", 99.99, 10, \"A portable shade structure that provides protection for your plants. It's easy to set up and perfect for hot summer days.\"), \n(\"Garden Bug Zapper\", 39.99, 30, \"An electric bug zapper that helps keep your garden pest-free. It attracts and eliminates flying insects effectively.\"), \n(\"Garden Hand Cultivator\", 15.99, 80, \"A hand cultivator designed for loosening soil and aerating garden beds. Its sharp tines make it easy to use.\"), \n(\"Garden Seed Starter Kit\", 24.99, 50, \"A complete seed starter kit for growing your own plants. It includes everything needed to get started.\"), \n(\"Garden Plant Food\", 14.99, 100, \"A specially formulated plant food that promotes vibrant growth. It's suitable for a wide variety of plants.\"), \n(\"Garden Bird Feeder\", 29.99, 40, \"A decorative bird feeder that attracts a variety of birds. It adds life and color to your garden while supporting wildlife.\"), \n(\"Garden Tool Belt\", 19.99, 90, \"A convenient tool belt for keeping your gardening tools organized. Its multiple pockets provide easy access to essentials.\"), \n(\"Garden Plant Support\", 12.99, 100, \"A sturdy plant support that helps keep your plants upright. Ideal for tomatoes, peppers, and other climbing plants.\"), \n(\"Garden Watering Timer\", 39.99, 25, \"An automatic watering timer that simplifies garden maintenance. It ensures your plants receive consistent watering.\"), \n(\"Garden Soil Rake\", 22.99, 50, \"A soil rake designed for leveling and smoothing soil. Its wide head makes it efficient for larger areas.\"), \n(\"Garden Insect Barrier\", 34.99, 30, \"A protective insect barrier that keeps pests away from your plants. It's easy to install and reusable.\"), \n(\"Garden Planting Fork\", 18.99, 60, \"A planting fork for digging and turning soil. Its strong tines make it ideal for preparing garden beds.\"), \n(\"Garden Bird Bath\", 49.99, 20, \"An elegant bird bath that attracts birds to your garden. Its design adds beauty while providing a water source for wildlife.\"), \n(\"Garden Planting Guidebook\", 14.99, 80, \"A comprehensive guidebook on planting and caring for various plants. It's a must-have for any gardening enthusiast.\"), \n(\"Garden Glider\", 59.99, 15, \"A comfortable garden glider for relaxing in your outdoor space. Its stylish design complements any garden décor.\"), \n(\"Garden Trellis Arch\", 89.99, 10, \"A beautiful trellis arch for climbing plants and flowers. It creates an enchanting entrance to your garden.\"), \n(\"Garden Soil Conditioner\", 19.99, 100, \"A soil conditioner that improves soil structure and fertility. It helps create a healthy environment for plants.\"), \n(\"Garden Plant Pruner\", 24.99, 70, \"A specialized pruner for trimming and shaping plants. Its sharp blades make precision cuts easy.\"), \n(\"Garden Decorative Stones\", 14.99, 150, \"A collection of decorative stones to enhance your garden's aesthetic. Perfect for pathways, borders, or decorative accents.\"), \n(\"Garden Pest Repellent\", 19.99, 80, \"An organic pest repellent that naturally deters insects. Safe for use around pets and children.\"), \n(\"Garden Planting Mix\", 12.99, 100, \"A premium planting mix designed for optimal plant growth. It provides the perfect balance of nutrients and drainage.\"), \n(\"Garden Hose Connector\", 7.99, 200, \"A durable hose connector that ensures a secure fit between hoses. It prevents leaks and is easy to install.\"), \n(\"Garden Planting Spade\", 22.99, 50, \"A planting spade designed for digging holes for plants. Its sharp blade makes planting quick and efficient.\"), \n(\"Garden Harvest Basket\", 19.99, 60, \"A woven basket for collecting fruits and vegetables from your garden. It's both practical and stylish.\"), \n(\"Garden Plant Support Stakes\", 9.99, 150, \"A set of plant support stakes for helping plants grow upright. Ideal for young plants and delicate flowers.\"), \n(\"Garden Irrigation Kit\", 49.99, 20, \"A complete irrigation kit for automating your garden watering. It saves time and ensures consistent moisture.\"), \n(\"Garden Seed Storage\", 14.99, 100, \"A durable seed storage container that keeps your seeds organized and protected. Ideal for any gardening enthusiast.\"), \n(\"Garden Planting Gloves\", 15.99, 120, \"Comfortable planting gloves that provide protection while working. They are flexible and breathable for easy handling.\"), \n(\"Garden Tool Organizer\", 24.99, 40, \"A wall-mounted tool organizer for keeping your gardening tools tidy. It saves space and makes tools easily accessible.\"), \n(\"Garden Bug Spray\", 19.99, 80, \"An effective bug spray for protecting your plants from pests. It's safe for use on vegetables and flowers.\"), \n(\"Garden Planting Shovel\", 18.99, 60, \"A small planting shovel that is perfect for digging holes for plants. Its compact size is ideal for container gardening.\"), \n(\"Garden Watering Wand\", 29.99, 30, \"A versatile watering wand that makes watering plants easy. Its adjustable nozzle allows for various spray patterns.\")]"