"[(\"Echinacea Extract\", 19.99, 150, \"Echinacea is known for its immune-boosting properties. This extract is ideal for supporting your body's defenses during cold and flu season.\"), \n(\"Ginger Root Powder\", 12.99, 200, \"Ginger has been used for centuries to aid digestion and reduce nausea. This powdered form is perfect for adding to teas and recipes.\"), \n(\"Turmeric Curcumin Capsules\", 24.99, 100, \"Turmeric is renowned for its anti-inflammatory properties. These capsules provide a convenient way to incorporate turmeric into your daily routine.\"), \n(\"Peppermint Essential Oil\", 15.99, 75, \"Peppermint oil is often used for its soothing effects on headaches and digestive issues. A few drops can also invigorate your senses.\"), \n(\"Chamomile Tea Bags\", 9.99, 300, \"Chamomile is a gentle herb known for promoting relaxation and sleep. Enjoy a calming cup of chamomile tea before bedtime.\"), \n(\"Lavender Oil\", 18.99, 80, \"Lavender oil is celebrated for its calming scent and potential to reduce anxiety. It can be used in aromatherapy or added to bathwater.\"), \n(\"Ashwagandha Powder\", 22.99, 120, \"Ashwagandha is an adaptogen that helps the body manage stress. This powder can be added to smoothies or warm drinks.\"), \n(\"Milk Thistle Extract\", 29.99, 90, \"Milk thistle is known for its liver-supporting benefits. This extract is a great addition to a detox regimen.\"), \n(\"Cinnamon Bark Capsules\", 14.99, 110, \"Cinnamon is not only a delicious spice but also has potential benefits for blood sugar regulation. These capsules offer a convenient way to supplement.\"), \n(\"Nettle Leaf Tea\", 11.99, 250, \"Nettle leaf is rich in vitamins and minerals, making it a great herbal tea choice. It is often used for its anti-inflammatory properties.\"), \n(\"Holy Basil (Tulsi) Powder\", 16.99, 130, \"Holy basil is revered in Ayurvedic medicine for its stress-relieving properties. This powder can be used in teas or cooking.\"), \n(\"Ginseng Root Extract\", 27.99, 70, \"Ginseng is known for its energy-boosting and cognitive-enhancing effects. This extract is ideal for those looking to improve mental clarity.\"), \n(\"Valerian Root Capsules\", 21.99, 60, \"Valerian root is commonly used as a natural remedy for insomnia and anxiety. These capsules provide a convenient way to promote relaxation.\"), \n(\"Hibiscus Tea Bags\", 10.99, 250, \"Hibiscus tea is not only refreshing but also packed with antioxidants. It may help support heart health when consumed regularly.\"), \n(\"Lemon Balm Extract\", 23.99, 95, \"Lemon balm is known for its calming effects and is often used to reduce stress. This extract can be added to teas or taken directly.\"), \n(\"Rosemary Essential Oil\", 17.99, 85, \"Rosemary oil is often used for its stimulating properties and can enhance memory. It is also great for use in hair care products.\"), \n(\"Moringa Leaf Powder\", 20.99, 140, \"Moringa is a nutrient-dense superfood known for its antioxidant properties. This powder can be added to smoothies or soups.\"), \n(\"Elderberry Syrup\", 29.99, 60, \"Elderberry syrup is popular for its immune-boosting properties, especially during cold season. It can be taken directly or added to drinks.\"), \n(\"Ginkgo Biloba Capsules\", 25.99, 80, \"Ginkgo biloba is often used to enhance memory and cognitive function. These capsules are a convenient way to incorporate it into your routine.\"), \n(\"Sage Leaf Tea\", 9.49, 220, \"Sage tea is known for its potential benefits in digestion and reducing inflammation. It's a soothing beverage that can be enjoyed hot or cold.\"), \n(\"Cayenne Pepper Capsules\", 15.99, 100, \"Cayenne pepper is known for its metabolism-boosting properties. These capsules provide a convenient way to enjoy its benefits without the heat.\"), \n(\"Fennel Seed Tea\", 8.99, 250, \"Fennel seed tea is often used to aid digestion and relieve bloating. Its sweet, anise-like flavor makes it a pleasant herbal choice.\"), \n(\"St. John's Wort Extract\", 19.99, 70, \"St. John's Wort is commonly used for its mood-lifting properties. This extract can be a natural option for those experiencing mild depression.\"), \n(\"Burdock Root Capsules\", 22.99, 90, \"Burdock root is known for its detoxifying properties and is often used for skin health. These capsules provide a convenient way to incorporate it.\"), \n(\"Clary Sage Essential Oil\", 16.99, 75, \"Clary sage is often used in aromatherapy for its calming effects. It can also be beneficial for hormonal balance.\"), \n(\"Dandelion Root Tea\", 11.99, 230, \"Dandelion root tea is known for its liver-supporting properties. It has a slightly bitter taste that can be enjoyed with honey.\"), \n(\"Calendula Oil\", 14.99, 80, \"Calendula oil is often used for its skin-soothing properties. It can be applied topically to help with minor cuts and irritations.\"), \n(\"Yarrow Leaf Powder\", 20.99, 100, \"Yarrow is traditionally used for its anti-inflammatory and wound-healing properties. This powder can be added to teas or poultices.\"), \n(\"Ginger Tea Bags\", 9.49, 300, \"Ginger tea is known for its warming properties and ability to soothe nausea. It's a great beverage choice for digestive support.\"), \n(\"Thyme Essential Oil\", 18.99, 70, \"Thyme oil is known for its antiseptic properties and can be used in cleaning products. It also has a pleasant herbal aroma.\"), \n(\"Lemon Verbena Tea\", 10.99, 250, \"Lemon verbena tea is refreshing and can help with digestion. Its citrusy flavor makes it a delightful choice for any time of day.\"), \n(\"Cilantro Leaf Powder\", 12.99, 150, \"Cilantro is often used in cooking for its fresh flavor and potential health benefits. This powder is a versatile addition to many dishes.\"), \n(\"Mugwort Tea\", 15.99, 100, \"Mugwort is traditionally used for its calming effects and to promote vivid dreams. This tea is best enjoyed before bedtime.\"), \n(\"Cocoa Powder\", 9.99, 200, \"Cocoa powder is rich in antioxidants and can be used in a variety of recipes. It's perfect for making healthy desserts or beverages.\"), \n(\"Reishi Mushroom Capsules\", 29.99, 70, \"Reishi mushrooms are known for their immune-boosting properties. These capsules are a convenient way to enjoy their health benefits.\"), \n(\"Catnip Tea Bags\", 8.99, 250, \"Catnip is not just for cats; it can also have calming effects on humans. Enjoy a soothing cup of catnip tea to unwind.\"), \n(\"Schisandra Berry Powder\", 21.99, 90, \"Schisandra berries are known for their adaptogenic properties. This powder can be added to smoothies for a health boost.\"), \n(\"Hawthorn Berry Extract\", 24.99, 80, \"Hawthorn berries are often used to support heart health. This extract can be taken daily for its cardiovascular benefits.\"), \n(\"Black Cohosh Capsules\", 22.99, 60, \"Black cohosh is commonly used to relieve menopausal symptoms. These capsules provide a natural option for hormonal balance.\"), \n(\"Brahmi Powder\", 19.99, 100, \"Brahmi is known for its cognitive-enhancing properties. This powder can be mixed into drinks or foods for added benefits.\"), \n(\"Coconut Oil\", 16.99, 130, \"Coconut oil is a versatile natural oil used for cooking and skincare. Its moisturizing properties make it a favorite in beauty routines.\"), \n(\"Linden Flower Tea\", 9.49, 220, \"Linden flower tea is known for its calming effects and can help reduce anxiety. It's a delightful herbal infusion to enjoy at any time.\"), \n(\"Oregano Oil\", 18.99, 70, \"Oregano oil is known for its antibacterial and antifungal properties. It can be used in cooking or taken as a supplement.\"), \n(\"Soursop Leaf Tea\", 12.99, 150, \"Soursop leaf tea is known for its potential health benefits, including immune support. It's a unique herbal tea with a mild flavor.\"), \n(\"Cumin Seed Powder\", 10.99, 200, \"Cumin is a flavorful spice that may aid in digestion. This powder is perfect for adding depth to your favorite dishes.\"), \n(\"Grapefruit Seed Extract\", 24.99, 80, \"Grapefruit seed extract is known for its antimicrobial properties. It can be used to support overall health and wellness.\"), \n(\"Psyllium Husk Powder\", 9.99, 180, \"Psyllium husk is a natural source of fiber that supports digestive health. This powder can be added to smoothies or baked goods.\"), \n(\"Olive Leaf Extract\", 19.99, 90, \"Olive leaf extract is known for its antioxidant properties. It may help support cardiovascular health and overall wellness.\"), \n(\"Sage Capsules\", 14.99, 110, \"Sage has been used for centuries for its potential health benefits, including digestive support. These capsules are a convenient way to use sage.\"), \n(\"Ginger Ale Concentrate\", 15.99, 75, \"Ginger ale concentrate is perfect for making refreshing beverages at home. It combines the benefits of ginger with a fizzy twist.\"), \n(\"Cedarwood Essential Oil\", 17.99, 80, \"Cedarwood oil is known for its calming properties and is often used in aromatherapy. It can also promote relaxation during sleep.\"), \n(\"Eucalyptus Oil\", 18.99, 70, \"Eucalyptus oil is often used for its respiratory benefits and soothing aroma. It's great for use in diffusers or topical applications.\"), \n(\"Coriander Seed Powder\", 12.99, 150, \"Coriander seed is a flavorful spice that may aid digestion. This powder is perfect for enhancing the flavor of various dishes.\"), \n(\"Mistletoe Extract\", 29.99, 60, \"Mistletoe extract is traditionally used for its potential benefits in supporting heart health. It can be taken as a supplement for overall wellness.\"), \n(\"Lemon Balm Tea\", 10.99, 250, \"Lemon balm tea is known for its calming effects and can help reduce stress. It's a refreshing herbal tea that can be enjoyed hot or cold.\"), \n(\"Chili Pepper Extract\", 19.99, 80, \"Chili pepper extract is known for its metabolism-boosting properties. It can be added to food or taken as a supplement for added heat.\"), \n(\"Angelica Root Powder\", 21.99, 90, \"Angelica root is traditionally used for digestive support and respiratory health. This powder can be added to teas or homemade remedies.\"), \n(\"Feverfew Capsules\", 22.99, 70, \"Feverfew is known for its potential benefits in reducing migraine frequency. These capsules provide a convenient way to support head health.\"), \n(\"Cocoa Butter\", 16.99, 130, \"Cocoa butter is a natural moisturizer that is great for skin health. It can be used in lotions, balms, and hair care products.\"), \n(\"Moringa Capsules\", 24.99, 80, \"Moringa is a nutrient-dense superfood known for its antioxidant properties. These capsules are a convenient way to enjoy its health benefits.\"), \n(\"Chickweed Herb\", 12.99, 150, \"Chickweed is often used topically for its soothing properties on the skin. It can be made into salves or infused oils.\"), \n(\"Cypress Essential Oil\", 17.99, 75, \"Cypress oil is known for its calming and grounding properties. It can be used in aromatherapy or added to bathwater.\"), \n(\"Basil Leaf Powder\", 10.99, 200, \"Basil is a fragrant herb that may have anti-inflammatory properties. This powder is perfect for adding flavor to a variety of dishes.\"), \n(\"Saffron Threads\", 29.99, 60, \"Saffron is a prized spice known for its unique flavor and potential health benefits. A little goes a long way in culinary applications.\"), \n(\"Tansy Herb\", 19.99, 90, \"Tansy has been traditionally used for its digestive support properties. It can be brewed into a tea or used in herbal remedies.\"), \n(\"Hawthorn Leaf Powder\", 22.99, 70, \"Hawthorn leaf is known for its heart-supporting properties. This powder can be added to smoothies for a health boost.\"), \n(\"Coconut Milk Powder\", 14.99, 100, \"Coconut milk powder is a versatile ingredient for cooking and baking. It adds a creamy texture and tropical flavor to recipes.\"), \n(\"Elderflower Extract\", 18.99, 80, \"Elderflower is often used for its immune-boosting properties. This extract can be added to beverages or taken as a supplement.\"), \n(\"Bitter Melon Capsules\", 24.99, 90, \"Bitter melon is known for its potential benefits in blood sugar regulation. These capsules offer a convenient way to incorporate it into your routine.\"), \n(\"Marshmallow Root Powder\", 12.99, 150, \"Marshmallow root is traditionally used to soothe the digestive tract. This powder can be added to teas or used in herbal remedies.\"), \n(\"Niaouli Essential Oil\", 17.99, 75, \"Niaouli oil is known for its antiseptic properties and can be used in skincare. It has a fresh, medicinal aroma that is uplifting.\"), \n(\"Lemon Myrtle Tea\", 10.99, 250, \"Lemon myrtle tea is refreshing and aromatic, with potential health benefits. It's a delightful herbal infusion to enjoy any time.\"), \n(\"Ginger Ale Mix\", 9.99, 200, \"Ginger ale mix is perfect for creating your own refreshing beverages at home. It combines the benefits of ginger with a fizzy twist.\"), \n(\"Cayenne Pepper Powder\", 14.99, 150, \"Cayenne pepper powder is known for its metabolism-boosting properties. It can add a spicy kick to your favorite dishes.\"), \n(\"Hibiscus Extract\", 19.99, 90, \"Hibiscus extract is rich in antioxidants and may support heart health. It can be taken as a supplement or added to beverages.\"), \n(\"Cranberry Leaf Tea\", 10.99, 220, \"Cranberry leaf tea is known for its potential benefits for urinary health. It's a pleasant herbal tea that can be enjoyed hot or cold.\"), \n(\"Cinnamon Bark Oil\", 18.99, 70, \"Cinnamon bark oil is known for its warming properties and can be used in aromatherapy. It has a sweet, spicy aroma that is comforting.\"), \n(\"Fenugreek Seed Powder\", 12.99, 150, \"Fenugreek seeds are known for their potential benefits in digestion and lactation. This powder is great for culinary uses.\"), \n(\"Bamboo Leaf Powder\", 21.99, 90, \"Bamboo leaf is rich in antioxidants and may support skin health. This powder can be added to smoothies or skincare products.\"), \n(\"Barberry Extract\", 24.99, 80, \"Barberry is known for its digestive and liver-supporting properties. This extract can be taken as a supplement for overall wellness.\"), \n(\"Oat Straw Tea\", 10.99, 250, \"Oat straw tea is known for its calming effects and may help reduce stress. It's a soothing beverage that can be enjoyed at any time.\"), \n(\"Red Clover Capsules\", 22.99, 70, \"Red clover is often used for its potential benefits in hormonal balance. These capsules provide a convenient way to support women's health.\"), \n(\"Chia Seed Powder\", 14.99, 130, \"Chia seeds are a nutrient-dense superfood high in omega-3 fatty acids. This powder can be added to smoothies or baked goods.\"), \n(\"Sage Leaf Capsules\", 19.99, 90, \"Sage is known for its potential benefits in digestion and cognitive support. These capsules are a convenient way to incorporate sage.\"), \n(\"Tumeric Tea Bags\", 11.99, 250, \"Turmeric tea is known for its anti-inflammatory properties. Enjoy a warm cup to support overall health and wellness.\"), \n(\"Cat's Claw Extract\", 29.99, 60, \"Cat's claw is known for its immune-boosting properties. This extract can be taken as a supplement for overall wellness.\"), \n(\"Cocoa Nibs\", 9.99, 200, \"Cocoa nibs are rich in antioxidants and add a delightful crunch to recipes. They can be used in baking or as a healthy snack.\"), \n(\"Sage Essential Oil\", 17.99, 80, \"Sage essential oil is known for its cleansing properties and can be used in aromatherapy. It has a warm, earthy aroma.\"), \n(\"White Willow Bark Capsules\", 22.99, 70, \"White willow bark is often used for its pain-relieving properties. These capsules provide a natural option for discomfort relief.\"), \n(\"Rose Petal Tea\", 10.99, 250, \"Rose petal tea is known for its soothing properties and delightful aroma. It's a fragrant herbal tea that can be enjoyed any time.\"), \n(\"Mistletoe Tea\", 12.99, 150, \"Mistletoe tea is traditionally used for its potential benefits in supporting heart health. It's a unique herbal infusion worth trying.\"), \n(\"Hawthorn Berry Tea\", 9.49, 220, \"Hawthorn berry tea is known for its potential cardiovascular benefits. It's a flavorful tea that can be enjoyed hot or cold.\"), \n(\"Feverfew Tea Bags\", 11.99, 200, \"Feverfew tea is often used for its potential benefits in reducing migraine frequency. It's a herbal option for head health.\"), \n(\"Chicory Root Powder\", 14.99, 130, \"Chicory root is often used as a coffee substitute and may support digestive health. This powder can be added to beverages or recipes.\"), \n(\"Kava Kava Extract\", 29.99, 60, \"Kava kava is known for its calming effects and is often used to reduce anxiety. This extract can be taken as a supplement for relaxation.\"), \n(\"Linden Flower Extract\", 19.99, 90, \"Linden flower extract is known for its calming properties and can support relaxation. It can be added to teas or taken directly.\"), \n(\"Pine Needle Tea\", 10.99, 250, \"Pine needle tea is rich in antioxidants and vitamin C. It's a unique herbal infusion that can support overall wellness.\"), \n(\"Hemp Seed Oil\", 18.99, 80, \"Hemp seed oil is known for its nourishing properties for skin and hair. It's a versatile oil that can be used in cooking or skincare.\"), \n(\"Spirulina Powder\", 24.99, 70, \"Spirulina is a nutrient-rich superfood known for its high protein content. This powder can be added to smoothies or health drinks.\"), \n(\"Beetroot Powder\", 19.99, 100, \"Beetroot powder is rich in antioxidants and may support cardiovascular health. It can be added to smoothies or baked goods.\"), \n(\"Coconut Flour\", 12.99, 150, \"Coconut flour is a gluten-free alternative for baking. It's high in fiber and can be used in a variety of recipes.\"), \n(\"Alfalfa Leaf Powder\", 10.99, 200, \"Alfalfa leaf is known for its nutrient-rich profile and may support overall health. This powder can be added to smoothies or meals.\"), \n(\"Chlorella Powder\", 21.99, 90, \"Chlorella is a nutrient-dense algae known for its detoxifying properties. This powder can be added to smoothies or health drinks.\"), \n(\"Maca Root Powder\", 24.99, 80, \"Maca root is known for its energy-boosting properties and hormonal balance. This powder can be added to smoothies or oatmeal.\"), \n(\"Sesame Seed Oil\", 17.99, 75, \"Sesame seed oil is known for its flavor and potential health benefits. It can be used in cooking or as a salad dressing.\"), \n(\"Nutritional Yeast Flakes\", 14.99, 100, \"Nutritional yeast is a great source of B vitamins and adds a cheesy flavor to dishes. It's perfect for vegan cooking.\"), \n(\"Pumpkin Seed Oil\", 19.99, 90, \"Pumpkin seed oil is rich in antioxidants and may support prostate health. It can be used in salad dressings or taken as a supplement.\"), \n(\"Tapioca Starch\", 9.99, 200, \"Tapioca starch is a gluten-free thickening agent used in cooking and baking. It's great for making gluten-free recipes.\"), \n(\"Cacao Powder\", 14.99, 130, \"Cacao powder is rich in antioxidants and adds a rich chocolate flavor to recipes. It's perfect for smoothies and desserts.\"), \n(\"Coconut Sugar\", 12.99, 150, \"Coconut sugar is a natural sweetener with a lower glycemic index. It can be used in place of regular sugar in recipes.\"), \n(\"Rice Bran Oil\", 18.99, 70, \"Rice bran oil is known for its high smoke point and mild flavor. It's a versatile cooking oil that can be used in various dishes.\"), \n(\"Flaxseed Oil\", 24.99, 60, \"Flaxseed oil is rich in omega-3 fatty acids and may support heart health. It can be taken as a supplement or added to smoothies.\"), \n(\"Cardamom Pods\", 12.99, 150, \"Cardamom is a fragrant spice known for its digestive benefits. These pods can be used in cooking or brewed into tea.\"), \n(\"Coconut Vinegar\", 9.99, 200, \"Coconut vinegar is a tangy, fermented condiment that can add flavor to dishes. It's a great alternative to traditional vinegar.\"), \n(\"Sesame Seeds\", 10.99, 180, \"Sesame seeds are a nutritious addition to many dishes and may support heart health. They can be sprinkled on salads or used in cooking.\"), \n(\"Golden Milk Mix\", 19.99, 70, \"Golden milk mix combines turmeric and other spices for a soothing beverage. It's perfect for relaxing and promoting wellness.\"), \n(\"Black Seed Oil\", 29.99, 60, \"Black seed oil is known for its potential health benefits, including immune support. It can be taken as a supplement or used topically.\"), \n(\"Red Yeast Rice\", 24.99, 80, \"Red yeast rice is often used to support healthy cholesterol levels. These capsules provide a natural option for heart health.\"), \n(\"Coconut Water Powder\", 14.99, 100, \"Coconut water powder is a convenient way to enjoy the hydrating benefits of coconut water. It can be added to smoothies or drinks.\"), \n(\"Soursop Powder\", 19.99, 90, \"Soursop powder is rich in antioxidants and may support immune health. It can be added to smoothies or health drinks.\"), \n(\"Hemp Protein Powder\", 22.99, 70, \"Hemp protein powder is a plant-based protein source rich in omega fatty acids. It's perfect for smoothies and baking.\"), \n(\"Cacao Nibs\", 9.99, 200, \"Cacao nibs are rich in antioxidants and add a delightful crunch to recipes. They can be used in baking or as a healthy snack.\"), \n(\"Matcha Green Tea Powder\", 24.99, 80, \"Matcha is a finely ground green tea known for its antioxidant properties. This powder can be used in beverages or baking.\"), \n(\"Almond Flour\", 12.99, 150, \"Almond flour is a gluten-free alternative for baking. It's high in protein and can be used in a variety of recipes.\"), \n(\"Cinnamon Sugar\", 10.99, 200, \"Cinnamon sugar is a delicious blend of cinnamon and sugar, perfect for topping baked goods. It's a sweet addition to many recipes.\"), \n(\"Kelp Powder\", 19.99, 90, \"Kelp powder is rich in iodine and may support thyroid health. It can be added to smoothies or used in cooking.\"), \n(\"Cilantro Essential Oil\", 17.99, 75, \"Cilantro oil is known for its refreshing aroma and potential health benefits. It can be used in aromatherapy or cooking.\"), \n(\"Lemon Peel Powder\", 14.99, 100, \"Lemon peel powder adds a zesty flavor to recipes and is rich in antioxidants. It can be used in baking or as a seasoning.\"), \n(\"Moringa Leaf Capsules\", 22.99, 90, \"Moringa leaves are known for their nutrient density and antioxidant properties. These capsules provide a convenient way to enjoy their benefits.\"), \n(\"Ginger Root Tea\", 9.49, 250, \"Ginger root tea is known for its warming properties and ability to soothe nausea. It's a comforting beverage that can be enjoyed any time.\"), \n(\"Thyme Leaf Powder\", 12.99, 150, \"Thyme is a fragrant herb known for its culinary and medicinal uses. This powder can enhance the flavor of various dishes.\"), \n(\"Dill Seed Powder\", 10.99, 200, \"Dill seed powder is known for its digestive benefits and unique flavor. It can be used in cooking or infused into teas.\"), \n(\"Rosemary Leaf Capsules\", 19.99, 80, \"Rosemary is known for its potential cognitive benefits and antioxidant properties. These capsules provide a convenient way to incorporate rosemary.\"), \n(\"Anise Seed Powder\", 14.99, 130, \"Anise seed has a sweet, licorice-like flavor and is often used in baking. This powder can enhance the flavor of various dishes.\"), \n(\"Ginseng Tea Bags\", 11.99, 250, \"Ginseng tea is known for its energy-boosting properties and can improve cognitive function. It's a revitalizing beverage choice.\"), \n(\"Coriander Leaf Capsules\", 22.99, 70, \"Coriander is known for its potential digestive benefits. These capsules provide a convenient way to incorporate coriander into your routine.\"), \n(\"Chicory Coffee Substitute\", 9.99, 200, \"Chicory is often used as a coffee substitute and has a rich, roasted flavor. It's a great option for those looking to reduce caffeine.\"), \n(\"Safflower Oil\", 18.99, 70, \"Safflower oil is known for its high smoke point and mild flavor. It's a versatile oil that can be used in cooking and baking.\"), \n(\"Carob Powder\", 14.99, 130, \"Carob powder is a naturally sweet, caffeine-free alternative to chocolate. It can be used in baking or added to smoothies.\"), \n(\"Coconut Cream\", 12.99, 150, \"Coconut cream is a rich, creamy ingredient used in cooking and baking. It's perfect for adding flavor and texture to dishes.\"), \n(\"Basil Oil\", 19.99, 90, \"Basil oil is known for its aromatic properties and potential health benefits. It can be used in cooking or as a natural remedy.\"), \n(\"Moringa Seed Oil\", 24.99, 80, \"Moringa seed oil is known for its moisturizing properties and is great for skincare. It can be used in lotions and creams.\"), \n(\"Turmeric Root Powder\", 22.99, 100, \"Turmeric root powder is known for its anti-inflammatory properties. It can be added to dishes or taken as a supplement.\"), \n(\"Sesame Oil\", 17.99, 70, \"Sesame oil is known for its nutty flavor and is often used in Asian cuisine. It's a great addition to dressings and marinades.\"), \n(\"Hemp Seed\", 14.99, 150, \"Hemp seeds are a nutritious source of protein and healthy fats. They can be added to smoothies, salads, or baked goods.\"), \n(\"Bitter Orange Extract\", 19.99, 90, \"Bitter orange extract is known for its potential benefits in weight management. It can be taken as a supplement or used in beverages.\"), \n(\"Pine Pollen Powder\", 24.99, 60, \"Pine pollen is rich in nutrients and may support overall health. This powder can be added to smoothies or health drinks.\"), \n(\"Sea Buckthorn Oil\", 29.99, 70, \"Sea buckthorn oil is known for its skin-nourishing properties. It can be used in skincare products or taken as a supplement.\"), \n(\"Cocoa Butter Powder\", 12.99, 150, \"Cocoa butter powder is a versatile ingredient used in baking and skincare. It adds a rich chocolate flavor to recipes.\"), \n(\"Sage Leaf Extract\", 17.99, 80, \"Sage leaf extract is known for its potential benefits in digestion and cognitive support. It can be taken as a supplement.\"), \n(\"Ginger Candy\", 9.99, 200, \"Ginger candy is a tasty treat known for its digestive benefits. It's perfect for a sweet snack or as a natural remedy.\"), \n(\"Coconut Chips\", 10.99, 180, \"Coconut chips are a delicious snack that is naturally sweet and crunchy. They are perfect for topping desserts or enjoying on their own.\"), \n(\"Seaweed Snack\", 14.99, 100, \"Seaweed snacks are a nutritious, low-calorie snack rich in vitamins and minerals. They are perfect for a healthy, on-the-go option.\"), \n(\"Chia Seed Pudding Mix\", 12.99, 150, \"Chia seed pudding mix is a quick and easy way to enjoy the health benefits of chia seeds. Just add liquid and let it sit for a tasty treat.\"), \n(\"Beetroot Juice Powder\", 19.99, 90, \"Beetroot juice powder is rich in antioxidants and may support cardiovascular health. It can be added to smoothies or drinks.\"), \n(\"Apple Cider Vinegar Capsules\", 22.99, 70, \"Apple cider vinegar is known for its potential health benefits, including weight management. These capsules provide a convenient way to enjoy it.\"), \n(\"Kombucha Tea\", 9.99, 200, \"Kombucha is a fermented tea known for its probiotic benefits. It's a refreshing beverage that can support digestive health.\"), \n(\"Lemon Balm Extract\", 18.99, 80, \"Lemon balm extract is known for its calming properties and can help reduce stress. It can be added to teas or taken directly.\"), \n(\"Coconut Yogurt\", 14.99, 100, \"Coconut yogurt is a dairy-free alternative that is rich and creamy. It's perfect for breakfast or as a snack.\"), \n(\"Moringa Leaf Tea\", 10.99, 250, \"Moringa leaf tea is known for its nutrient density and potential health benefits. It's a refreshing herbal infusion to enjoy daily.\"), \n(\"Black Garlic\", 19.99, 90, \"Black garlic is known for its unique flavor and potential health benefits. It can be used in cooking or as a supplement.\"), \n(\"Turmeric Latte Mix\", 24.99, 70, \"Turmeric latte mix combines turmeric and spices for a delicious beverage. It's perfect for warming up and promoting wellness.\"), \n(\"Pumpkin Spice Blend\", 12.99, 150, \"Pumpkin spice blend is a flavorful mix perfect for fall recipes. It adds a warm, cozy flavor to baked goods and drinks.\"), \n(\"Spirulina Capsules\", 22.99, 80, \"Spirulina capsules are a convenient way to enjoy the benefits of this nutrient-rich algae. They can support overall health and wellness.\"), \n(\"Kefir Grains\", 29.99, 60, \"Kefir grains are used to ferment milk into a probiotic-rich beverage. They are great for making your own kefir at home.\"), \n(\"Lemon Ginger Tea\", 10.99, 250, \"Lemon ginger tea is known for its soothing properties and refreshing flavor. It's perfect for warming up on a chilly day.\"), \n(\"Rosehip Oil\", 18.99, 80, \"Rosehip oil is known for its skin-nourishing properties. It can be used in skincare products to promote a healthy complexion.\"), \n(\"Cacao Butter\", 24.99, 60, \"Cacao butter is a rich, creamy ingredient used in cooking and skincare. It adds a delicious chocolate flavor to recipes.\"), \n(\"Ginseng Root Powder\", 22.99, 70, \"Ginseng root powder is known for its energy-boosting properties. It can be added to smoothies or taken as a supplement.\"), \n(\"Cinnamon Leaf Oil\", 19.99, 90, \"Cinnamon leaf oil is known for its warming properties and can be used in aromatherapy. It has a sweet, spicy aroma.\"), \n(\"Nettle Leaf Capsules\", 22.99, 70, \"Nettle leaf is known for its potential benefits in allergy relief. These capsules provide a convenient way to incorporate nettle.\"), \n(\"Chia Seed Oil\", 18.99, 80, \"Chia seed oil is rich in omega-3 fatty acids and may support heart health. It can be used in cooking or taken as a supplement.\"), \n(\"Pumpkin Seed Protein Powder\", 24.99, 60, \"Pumpkin seed protein powder is a plant-based protein source. It can be added to smoothies or used in baking.\"), \n(\"Cinnamon Bark Tea\", 9.99, 200, \"Cinnamon bark tea is known for its warming properties and delicious flavor. It's a comforting beverage choice any time of day.\"), \n(\"Moringa Oil\", 18.99, 70, \"Moringa oil is known for its moisturizing properties and is great for skincare. It can be used in lotions and creams.\"), \n(\"Ginger Root Capsules\", 22.99, 90, \"Ginger root is known for its digestive benefits and soothing properties. These capsules provide a convenient way to incorporate ginger.\"), \n(\"Elderberry Gummies\", 19.99, 80, \"Elderberry gummies are a tasty way to support immune health. They are perfect for both kids and adults.\"), \n(\"Turmeric Ginger Tea\", 10.99, 250, \"Turmeric ginger tea combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cinnamon Roll Mix\", 14.99, 150, \"Cinnamon roll mix makes it easy to bake delicious, homemade cinnamon rolls. It's a perfect treat for breakfast or dessert.\"), \n(\"Honeybush Tea\", 11.99, 200, \"Honeybush tea is a naturally sweet herbal tea that is caffeine-free. It's a delightful beverage choice for any time of day.\"), \n(\"Rooibos Tea\", 9.99, 250, \"Rooibos tea is rich in antioxidants and caffeine-free. It's a soothing herbal tea that can be enjoyed hot or cold.\"), \n(\"Cacao Nibs\", 9.99, 200, \"Cacao nibs are rich in antioxidants and add a delightful crunch to recipes. They can be used in baking or as a healthy snack.\"), \n(\"Moringa Tea\", 10.99, 250, \"Moringa tea is known for its nutrient density and potential health benefits. It's a refreshing herbal infusion to enjoy daily.\"), \n(\"Cinnamon Leaf Tea\", 10.99, 200, \"Cinnamon leaf tea is known for its warming properties and delicious flavor. It's a comforting beverage choice any time of day.\"), \n(\"Ginger Snap Cookies\", 14.99, 150, \"Ginger snap cookies are a delightful treat with a spicy kick. They are perfect for enjoying with tea or coffee.\"), \n(\"Turmeric Capsules\", 19.99, 90, \"Turmeric capsules are a convenient way to enjoy the benefits of this powerful herb. They can support overall health and wellness.\"), \n(\"Lemon Balm Capsules\", 22.99, 70, \"Lemon balm is known for its calming effects and can help reduce stress. These capsules provide a convenient way to incorporate lemon balm.\"), \n(\"Coconut Flour Pancake Mix\", 12.99, 150, \"Coconut flour pancake mix makes it easy to whip up delicious, gluten-free pancakes. It's a great breakfast option for everyone.\"), \n(\"Chili Garlic Sauce\", 14.99, 100, \"Chili garlic sauce adds a spicy kick to any dish. It's perfect for those who love a bit of heat in their meals.\"), \n(\"Cacao Truffles\", 19.99, 80, \"Cacao truffles are a rich, indulgent treat made with wholesome ingredients. They are perfect for satisfying your sweet tooth.\"), \n(\"Lemon Ginger Honey\", 9.99, 200, \"Lemon ginger honey is a delicious blend that can soothe sore throats. It's perfect for adding to tea or enjoying by the spoonful.\"), \n(\"Chili Pepper Flakes\", 10.99, 150, \"Chili pepper flakes are a versatile spice that can add heat to any dish. They are perfect for seasoning and cooking.\"), \n(\"Moringa Smoothie Mix\", 14.99, 100, \"Moringa smoothie mix is a convenient way to enjoy the health benefits of moringa. Just add liquid for a nutritious drink.\"), \n(\"Elderflower Cordial\", 18.99, 80, \"Elderflower cordial is a sweet, floral beverage that can be enjoyed on its own or mixed into cocktails. It's perfect for summer refreshment.\"), \n(\"Chia Seed Pudding\", 10.99, 250, \"Chia seed pudding is a nutritious and delicious treat that is easy to make. Just mix with liquid and let it sit for a tasty snack.\"), \n(\"Cacao Energy Bites\", 19.99, 90, \"Cacao energy bites are a healthy snack packed with chocolate flavor. They are perfect for a quick boost of energy.\"), \n(\"Turmeric Paste\", 12.99, 150, \"Turmeric paste is a versatile ingredient that can be added to drinks and meals. It provides the health benefits of turmeric in a convenient form.\"), \n(\"Coconut Macaroons\", 14.99, 100, \"Coconut macaroons are a chewy, sweet treat made with coconut. They are perfect for satisfying your sweet cravings.\"), \n(\"Sesame Seed Butter\", 18.99, 70, \"Sesame seed butter is a creamy spread that is rich in nutrients. It can be used in recipes or enjoyed on toast.\"), \n(\"Chili Lime Seasoning\", 12.99, 150, \"Chili lime seasoning adds a zesty kick to any dish. It's perfect for seasoning meats, vegetables, and snacks.\"), \n(\"Moringa Leaf Chips\", 9.99, 200, \"Moringa leaf chips are a crunchy, nutritious snack that is high in vitamins. They are perfect for munching on-the-go.\"), \n(\"Cinnamon Almond Butter\", 14.99, 100, \"Cinnamon almond butter is a delicious spread that combines the flavors of cinnamon and almonds. It's perfect for toast or smoothies.\"), \n(\"Lemon Zest Powder\", 10.99, 150, \"Lemon zest powder adds a bright, citrusy flavor to recipes. It's great for baking or adding to dressings.\"), \n(\"Turmeric Ginger Shots\", 24.99, 80, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Matcha Energy Bites\", 19.99, 90, \"Matcha energy bites are a healthy snack packed with antioxidants. They are perfect for a quick pick-me-up anytime.\"), \n(\"Coconut Rice Mix\", 12.99, 150, \"Coconut rice mix is a flavorful way to enjoy rice with a tropical twist. It's perfect as a side dish or base for meals.\"), \n(\"Cilantro Lime Rice\", 10.99, 200, \"Cilantro lime rice is a refreshing side dish that adds flavor to any meal. It's perfect for tacos, burritos, or bowls.\"), \n(\"Ginger Garlic Paste\", 14.99, 100, \"Ginger garlic paste is a flavorful base for many dishes. It's perfect for adding depth to curries, stir-fries, and marinades.\"), \n(\"Moringa Protein Bars\", 19.99, 80, \"Moringa protein bars are a healthy snack option high in nutrients. They are perfect for on-the-go energy.\"), \n(\"Turmeric Ginger Cookies\", 12.99, 150, \"Turmeric ginger cookies are a delicious treat with a spicy kick. They are perfect for enjoying with tea or coffee.\"), \n(\"Coconut Curry Paste\", 14.99, 100, \"Coconut curry paste is a flavorful base for making curries. It's perfect for adding depth and richness to your dishes.\"), \n(\"Lemon Herb Seasoning\", 10.99, 150, \"Lemon herb seasoning adds a fresh, zesty flavor to dishes. It's perfect for seasoning meats, vegetables, and salads.\"), \n(\"Chili Pepper Sauce\", 18.99, 70, \"Chili pepper sauce adds a spicy kick to any meal. It's perfect for those who love heat in their dishes.\"), \n(\"Ginger Tea Concentrate\", 22.99, 60, \"Ginger tea concentrate is a quick and easy way to enjoy the benefits of ginger. Just mix with hot water for a soothing beverage.\"), \n(\"Coconut Cream Pie Mix\", 14.99, 100, \"Coconut cream pie mix makes it easy to create a delicious dessert. It's perfect for special occasions or everyday treats.\"), \n(\"Cinnamon Raisin Granola\", 12.99, 150, \"Cinnamon raisin granola is a delicious breakfast option that is high in fiber. It's perfect for topping yogurt or enjoying with milk.\"), \n(\"Lemon Mint Tea\", 10.99, 250, \"Lemon mint tea is a refreshing herbal infusion that can help with digestion. It's perfect for enjoying hot or cold.\"), \n(\"Cacao Chocolate Bars\", 19.99, 80, \"Cacao chocolate bars are a rich, indulgent treat made with wholesome ingredients. They are perfect for satisfying your sweet cravings.\"), \n(\"Coconut Sugar Scrub\", 14.99, 100, \"Coconut sugar scrub is a natural exfoliant that leaves skin feeling soft and smooth. It's perfect for a spa day at home.\"), \n(\"Turmeric Face Mask\", 18.99, 70, \"Turmeric face mask is known for its skin-nourishing properties. It can help promote a healthy, radiant complexion.\"), \n(\"Cinnamon Roll Scented Candle\", 22.99, 60, \"Cinnamon roll scented candle fills your space with a warm, inviting aroma. It's perfect for creating a cozy atmosphere.\"), \n(\"Coconut Lip Balm\", 9.99, 200, \"Coconut lip balm is a nourishing treatment for dry lips. It's perfect for keeping your lips soft and hydrated.\"), \n(\"Lemon Ginger Lozenges\", 14.99, 150, \"Lemon ginger lozenges provide soothing relief for sore throats. They are perfect for keeping in your bag for on-the-go comfort.\"), \n(\"Cacao Face Mask\", 19.99, 80, \"Cacao face mask is rich in antioxidants and can help nourish the skin. It leaves your complexion looking fresh and revitalized.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Coconut Body Butter\", 24.99, 70, \"Coconut body butter is a rich moisturizer that leaves skin feeling soft and hydrated. It's perfect for daily use.\"), \n(\"Cacao Smoothie Mix\", 14.99, 100, \"Cacao smoothie mix is a convenient way to enjoy the benefits of cacao. Just add liquid for a delicious, chocolatey drink.\"), \n(\"Gingerbread Spice Blend\", 12.99, 150, \"Gingerbread spice blend is perfect for adding a festive flavor to baked goods. It's a delicious mix of warm spices.\"), \n(\"Coconut Oil Capsules\", 22.99, 90, \"Coconut oil capsules provide the benefits of coconut oil in a convenient form. They can support overall health and wellness.\"), \n(\"Turmeric Infused Olive Oil\", 19.99, 80, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cinnamon Apple Chips\", 10.99, 200, \"Cinnamon apple chips are a healthy, crunchy snack. They are perfect for enjoying on-the-go or as a topping for yogurt.\"), \n(\"Lemon Thyme Seasoning\", 12.99, 150, \"Lemon thyme seasoning adds a fresh flavor to dishes. It's perfect for seasoning meats, vegetables, and salads.\"), \n(\"Cacao Energy Balls\", 19.99, 90, \"Cacao energy balls are a healthy snack packed with chocolate flavor. They are perfect for a quick boost of energy.\"), \n(\"Coconut Chia Seed Pudding\", 14.99, 100, \"Coconut chia seed pudding is a nutritious treat that is easy to make. Just mix with liquid and let it sit for a tasty snack.\"), \n(\"Ginger Turmeric Shots\", 22.99, 60, \"Ginger turmeric shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cinnamon Tea\", 9.99, 250, \"Cinnamon tea is known for its warming properties and delicious flavor. It's a comforting beverage choice any time of day.\"), \n(\"Lemon Coconut Bars\", 14.99, 100, \"Lemon coconut bars are a sweet treat with a tropical twist. They are perfect for satisfying your sweet cravings.\"), \n(\"Cacao Nib Cookies\", 19.99, 80, \"Cacao nib cookies are a delicious treat with a rich chocolate flavor. They are perfect for enjoying with tea or coffee.\"), \n(\"Turmeric Chai Mix\", 12.99, 150, \"Turmeric chai mix combines the benefits of turmeric with warming spices. It's perfect for a soothing beverage.\"), \n(\"Coconut Milk Yogurt\", 14.99, 100, \"Coconut milk yogurt is a dairy-free alternative that is rich and creamy. It's perfect for breakfast or as a snack.\"), \n(\"Ginger Ale Soda\", 9.99, 200, \"Ginger ale soda is a refreshing beverage known for its digestive benefits. It's perfect for enjoying on a hot day.\"), \n(\"Turmeric Hot Chocolate Mix\", 14.99, 150, \"Turmeric hot chocolate mix combines the benefits of turmeric with rich chocolate flavor. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Bliss Balls\", 19.99, 90, \"Cacao bliss balls are a healthy snack packed with chocolate flavor. They are perfect for a quick pick-me-up anytime.\"), \n(\"Lemon Rosemary Chicken Rub\", 12.99, 150, \"Lemon rosemary chicken rub adds a delicious flavor to grilled meats. It's perfect for summer barbecues.\"), \n(\"Coconut Macaroon Mix\", 14.99, 100, \"Coconut macaroon mix makes it easy to create delicious, chewy treats. It's perfect for satisfying your sweet cravings.\"), \n(\"Turmeric Ginger Dressing\", 12.99, 150, \"Turmeric ginger dressing adds a zesty flavor to salads. It's perfect for drizzling over greens or using as a marinade.\"), \n(\"Cacao Smoothie Bowl Mix\", 14.99, 100, \"Cacao smoothie bowl mix is a convenient way to enjoy the benefits of cacao. Just add liquid and toppings for a delicious breakfast.\"), \n(\"Ginger Garlic Marinade\", 18.99, 70, \"Ginger garlic marinade adds flavor to meats and vegetables. It's perfect for grilling or roasting.\"), \n(\"Coconut Curry Sauce\", 14.99, 100, \"Coconut curry sauce is a flavorful base for making curries. It's perfect for adding depth and richness to your dishes.\"), \n(\"Turmeric Infused Tea\", 10.99, 250, \"Turmeric infused tea is known for its anti-inflammatory properties. It's a soothing beverage that can be enjoyed any time.\"), \n(\"Cacao Chocolate Spread\", 19.99, 80, \"Cacao chocolate spread is a rich, indulgent treat made with wholesome ingredients. It's perfect for spreading on toast.\"), \n(\"Coconut Vanilla Cream\", 14.99, 100, \"Coconut vanilla cream is a rich, creamy topping for desserts. It's perfect for adding flavor to cakes and pastries.\"), \n(\"Lemon Basil Vinaigrette\", 12.99, 150, \"Lemon basil vinaigrette adds a fresh flavor to salads. It's perfect for drizzling over greens or using as a marinade.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Coconut Lime Rice Mix\", 12.99, 150, \"Coconut lime rice mix is a flavorful way to enjoy rice with a tropical twist. It's perfect as a side dish or base for meals.\"), \n(\"Cacao Cookie Dough\", 14.99, 100, \"Cacao cookie dough is a delicious treat that is safe to eat raw. It's perfect for satisfying your sweet cravings.\"), \n(\"Turmeric Ginger Ale\", 9.99, 200, \"Turmeric ginger ale is a refreshing beverage known for its digestive benefits. It's perfect for enjoying on a hot day.\"), \n(\"Coconut Honeycomb\", 12.99, 150, \"Coconut honeycomb is a sweet treat that is naturally chewy. It's perfect for enjoying as a snack or topping desserts.\"), \n(\"Lemon Thyme Chicken Rub\", 12.99, 150, \"Lemon thyme chicken rub adds a fresh flavor to grilled meats. It's perfect for summer barbecues.\"), \n(\"Cacao Brownie Mix\", 14.99, 100, \"Cacao brownie mix makes it easy to create delicious, fudgy brownies. It's perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Infused Olive Oil\", 19.99, 80, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Caramel Sauce\", 18.99, 70, \"Cacao caramel sauce is a rich, indulgent topping for desserts. It's perfect for drizzling over ice cream or cakes.\"), \n(\"Gingerbread Spice Cookies\", 14.99, 100, \"Gingerbread spice cookies are a delightful treat with a warm, spicy flavor. They're perfect for enjoying with tea or coffee.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Coconut Cream Pie\", 19.99, 80, \"Coconut cream pie is a delicious dessert with a creamy filling and flaky crust. It's perfect for special occasions.\"), \n(\"Cacao Chocolate Chip Cookies\", 14.99, 100, \"Cacao chocolate chip cookies are a delicious treat with rich chocolate flavor. They're perfect for enjoying with a glass of milk.\"), \n(\"Turmeric Honey\", 12.99, 150, \"Turmeric honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Coconut Lime Bars\", 14.99, 100, \"Coconut lime bars are a refreshing treat with a tropical twist. They're perfect for satisfying your sweet cravings.\"), \n(\"Cacao Energy Bites\", 19.99, 90, \"Cacao energy bites are a healthy snack packed with chocolate flavor. They are perfect for a quick pick-me-up anytime.\"), \n(\"Ginger Garlic Noodles\", 12.99, 150, \"Ginger garlic noodles are a flavorful dish that is easy to make. They're perfect for a quick and satisfying meal.\"), \n(\"Turmeric Coconut Rice\", 14.99, 100, \"Turmeric coconut rice is a flavorful side dish that pairs well with any meal. It's perfect for adding a tropical twist.\"), \n(\"Cacao Truffle Mix\", 19.99, 80, \"Cacao truffle mix makes it easy to create delicious, indulgent treats. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Chip Muffins\", 14.99, 100, \"Cacao chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Ginger Dressing\", 12.99, 150, \"Turmeric ginger dressing adds a zesty flavor to salads. It's perfect for drizzling over greens or using as a marinade.\"), \n(\"Cacao Smoothie Bowl\", 14.99, 100, \"Cacao smoothie bowl is a nutritious breakfast option that is easy to make. Just blend with liquid and top with your favorites.\"), \n(\"Turmeric Chai Latte\", 19.99, 80, \"Turmeric chai latte is a comforting beverage that combines warming spices. It's perfect for cozy evenings at home.\"), \n(\"Cacao Chocolate Mousse\", 14.99, 100, \"Cacao chocolate mousse is a rich, indulgent dessert that is easy to make. It's perfect for satisfying your sweet cravings.\"), \n(\"Turmeric Golden Milk\", 12.99, 150, \"Turmeric golden milk is a soothing beverage known for its health benefits. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Almond Cookies\", 19.99, 80, \"Cacao almond cookies are a delicious treat with a rich chocolate flavor. They're perfect for enjoying with a glass of milk.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Oatmeal Mix\", 12.99, 150, \"Cacao oatmeal mix makes it easy to create a delicious, chocolatey breakfast. Just add hot water or milk for a quick meal.\"), \n(\"Turmeric Coconut Smoothie\", 14.99, 100, \"Turmeric coconut smoothie is a refreshing drink packed with health benefits. It's perfect for a nutritious breakfast or snack.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \"Turmeric ginger tea mix combines the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Chip Pancake Mix\", 19.99, 80, \"Cacao chip pancake mix makes it easy to create delicious, chocolatey pancakes. They're perfect for breakfast or brunch.\"), \n(\"Turmeric Infused Olive Oil\", 12.99, 150, \"Turmeric infused olive oil adds a unique flavor to dishes. It's perfect for drizzling on salads or using in cooking.\"), \n(\"Cacao Fudge Brownies\", 14.99, 100, \"Cacao fudge brownies are a rich, indulgent treat that is easy to make. They're perfect for satisfying your chocolate cravings.\"), \n(\"Turmeric Ginger Tea Bags\", 10.99, 250, \"Turmeric ginger tea bags combine the benefits of both herbs for a soothing beverage. It's perfect for warming up on a chilly day.\"), \n(\"Cacao Hazelnut Spread\", 18.99, 70, \"Cacao hazelnut spread is a rich, indulgent treat that combines chocolate and nuts. It's perfect for spreading on toast or pancakes.\"), \n(\"Turmeric Ginger Shots\", 22.99, 60, \"Turmeric ginger shots are a concentrated blend of health-boosting ingredients. They are perfect for a quick wellness boost.\"), \n(\"Cacao Chocolate Chip Muffins\", 14.99, 100, \"Cacao chocolate chip muffins are a delicious treat with rich chocolate flavor. They're perfect for breakfast or as a snack.\"), \n(\"Turmeric Infused Honey\", 12.99, 150, \"Turmeric infused honey combines the benefits of honey and turmeric. It's perfect for sweetening tea or enjoying by the spoonful.\"), \n(\"Cacao Almond Butter\", 18.99, 70, \"Cacao almond butter is a delicious spread that combines the flavors of cacao and almonds. It's perfect for toast or smoothies.\"), \n(\"Turmeric Ginger Tea Mix\", 14.99, 100, \""