"[\n    (\"Hunting Bow\", 299.99, 30, \"This compound hunting bow offers exceptional accuracy and power. Its lightweight design makes it easy to carry on long hunting trips.\"),\n    (\"Crossbow\", 499.99, 15, \"A high-performance crossbow that delivers impressive speed and precision. Perfect for both novice and experienced hunters.\"),\n    (\"Hunting Knife\", 49.99, 100, \"A durable hunting knife with a sharp blade and ergonomic handle. Ideal for field dressing and other outdoor tasks.\"),\n    (\"Camouflage Jacket\", 89.99, 40, \"Stay hidden in the woods with this lightweight camouflage jacket. It provides warmth and protection from the elements.\"),\n    (\"Tactical Backpack\", 129.99, 25, \"This tactical backpack is designed for hunters who need to carry gear efficiently. It features multiple compartments and a comfortable fit.\"),\n    (\"Binoculars\", 199.99, 20, \"High-quality binoculars with a wide field of view and clear optics. Essential for spotting game from a distance.\"),\n    (\"Hunting Boots\", 149.99, 35, \"These waterproof hunting boots provide excellent traction and support. Perfect for navigating rugged terrain.\"),\n    (\"Game Calls\", 39.99, 80, \"A set of game calls designed to attract various species. Easy to use and effective in the field.\"),\n    (\"Trail Camera\", 119.99, 50, \"Capture wildlife activity with this high-resolution trail camera. It features night vision and motion detection.\"),\n    (\"Hunting Scope\", 249.99, 25, \"A precision hunting scope with adjustable magnification. Ideal for long-range shooting and enhancing accuracy.\"),\n    (\"Field Dressing Gloves\", 19.99, 150, \"Disposable gloves designed for field dressing game. They provide hygiene and ease during the cleaning process.\"),\n    (\"Scent Eliminator Spray\", 24.99, 70, \"This scent eliminator spray helps mask human odors while hunting. Essential for getting close to game.\"),\n    (\"Hunting Chair\", 89.99, 30, \"A portable hunting chair that offers comfort and stability. Great for long hours of waiting in the field.\"),\n    (\"Decoys\", 59.99, 45, \"Realistic decoys that attract birds and other game. Enhance your hunting strategy with these effective tools.\"),\n    (\"Hunting License Holder\", 9.99, 200, \"A durable holder for your hunting license and permits. Keeps your important documents safe and accessible.\"),\n    (\"Portable Game Hoist\", 79.99, 20, \"This portable game hoist makes it easy to lift and hang your game. A must-have for efficient field dressing.\"),\n    (\"Hunting Rangefinder\", 299.99, 15, \"A laser rangefinder that provides accurate distance measurements. Essential for making precise shots.\"),\n    (\"Survival Kit\", 59.99, 50, \"A comprehensive survival kit for emergency situations in the wild. Includes essential tools and supplies.\"),\n    (\"Hunting Blind\", 199.99, 10, \"A pop-up hunting blind that provides concealment and comfort. Easy to set up and take down.\"),\n    (\"Game Processing Kit\", 39.99, 80, \"This kit includes all the tools needed for processing game. It makes field dressing and butchering easier.\"),\n    (\"Hunting Vest\", 69.99, 40, \"A lightweight hunting vest with plenty of pockets for gear. Designed for comfort and functionality.\"),\n    (\"Archery Target\", 49.99, 60, \"A durable archery target for practice and honing your skills. Suitable for both compound and recurve bows.\"),\n    (\"Hunting Range Bag\", 79.99, 30, \"A spacious range bag designed to carry all your hunting essentials. Features multiple compartments for organization.\"),\n    (\"Portable Water Filter\", 39.99, 50, \"This portable water filter ensures you have safe drinking water in the field. Lightweight and easy to use.\"),\n    (\"Hunting Light\", 29.99, 100, \"A bright LED hunting light that helps illuminate your surroundings. Essential for early morning or late evening hunts.\"),\n    (\"Shooting Rest\", 89.99, 25, \"A stable shooting rest that improves accuracy during practice. Made from durable materials for long-lasting use.\"),\n    (\"Hunting Rangefinder Binoculars\", 399.99, 10, \"Binoculars with an integrated rangefinder for precise distance measurements. Ideal for serious hunters.\"),\n    (\"Thermal Imaging Scope\", 999.99, 5, \"A state-of-the-art thermal imaging scope for nighttime hunting. Provides clear visibility in complete darkness.\"),\n    (\"Hunting Flashlight\", 39.99, 75, \"A compact and powerful flashlight designed for hunting. Features multiple brightness settings and a durable build.\"),\n    (\"Shooting Ear Protection\", 29.99, 90, \"Comfortable ear protection designed to reduce noise during shooting. Essential for protecting your hearing.\"),\n    (\"Hunting Game Bag\", 19.99, 150, \"A lightweight game bag for transporting your harvest. Made from breathable material to keep game fresh.\"),\n    (\"Hunting Permit Holder\", 14.99, 120, \"A waterproof holder for your hunting permits and licenses. Keeps your documents safe and organized.\"),\n    (\"Camo Face Paint\", 9.99, 200, \"Face paint designed to help you blend into your surroundings. Easy to apply and remove.\"),\n    (\"Hunting Dog Vest\", 49.99, 40, \"A durable vest designed for hunting dogs. Provides visibility and protection during hunts.\"),\n    (\"Hunting Rangefinder App\", 4.99, 100, \"A mobile app that turns your smartphone into a rangefinder. Convenient and easy to use in the field.\"),\n    (\"Hunting First Aid Kit\", 39.99, 50, \"A compact first aid kit tailored for outdoor adventures. Includes essential supplies for emergencies.\"),\n    (\"Hunting GPS Device\", 199.99, 15, \"A rugged GPS device designed for outdoor navigation. Ideal for tracking your location in remote areas.\"),\n    (\"Camouflage Pants\", 69.99, 45, \"Comfortable camouflage pants designed for hunting. Made from durable fabric for long-lasting wear.\"),\n    (\"Hunting Range Finder\", 149.99, 25, \"An accurate range finder that helps you determine distances. Essential for improving your shooting precision.\"),\n    (\"Portable Camp Stove\", 89.99, 20, \"A compact camp stove perfect for cooking in the field. Lightweight and easy to use, ideal for hunters.\"),\n    (\"Hunting Tripod\", 99.99, 15, \"A sturdy tripod designed for steady shooting and photography. Essential for capturing those perfect moments.\"),\n    (\"Portable Fire Pit\", 129.99, 10, \"A portable fire pit that provides warmth and light during your hunting trips. Easy to transport and set up.\"),\n    (\"Hunting Tent\", 299.99, 8, \"A spacious hunting tent designed for comfort and protection. Perfect for extended trips in the wilderness.\"),\n    (\"Cold Weather Hunting Gear\", 199.99, 12, \"Specialized gear designed to keep you warm in cold conditions. Essential for winter hunting excursions.\"),\n    (\"Hunting Range Target\", 49.99, 60, \"A durable target designed for shooting practice. Perfect for honing your skills before the hunting season.\"),\n    (\"Hunting Gear Organizer\", 39.99, 70, \"An organizer designed to keep all your hunting gear in one place. Features multiple pockets and compartments.\"),\n    (\"Hunting License\", 19.99, 100, \"A digital hunting license that can be stored on your phone. Convenient and easy to access when needed.\"),\n    (\"Hunting Gear Cleaning Kit\", 29.99, 80, \"A complete cleaning kit for maintaining your hunting gear. Ensures your equipment stays in top condition.\"),\n    (\"Hunting Camo Netting\", 24.99, 60, \"Lightweight camo netting that provides additional concealment. Ideal for use in blinds or for ground cover.\"),\n    (\"Hunting Arrow Quiver\", 29.99, 100, \"A durable quiver designed to hold your arrows securely. Features a comfortable strap for easy carrying.\"),\n    (\"Hunting Scope Mount\", 49.99, 40, \"A reliable scope mount that ensures your scope stays secure. Compatible with most hunting rifles.\"),\n    (\"Hunting Gear Bag\", 79.99, 25, \"A spacious gear bag designed for hunters. Features multiple compartments for organization and easy access.\"),\n    (\"Hunting Field Guide\", 19.99, 100, \"A comprehensive field guide for identifying game species. A valuable resource for both novice and experienced hunters.\"),\n    (\"Hunting Water Bottle\", 24.99, 80, \"A durable water bottle designed for outdoor use. Keeps your drinks cold and is easy to carry.\"),\n    (\"Hunting Trail Markers\", 14.99, 150, \"Bright trail markers to help you navigate in the wilderness. Essential for safety during your hunting trips.\"),\n    (\"Hunting Game Scale\", 39.99, 50, \"A portable scale designed for weighing game. Accurate and easy to use in the field.\"),\n    (\"Hunting Game Processing Table\", 99.99, 15, \"A sturdy table designed for processing game in the field. Provides a stable work surface for cleaning.\"),\n    (\"Hunting Survival Guide\", 29.99, 100, \"A practical guide filled with tips and techniques for surviving in the wild. Essential reading for any hunter.\"),\n    (\"Hunting Dog Training Collar\", 49.99, 40, \"An adjustable training collar for hunting dogs. Helps with obedience and tracking training.\"),\n    (\"Hunting Safety Harness\", 59.99, 30, \"A safety harness designed to keep you secure in tree stands. Essential for preventing falls while hunting.\"),\n    (\"Hunting Knife Sharpener\", 19.99, 100, \"A compact sharpener designed to keep your hunting knives in top condition. Easy to use and portable.\"),\n    (\"Hunting Game Bag with Cooler\", 89.99, 20, \"A game bag that includes a built-in cooler to keep your harvest fresh. Perfect for long hunting trips.\"),\n    (\"Hunting Decoy Bag\", 29.99, 70, \"A durable bag designed for carrying your hunting decoys. Keeps them organized and protected during transport.\"),\n    (\"Hunting Trail Camera Mount\", 19.99, 80, \"A mount designed for securely attaching trail cameras. Ensures your camera stays in place for optimal shots.\"),\n    (\"Hunting Gear Belt\", 24.99, 100, \"A sturdy belt designed to hold your hunting gear securely. Features multiple attachment points for convenience.\"),\n    (\"Hunting Camo Gloves\", 19.99, 150, \"Lightweight camo gloves designed for dexterity and warmth. Perfect for handling gear while staying concealed.\"),\n    (\"Hunting Bait\", 14.99, 200, \"Specialized bait designed to attract game. Effective for improving your hunting success.\"),\n    (\"Hunting Scent Control Clothing\", 89.99, 30, \"Clothing designed with scent control technology to help you stay undetected. Ideal for close encounters with game.\"),\n    (\"Hunting Game Call Lanyard\", 9.99, 100, \"A lanyard designed to keep your game calls handy and organized. Essential for quick access while hunting.\"),\n    (\"Hunting Weatherproof Case\", 39.99, 50, \"A weatherproof case designed to protect your gear from the elements. Ideal for storing electronics and sensitive items.\"),\n    (\"Hunting Trail Marker Tape\", 14.99, 150, \"Brightly colored tape to mark your trail in the woods. Helps prevent getting lost during your hunting trips.\"),\n    (\"Hunting Gear Repair Kit\", 29.99, 80, \"A repair kit designed for quick fixes on your hunting gear. Includes essential tools and materials.\"),\n    (\"Hunting Game Field Dressing Kit\", 49.99, 40, \"A complete kit designed for field dressing game. Includes all the necessary tools for efficient processing.\"),\n    (\"Hunting Tree Stand\", 199.99, 10, \"A comfortable tree stand designed for elevated hunting. Provides a great vantage point for spotting game.\"),\n    (\"Hunting Range Safety Flag\", 9.99, 200, \"A bright safety flag to mark your hunting area. Essential for ensuring visibility to other hunters.\"),\n    (\"Hunting Game Processing Gloves\", 19.99, 100, \"Heavy-duty gloves designed for processing game. Provides protection and hygiene during field dressing.\")\n]"