"[\n    (\"Acrylic Yarn Pack\", 29.99, 100, \"This pack includes a variety of vibrant acrylic yarns perfect for all your knitting and crochet projects. Each skein is soft and durable, making it ideal for beginners and experienced crafters alike.\"),\n    (\"Bamboo Knitting Needles\", 15.99, 80, \"These eco-friendly bamboo knitting needles provide a smooth knitting experience. Their lightweight design reduces hand fatigue, allowing for longer crafting sessions.\"),\n    (\"Crochet Hook Set\", 25.99, 50, \"This comprehensive crochet hook set includes a range of sizes to suit any project. Made from high-quality aluminum, they glide effortlessly through yarn.\"),\n    (\"Knitting Stitch Markers\", 9.99, 200, \"Keep track of your stitches with these colorful knitting stitch markers. They are easy to use and won't snag your yarn, making them a must-have for every knitter.\"),\n    (\"Yarn Bowl\", 22.50, 30, \"This beautifully crafted yarn bowl keeps your yarn in place while you knit or crochet. Its elegant design adds a touch of charm to your crafting space.\"),\n    (\"Wool Yarn - Merino Blend\", 34.99, 70, \"This luxurious merino wool yarn is soft and warm, perfect for cozy winter projects. Its rich colors and excellent stitch definition make it a favorite among crafters.\"),\n    (\"Tapestry Needle Set\", 7.99, 150, \"This set of tapestry needles is essential for finishing your knitting and crochet projects. The large eye allows for easy threading of yarn and is perfect for weaving in ends.\"),\n    (\"Knitting Bag\", 39.99, 40, \"This stylish knitting bag features multiple pockets for organization and easy transport. Its durable material ensures your supplies are safe while on the go.\"),\n    (\"Crochet Pattern Book\", 19.99, 60, \"Discover new projects with this crochet pattern book, featuring easy-to-follow instructions for all skill levels. It includes a variety of patterns, from accessories to home decor.\"),\n    (\"Knitting Gauge Ruler\", 5.99, 120, \"Ensure your stitches are perfect with this handy knitting gauge ruler. It's compact and easy to use, making it a perfect tool for any knitter's toolkit.\"),\n    (\"Cotton Yarn - Eco-Friendly\", 27.99, 55, \"This eco-friendly cotton yarn is soft and breathable, making it ideal for summer projects. Its vibrant colors are sure to brighten up any creation.\"),\n    (\"Pom Pom Maker\", 12.99, 90, \"Make perfect pom poms every time with this easy-to-use pom pom maker. It's great for adding a fun touch to hats, scarves, and other knitted items.\"),\n    (\"Knitting Pattern Book\", 24.99, 45, \"This knitting pattern book offers a variety of stylish designs for all skill levels. From beginner to advanced, you'll find projects that inspire creativity.\"),\n    (\"Blocking Mats\", 34.99, 25, \"These blocking mats are essential for finishing your knitted or crocheted pieces. They provide a flat surface for shaping and drying your projects.\"),\n    (\"Knitting Machine\", 199.99, 15, \"This knitting machine makes creating garments fast and easy. Perfect for crafters looking to produce larger quantities of knitwear quickly.\"),\n    (\"Crochet Thread - Size 10\", 9.99, 100, \"This size 10 crochet thread is perfect for delicate projects like doilies and lacework. Its fine texture allows for intricate designs.\"),\n    (\"Knitting Needles Case\", 18.99, 35, \"Keep your knitting needles organized and protected with this stylish case. It features multiple compartments for easy access to your tools.\"),\n    (\"Stitch Counter\", 6.99, 200, \"This simple stitch counter helps you keep track of your progress while knitting or crocheting. Its compact design fits easily in your project bag.\"),\n    (\"Knitting Loom Set\", 29.99, 50, \"This knitting loom set is perfect for beginners and offers a fun way to create knitted items without traditional needles. It includes various loom sizes for different projects.\"),\n    (\"Crochet Amigurumi Kit\", 34.99, 40, \"Create adorable stuffed animals with this complete crochet amigurumi kit. It includes all the materials and instructions needed to make your first plush toy.\"),\n    (\"Yarn Swift\", 49.99, 20, \"This yarn swift makes winding skeins into cakes a breeze. Its sturdy design allows for smooth operation and prevents tangling.\"),\n    (\"Knitting and Crochet Journal\", 14.99, 60, \"Document your projects and ideas in this beautifully designed knitting and crochet journal. It features prompts and space for notes, sketches, and patterns.\"),\n    (\"Faux Fur Pom Pom\", 8.99, 150, \"Add a touch of luxury to your knitted hats with these faux fur pom poms. They come in various colors and are easy to attach.\"),\n    (\"Crochet Hook Case\", 11.99, 70, \"Keep your crochet hooks organized and protected with this stylish case. It features elastic loops to hold hooks securely in place.\"),\n    (\"Knitting Project Bag\", 27.99, 50, \"This spacious knitting project bag is perfect for carrying your supplies. It features multiple pockets and a drawstring closure for easy access.\"),\n    (\"Knitting Needle Gauge\", 4.99, 100, \"Ensure you're using the right needle size with this handy knitting needle gauge. Its compact design makes it easy to carry with your supplies.\"),\n    (\"Wool Yarn - Chunky\", 39.99, 30, \"This chunky wool yarn is perfect for quick projects and cozy garments. Its thick texture provides warmth and comfort for winter wear.\"),\n    (\"Crochet Stitch Dictionary\", 19.99, 65, \"Explore a variety of crochet stitches with this comprehensive stitch dictionary. It's a great resource for crafters looking to expand their skills.\"),\n    (\"Knitting Bag with Pockets\", 34.99, 25, \"This functional knitting bag features multiple pockets for organization and a stylish design. It's perfect for taking your projects on the go.\"),\n    (\"Knitting Needle Set\", 29.99, 40, \"This complete knitting needle set includes various sizes to suit all your projects. Made from high-quality materials, they provide a smooth knitting experience.\"),\n    (\"Crochet Yarn Bowl\", 22.99, 35, \"This ceramic crochet yarn bowl keeps your yarn from tangling while you work. Its unique design adds a decorative touch to your crafting space.\"),\n    (\"Knitting Stitch Holder\", 7.99, 150, \"Keep your stitches secure with these handy knitting stitch holders. They come in various sizes to accommodate different projects.\"),\n    (\"Knitting Machine Accessories\", 19.99, 20, \"Enhance your knitting machine experience with this set of accessories. It includes tools that make setup and use easier and more efficient.\"),\n    (\"Darning Needle Set\", 5.99, 200, \"This set of darning needles is perfect for weaving in ends and repairing knitted items. The large eyes make threading easy and efficient.\"),\n    (\"Crochet Lace Yarn\", 24.99, 50, \"This delicate lace yarn is perfect for creating intricate projects like shawls and doilies. Its soft texture and beautiful drape enhance your designs.\"),\n    (\"Knitting Pattern Cards\", 14.99, 60, \"These knitting pattern cards offer a variety of projects for all skill levels. They are easy to follow and perfect for on-the-go crafting.\"),\n    (\"Knitting Row Counter\", 8.99, 100, \"Keep track of your rows with this simple and effective knitting row counter. Its small size makes it easy to carry in your project bag.\"),\n    (\"Crochet Blanket Kit\", 49.99, 25, \"This crochet blanket kit includes everything you need to create a cozy throw. It features soft yarn and easy-to-follow instructions for beginners.\"),\n    (\"Knitting and Crochet Book\", 29.99, 40, \"This book offers a collection of both knitting and crochet patterns. It's perfect for crafters who want to explore both techniques.\"),\n    (\"Yarn Storage Container\", 19.99, 30, \"Keep your yarn organized and tangle-free with this spacious yarn storage container. Its clear design allows you to see your supplies at a glance.\"),\n    (\"Knitting Needle Point Protectors\", 6.99, 150, \"Protect your knitting project with these point protectors. They keep stitches from slipping off the ends of your needles when not in use.\"),\n    (\"Crochet Hook Grip\", 9.99, 80, \"These ergonomic crochet hook grips provide added comfort during long crafting sessions. They fit most standard crochet hooks and are easy to apply.\"),\n    (\"Knitting Chart Keeper\", 12.99, 50, \"Keep your knitting charts safe and visible with this chart keeper. Its magnetic design holds charts securely in place while you work.\"),\n    (\"Wool Yarn - Worsted Weight\", 34.99, 40, \"This worsted weight wool yarn is versatile and perfect for a wide range of projects. Its soft texture provides warmth and comfort for garments.\"),\n    (\"Knitting Needle Organizer\", 27.99, 30, \"This knitting needle organizer keeps your needles sorted and easily accessible. Its compact design fits perfectly in any project bag.\"),\n    (\"Crochet Stitch Markers Set\", 10.99, 100, \"This set of crochet stitch markers includes a variety of colors and styles. They help you track your progress and keep your projects organized.\"),\n    (\"Knitting Loom for Beginners\", 24.99, 50, \"This beginner-friendly knitting loom makes it easy to create beautiful knitted items. It's a fun way to learn the basics of knitting.\"),\n    (\"Crochet Yarn - Blended Fibers\", 29.99, 35, \"This blended fiber crochet yarn offers the best of both worlds, combining softness and durability. It's perfect for a range of projects from garments to accessories.\"),\n    (\"Knitting Pattern Organizer\", 14.99, 60, \"Stay organized with this knitting pattern organizer. It features pockets for storing patterns and a durable cover to keep everything safe.\"),\n    (\"Knitting and Crochet Gift Set\", 49.99, 20, \"This gift set includes a selection of yarn, needles, and patterns, making it perfect for beginners. It's an excellent way to introduce someone to the joys of crafting.\"),\n    (\"Crochet Hook Set with Case\", 34.99, 35, \"This crochet hook set comes with a stylish case for easy storage and transport. It includes a variety of hook sizes to suit all your projects.\"),\n    (\"Knitting Yarn - Superwash Wool\", 39.99, 30, \"This superwash wool yarn is perfect for easy care garments and accessories. Its softness and durability make it a favorite among knitters.\"),\n    (\"Crochet Patterns for Beginners\", 19.99, 50, \"This book features a collection of easy crochet patterns designed for beginners. Each project includes step-by-step instructions and helpful tips.\"),\n    (\"Knitting Needle Set with Case\", 29.99, 25, \"This knitting needle set features a range of sizes and comes with a convenient case for storage. It's perfect for crafters of all skill levels.\"),\n    (\"Crochet Yarn Bowl with Lid\", 24.99, 20, \"This yarn bowl with a lid keeps your yarn secure and tangle-free while you work. Its elegant design makes it a lovely addition to your crafting space.\"),\n    (\"Knitting Project Tracker\", 9.99, 100, \"Keep track of your knitting projects with this handy project tracker. It features space for notes, progress updates, and project details.\"),\n    (\"Crochet Hook with Ergonomic Handle\", 12.99, 70, \"This crochet hook features an ergonomic handle for added comfort during long crafting sessions. Its smooth finish allows for easy yarn gliding.\"),\n    (\"Knitting Gauge Tool\", 5.99, 150, \"This knitting gauge tool helps you determine the correct needle size and stitch gauge. It's a must-have for achieving the perfect fit in your projects.\"),\n    (\"Wool Yarn - Sport Weight\", 34.99, 30, \"This sport weight wool yarn is perfect for lightweight garments and accessories. Its soft texture and vibrant colors will inspire your creativity.\"),\n    (\"Crochet Kit for Beginners\", 29.99, 40, \"This beginner crochet kit includes everything you need to start your crafting journey. It features yarn, hooks, and easy-to-follow patterns.\"),\n    (\"Knitting Needle Case\", 18.99, 35, \"Keep your knitting needles organized and protected with this stylish needle case. It features compartments for different sizes and is easy to carry.\"),\n    (\"Knitting Pattern Book for Kids\", 19.99, 60, \"This knitting pattern book is perfect for introducing kids to the craft. It includes fun and easy patterns that will engage young crafters.\"),\n    (\"Crochet Yarn - Variegated\", 27.99, 50, \"This variegated crochet yarn adds a beautiful gradient effect to your projects. It's perfect for creating eye-catching blankets and garments.\"),\n    (\"Knitting Stitch Counter Ring\", 7.99, 100, \"This knitting stitch counter ring allows you to keep track of your stitches hands-free. Its stylish design makes it a fashionable accessory for crafters.\"),\n    (\"Crochet Blanket Pattern\", 14.99, 80, \"Create a cozy blanket with this easy crochet pattern. It includes step-by-step instructions and is suitable for beginners.\"),\n    (\"Knitting Needle Set - Interchangeable\", 49.99, 20, \"This interchangeable knitting needle set offers versatility for all your projects. It includes multiple needle sizes and cables for various lengths.\"),\n    (\"Crochet Amigurumi Pattern Book\", 24.99, 40, \"This amigurumi pattern book features a collection of adorable designs. It's perfect for crafters who want to create cute stuffed toys.\"),\n    (\"Knitting Yarn - Bulky Weight\", 39.99, 30, \"This bulky weight yarn is perfect for quick projects and warm winter garments. Its soft texture provides comfort and warmth.\"),\n    (\"Crochet Hook Set with Ergonomic Handles\", 34.99, 35, \"This crochet hook set features ergonomic handles for added comfort during long crafting sessions. It includes a variety of sizes to suit all projects.\"),\n    (\"Knitting Pattern for Scarves\", 19.99, 50, \"This pattern book includes a selection of stylish scarf designs. Each pattern is easy to follow and perfect for knitters of all levels.\"),\n    (\"Crochet Yarn - Blended Wool\", 29.99, 40, \"This blended wool yarn offers warmth and softness, making it ideal for winter projects. Its rich colors are perfect for creating cozy garments.\"),\n    (\"Knitting Needles - Circular\", 24.99, 30, \"These circular knitting needles are perfect for knitting in the round. Their smooth finish allows for easy sliding of stitches.\"),\n    (\"Crochet Pattern for Hats\", 14.99, 70, \"This pattern book features a variety of hat designs for all ages. It's perfect for crafters looking to create stylish headwear.\"),\n    (\"Knitting Yarn - Cotton Blend\", 27.99, 50, \"This cotton blend yarn is soft and breathable, making it ideal for summer projects. Its vibrant colors will add a pop to any creation.\"),\n    (\"Crochet Accessories Kit\", 19.99, 40, \"This crochet accessories kit includes everything you need to enhance your crafting experience. It features stitch markers, scissors, and more.\"),\n    (\"Knitting Needle Set - Bamboo\", 34.99, 25, \"This set of bamboo knitting needles is lightweight and eco-friendly. They provide a smooth knitting experience and are perfect for all skill levels.\"),\n    (\"Crochet Pattern Book for Beginners\", 24.99, 60, \"This beginner-friendly crochet pattern book includes easy projects to get you started. It features clear instructions and helpful tips.\"),\n    (\"Knitting Yarn - Acrylic Blend\", 29.99, 50, \"This acrylic blend yarn is soft, durable, and perfect for a variety of projects. Its wide range of colors makes it easy to find the perfect shade.\"),\n    (\"Crochet Hook - Steel\", 9.99, 100, \"This steel crochet hook is perfect for working with fine yarns and threads. Its sleek design allows for easy handling and precision.\"),\n    (\"Knitting Stitch Fixing Tool\", 12.99, 70, \"This tool is designed to help fix mistakes in your knitting projects. Its easy-to-use design makes it a must-have for any knitter.\"),\n    (\"Crochet Yarn - Specialty Fibers\", 34.99, 20, \"This specialty fibers yarn offers unique textures and colors, perfect for creating one-of-a-kind projects. It's ideal for crafters looking to experiment.\"),\n    (\"Knitting and Crochet Supplies Starter Kit\", 49.99, 15, \"This starter kit includes all the essential supplies for beginners in both knitting and crochet. It's a perfect gift for anyone looking to start crafting.\")\n]"