"[\n    (\"Safety Goggles\", 25.99, 150, \"These safety goggles provide excellent eye protection against flying debris and harmful chemicals. They are lightweight and comfortable for extended wear.\"),\n    (\"Hearing Protection Ear Muffs\", 35.50, 100, \"These ear muffs are designed to reduce noise levels in loud environments. They are adjustable for a secure fit and provide long-lasting comfort.\"),\n    (\"Reflective Safety Vest\", 15.99, 200, \"This reflective safety vest enhances visibility in low-light conditions. It features adjustable straps for a comfortable fit and is perfect for construction sites.\"),\n    (\"First Aid Kit\", 45.00, 75, \"A comprehensive first aid kit containing essential medical supplies for emergencies. It is compact and easy to carry, making it ideal for home or travel.\"),\n    (\"Fire Extinguisher\", 59.99, 50, \"This ABC fire extinguisher is suitable for use on common fires. It is easy to operate and comes with a mounting bracket for convenient storage.\"),\n    (\"Safety Harness\", 89.99, 40, \"This safety harness is designed for fall protection in construction and other high-risk jobs. It features adjustable straps for a secure and comfortable fit.\"),\n    (\"Traffic Cones\", 19.99, 120, \"These bright orange traffic cones are essential for directing traffic and ensuring safety on roadways. They are durable and lightweight for easy placement.\"),\n    (\"Personal Alarm Keychain\", 12.99, 200, \"This personal alarm keychain emits a loud sound to deter attackers and alert others in case of emergency. It is compact and easy to carry.\"),\n    (\"Emergency Whistle\", 3.99, 300, \"This emergency whistle is a must-have for outdoor enthusiasts. It is lightweight and can be heard from a distance, making it perfect for signaling for help.\"),\n    (\"Safety Boots\", 79.99, 80, \"These safety boots provide excellent protection with reinforced toes and slip-resistant soles. They are comfortable for all-day wear on the job.\"),\n    (\"Fire Blanket\", 24.99, 60, \"This fire blanket is an essential safety tool for extinguishing small fires. It is easy to use and can be stored conveniently in your kitchen.\"),\n    (\"LED Safety Light\", 14.99, 150, \"This LED safety light increases visibility during nighttime activities. It features multiple flashing modes and is weather-resistant.\"),\n    (\"Hard Hat\", 29.99, 100, \"This hard hat provides essential head protection in hazardous work environments. It is lightweight and features ventilation for comfort.\"),\n    (\"Safety Rope\", 49.99, 30, \"This safety rope is designed for climbing and rescue operations. It is made from durable materials and has a high weight capacity.\"),\n    (\"Knee Pads\", 22.50, 90, \"These knee pads provide cushioning and protection for knees during prolonged kneeling. They are adjustable for a secure fit and comfortable wear.\"),\n    (\"Smoke Detector\", 39.99, 50, \"This smoke detector provides early warning of fire hazards in your home. It features a loud alarm and is easy to install.\"),\n    (\"Carbon Monoxide Detector\", 49.99, 40, \"This carbon monoxide detector alerts you to dangerous levels of CO in your home. It is battery-operated for easy placement.\"),\n    (\"Safety Sign\", 15.99, 150, \"This safety sign clearly communicates hazards and safety protocols. It is made from durable materials for long-lasting use.\"),\n    (\"Portable Fire Pit\", 69.99, 25, \"This portable fire pit is perfect for outdoor gatherings. It provides warmth and ambiance while ensuring safety with its design.\"),\n    (\"Emergency Roadside Kit\", 59.99, 35, \"This emergency roadside kit includes essential tools for vehicle breakdowns. It is compact and fits easily in your trunk.\"),\n    (\"Safety Glasses\", 18.99, 200, \"These safety glasses provide impact protection for your eyes during work or sports. They are stylish and comfortable for everyday use.\"),\n    (\"Reflective Tape\", 9.99, 250, \"This reflective tape enhances visibility on vehicles and equipment. It is easy to apply and suitable for both indoor and outdoor use.\"),\n    (\"Child Safety Harness\", 29.99, 70, \"This child safety harness ensures your little one stays secure while out and about. It features adjustable straps for a comfortable fit.\"),\n    (\"Fall Protection Kit\", 199.99, 15, \"This fall protection kit includes everything needed for safe working at heights. It features a harness, lanyard, and anchor points.\"),\n    (\"Emergency Blanket\", 9.99, 100, \"This emergency blanket retains body heat in survival situations. It is lightweight and compact for easy storage in your emergency kit.\"),\n    (\"Safety Shower\", 299.99, 10, \"This safety shower provides immediate decontamination in case of chemical exposure. It is designed for use in laboratories and industrial settings.\"),\n    (\"Face Shield\", 29.99, 80, \"This face shield offers full-face protection against splashes and debris. It is lightweight and comfortable for extended wear.\"),\n    (\"High-Visibility Jacket\", 49.99, 60, \"This high-visibility jacket is designed for outdoor workers in low-light conditions. It features reflective strips for increased safety.\"),\n    (\"Safety Whistle\", 4.99, 200, \"This safety whistle is a compact tool for signaling in emergencies. It produces a loud sound that can be heard from a distance.\"),\n    (\"Mouth Guard\", 19.99, 120, \"This mouth guard protects your teeth during sports and physical activities. It is customizable for a perfect fit and comfort.\"),\n    (\"Fire Escape Ladder\", 79.99, 30, \"This fire escape ladder provides a safe exit from upper floors in case of fire. It is easy to deploy and supports multiple stories.\"),\n    (\"Safety Gloves\", 14.99, 150, \"These safety gloves provide protection against cuts and abrasions. They are durable and comfortable for various tasks.\"),\n    (\"Personal Protective Equipment (PPE) Kit\", 99.99, 25, \"This PPE kit includes masks, gloves, and gowns for complete protection. It is essential for healthcare workers and emergency responders.\"),\n    (\"Traffic Safety Barriers\", 89.99, 20, \"These traffic safety barriers are perfect for crowd control and road safety. They are lightweight and easy to set up.\"),\n    (\"Portable Safety Shower\", 249.99, 5, \"This portable safety shower provides decontamination in remote locations. It is easy to transport and set up for use.\"),\n    (\"Chemical Spill Kit\", 150.00, 15, \"This chemical spill kit contains everything needed to manage hazardous spills. It includes absorbent materials and protective gear.\"),\n    (\"Emergency Signaling Mirror\", 12.99, 100, \"This signaling mirror is a survival tool for outdoor enthusiasts. It can be used to signal for help over long distances.\"),\n    (\"Safety Backpack\", 49.99, 50, \"This safety backpack is designed to carry emergency supplies. It features reflective materials for visibility and multiple compartments.\"),\n    (\"Portable Air Horn\", 19.99, 80, \"This portable air horn is perfect for signaling in emergencies. It produces a loud sound and is easy to carry.\"),\n    (\"Survival Kit\", 89.99, 30, \"This survival kit includes essential tools and supplies for emergencies. It is compact and designed for outdoor adventures.\"),\n    (\"Traffic Safety Vest\", 29.99, 100, \"This traffic safety vest enhances visibility for workers on the road. It is lightweight and adjustable for a comfortable fit.\"),\n    (\"Safety Pin\", 1.99, 500, \"This safety pin is a versatile tool for securing clothing and fabric. It is an essential item for any first aid kit.\"),\n    (\"Bicycle Helmet\", 49.99, 80, \"This bicycle helmet provides crucial head protection for cyclists. It features adjustable straps for a secure fit and ventilation for comfort.\"),\n    (\"Pet Safety Harness\", 34.99, 50, \"This pet safety harness ensures your furry friend is secure during car rides. It is adjustable and comfortable for your pet.\"),\n    (\"Work Gloves\", 15.99, 200, \"These work gloves provide protection and grip for various tasks. They are durable and designed for comfort during extended use.\"),\n    (\"Emergency Flashlight\", 19.99, 100, \"This emergency flashlight is essential for power outages and emergencies. It features multiple brightness settings and is rechargeable.\"),\n    (\"Portable Safety Barrier\", 39.99, 40, \"This portable safety barrier is perfect for crowd control at events. It is lightweight and easy to set up and transport.\"),\n    (\"Flood Light\", 59.99, 30, \"This flood light provides bright illumination for outdoor work sites. It is durable and weather-resistant for all conditions.\"),\n    (\"Safety Tapes\", 9.99, 250, \"These safety tapes are used to mark hazardous areas and ensure safety. They are bright and highly visible for effective communication.\"),\n    (\"Emergency Radio\", 39.99, 50, \"This emergency radio provides weather updates and alerts during power outages. It features a hand-crank option for charging.\"),\n    (\"Safety Ladder\", 89.99, 20, \"This safety ladder is designed for stability and safety during high-access tasks. It is lightweight and easy to transport.\"),\n    (\"Childproof Cabinet Locks\", 14.99, 150, \"These childproof cabinet locks keep hazardous materials out of reach of children. They are easy to install and operate.\"),\n    (\"Safety Net\", 99.99, 15, \"This safety net is designed for fall protection in construction sites. It is durable and easy to install for immediate safety.\"),\n    (\"Portable Fire Extinguisher\", 39.99, 40, \"This portable fire extinguisher is essential for home safety. It is compact and easy to use in case of fire emergencies.\"),\n    (\"Caution Tape\", 4.99, 300, \"This caution tape is perfect for marking off hazardous areas. It is bright and highly visible for effective warnings.\"),\n    (\"Safety Training Manual\", 24.99, 80, \"This safety training manual provides essential information for workplace safety. It covers protocols and best practices for various scenarios.\"),\n    (\"Emergency Survival Whistle\", 5.99, 200, \"This emergency survival whistle is a compact tool for signaling in distress. It produces a loud sound that can be heard from afar.\"),\n    (\"Child Safety Gate\", 59.99, 50, \"This child safety gate prevents toddlers from accessing dangerous areas. It is adjustable and easy to install in various openings.\"),\n    (\"Workplace Safety Poster\", 15.99, 150, \"This workplace safety poster provides essential safety tips and guidelines. It is designed to promote awareness and compliance.\"),\n    (\"Reflective Safety Stickers\", 9.99, 250, \"These reflective safety stickers enhance visibility on vehicles and equipment. They are easy to apply and durable for long-lasting use.\"),\n    (\"Portable Fire Alarm\", 99.99, 10, \"This portable fire alarm provides early warning of fire hazards. It is battery-operated and suitable for temporary setups.\"),\n    (\"Safety Inspection Checklist\", 12.99, 100, \"This safety inspection checklist helps ensure compliance with safety regulations. It is a useful tool for safety officers and managers.\"),\n    (\"Emergency Phone Charger\", 29.99, 75, \"This emergency phone charger ensures your devices stay powered during outages. It is compact and easy to carry for emergencies.\"),\n    (\"Safety Gear Bag\", 39.99, 50, \"This safety gear bag is designed to organize and transport safety equipment. It features multiple compartments for easy access.\"),\n    (\"High-Visibility Gloves\", 14.99, 150, \"These high-visibility gloves enhance safety in low-light conditions. They are durable and comfortable for various tasks.\"),\n    (\"Survival Fishing Kit\", 24.99, 80, \"This survival fishing kit provides essential tools for fishing in emergencies. It is compact and perfect for outdoor adventures.\"),\n    (\"Fire Safety Plan Template\", 19.99, 100, \"This fire safety plan template helps businesses create effective fire safety protocols. It is easy to customize for specific needs.\"),\n    (\"Emergency Preparedness Guide\", 29.99, 50, \"This emergency preparedness guide provides essential tips for disaster readiness. It covers various scenarios and practical solutions.\")\n]"