"products = [\n    (\"UltraCharge 10000\", 29.99, 150, \"This compact portable charger offers a powerful 10,000mAh capacity, perfect for charging smartphones multiple times. Its sleek design and lightweight build make it easy to carry anywhere.\"),\n    (\"PowerBank Pro 20000\", 49.99, 80, \"With a massive 20,000mAh capacity, this power bank can charge your devices several times over. Its dual USB ports allow you to charge two devices simultaneously.\"),\n    (\"PocketJuice 5000\", 19.99, 200, \"A pocket-sized charger with 5,000mAh capacity, ideal for quick top-ups on the go. Its built-in LED indicators show remaining battery life.\"),\n    (\"ChargeIt All 15000\", 39.99, 120, \"This versatile charger features a 15,000mAh battery and multiple output options. Its rugged design is perfect for outdoor adventures.\"),\n    (\"SlimPower 10000\", 25.99, 90, \"A slim and lightweight charger that fits easily in your bag. With 10,000mAh, it provides enough power for all-day use.\"),\n    (\"FastCharge Turbo 30000\", 59.99, 70, \"This high-capacity charger boasts 30,000mAh and fast charging technology. Perfect for heavy users who need quick and reliable power.\"),\n    (\"EcoCharge 12000\", 34.99, 110, \"Made from recycled materials, this eco-friendly charger offers 12,000mAh of power. It's a great choice for environmentally conscious consumers.\"),\n    (\"TravelBuddy 8000\", 22.99, 160, \"Designed for travelers, this charger features 8,000mAh and a compact design. It comes with international plug adapters for global use.\"),\n    (\"RuggedPower 20000\", 45.99, 75, \"This durable charger is built to withstand tough conditions and offers 20,000mAh capacity. Ideal for outdoor enthusiasts and adventurers.\"),\n    (\"WirelessCharge Pad\", 34.99, 140, \"A sleek wireless charging pad that offers fast charging for compatible devices. Its minimalist design fits perfectly on any desk or nightstand.\"),\n    (\"MiniCharge 3000\", 14.99, 250, \"A tiny but powerful charger with 3,000mAh capacity, perfect for emergencies. Its keychain design ensures you always have power on hand.\"),\n    (\"DualCharge 10000\", 32.99, 100, \"This portable charger features dual USB outputs and a 10,000mAh capacity. Ideal for charging two devices at once without any hassle.\"),\n    (\"SolarPower Charger\", 39.99, 65, \"Harness the power of the sun with this solar-powered charger. Its 10,000mAh capacity ensures you stay charged even in remote locations.\"),\n    (\"LightningCharge 50000\", 79.99, 30, \"A powerhouse with 50,000mAh capacity, perfect for extended trips. It features multiple output ports for charging several devices at once.\"),\n    (\"CompactCharge 6000\", 18.99, 180, \"This compact charger packs 6,000mAh of power into a small form factor. Perfect for slipping into your pocket or purse.\"),\n    (\"SmartCharge 10000\", 29.99, 140, \"Featuring smart charging technology, this 10,000mAh power bank optimizes charging speed for your devices. Its sleek design makes it a stylish accessory.\"),\n    (\"GameOn PowerBank\", 34.99, 85, \"Designed for gamers, this charger features a 15,000mAh capacity and a built-in gaming mode. Keep your devices powered during intense gaming sessions.\"),\n    (\"LEDCharge 12000\", 36.99, 95, \"This charger features a built-in LED flashlight for emergencies. With 12,000mAh, it can power up your devices and light your way.\"),\n    (\"AirCharge Wireless\", 45.99, 50, \"This wireless charger allows you to charge your phone without any cables. Its stylish design and 10,000mAh capacity make it a must-have accessory.\"),\n    (\"FastPower 20000\", 54.99, 60, \"Equipped with fast charging capabilities, this 20,000mAh charger is perfect for quick power-ups. Its durable design ensures longevity.\"),\n    (\"ChargerMate 10000\", 29.99, 130, \"This user-friendly charger features a 10,000mAh capacity and an ergonomic design. Ideal for everyday use and travel.\"),\n    (\"PowerCore 15000\", 39.99, 70, \"With a 15,000mAh capacity, this power bank is perfect for keeping your devices charged throughout the day. Its robust build ensures durability.\"),\n    (\"QuickCharge 8000\", 27.99, 110, \"This charger supports quick charging for compatible devices, with a capacity of 8,000mAh. Its compact design makes it easy to transport.\"),\n    (\"FamilyCharge 40000\", 69.99, 40, \"Perfect for families, this charger features a 40,000mAh capacity and multiple ports. Keep everyone's devices powered during outings.\"),\n    (\"SmartPower 10000\", 32.99, 90, \"This smart charger automatically detects your device's power needs. With 10,000mAh, it ensures efficient and safe charging.\"),\n    (\"SlimFit Charger\", 24.99, 150, \"A slim and lightweight design makes this charger easy to carry. With 10,000mAh, it's perfect for daily use.\"),\n    (\"FastCharge Duo\", 39.99, 80, \"This dual-port charger features fast charging technology and a 15,000mAh capacity. Ideal for charging two devices at once.\"),\n    (\"Portable Solar Charger\", 42.99, 55, \"This solar-powered charger is perfect for outdoor adventures. With 10,000mAh, it keeps your devices charged while you explore.\"),\n    (\"MiniPower 4000\", 16.99, 200, \"A mini charger with 4,000mAh capacity, great for quick charges on the go. Its compact size makes it a convenient travel companion.\"),\n    (\"ToughCharge 15000\", 48.99, 65, \"Built for durability, this charger features a rugged design and 15,000mAh capacity. Perfect for those who lead an active lifestyle.\"),\n    (\"Wireless Power Bank\", 37.99, 75, \"This power bank offers both wired and wireless charging options. With 10,000mAh, it's versatile for all your charging needs.\"),\n    (\"Ultra Slim Charger\", 29.99, 100, \"This ultra-slim power bank is designed for portability with a 10,000mAh capacity. Perfect for slipping into your pocket or bag.\"),\n    (\"Adventure PowerBank\", 45.99, 50, \"Designed for adventurers, this charger features a 20,000mAh capacity and a rugged exterior. It can withstand the elements while keeping your devices powered.\"),\n    (\"PowerGrip Charger\", 34.99, 90, \"This charger features a textured grip for easy handling and a 12,000mAh capacity. Ideal for daily use and travel.\"),\n    (\"QuickCharge Mini\", 24.99, 140, \"A compact charger with quick charging capabilities and a 6,000mAh capacity. Perfect for those who need a speedy power boost.\"),\n    (\"EcoFriendly Charger\", 39.99, 80, \"Made from sustainable materials, this charger offers 10,000mAh of power. It's a great choice for eco-conscious consumers.\"),\n    (\"SmartCharge Duo\", 35.99, 60, \"This dual-port charger features smart technology for optimal charging. With 15,000mAh, it's perfect for charging two devices at once.\"),\n    (\"FastCharge Wireless\", 49.99, 70, \"A wireless charger that supports fast charging for compatible devices. Its stylish design makes it a great addition to any workspace.\"),\n    (\"PowerMax 25000\", 69.99, 45, \"With a whopping 25,000mAh capacity, this power bank is perfect for extended trips. It features multiple output ports for charging several devices.\"),\n    (\"TravelCharge 8000\", 22.99, 150, \"A travel-friendly charger with 8,000mAh capacity and a compact design. Ideal for keeping your devices powered while on the go.\"),\n    (\"Rugged Solar Charger\", 49.99, 55, \"This rugged solar charger offers 10,000mAh capacity and is perfect for outdoor use. Its durable design can withstand harsh conditions.\"),\n    (\"MiniBoost 3000\", 14.99, 250, \"A small yet powerful charger with 3,000mAh capacity, perfect for emergencies. Its keychain design ensures you always have power at hand.\"),\n    (\"Family PowerPack\", 59.99, 40, \"This family-sized charger features a 30,000mAh capacity and multiple ports. Keep everyone's devices charged during outings.\"),\n    (\"QuickCharge PowerBank\", 34.99, 80, \"This power bank supports quick charging and offers a 10,000mAh capacity. Its compact design makes it perfect for travel.\"),\n    (\"UltraCharge 20000\", 49.99, 70, \"This ultra-capacity charger features 20,000mAh and fast charging technology. Ideal for heavy users who need reliable power.\"),\n    (\"EcoCharge Mini\", 18.99, 180, \"A compact, eco-friendly charger with 5,000mAh capacity. Perfect for quick charges while being kind to the planet.\"),\n    (\"SolarBoost Charger\", 39.99, 60, \"Harness solar energy with this 10,000mAh solar charger. Its lightweight design makes it ideal for hiking and camping.\"),\n    (\"PowerWave 15000\", 36.99, 90, \"This power bank features a 15,000mAh capacity and a sleek design. Perfect for keeping your devices charged while on the go.\"),\n    (\"FastCharge Lite\", 29.99, 100, \"A lightweight charger with fast charging capabilities and 10,000mAh capacity. Ideal for everyday use and travel.\"),\n    (\"Rugged PowerBank\", 45.99, 50, \"Built for durability, this rugged power bank features a 20,000mAh capacity. Perfect for outdoor adventures and tough conditions.\"),\n    (\"Wireless Charge Pro\", 39.99, 75, \"This professional-grade wireless charger offers fast charging for compatible devices. Its elegant design fits seamlessly into any environment.\"),\n    (\"UltraCompact Charger\", 24.99, 150, \"An ultra-compact charger with a 10,000mAh capacity, perfect for travel. Its sleek design makes it easy to carry.\"),\n    (\"Adventure Solar Charger\", 42.99, 55, \"This solar-powered charger is designed for outdoor enthusiasts. With a 10,000mAh capacity, it keeps your devices charged in remote locations.\"),\n    (\"PowerPack 30000\", 69.99, 40, \"This high-capacity charger features 30,000mAh and multiple ports for charging several devices. Ideal for family trips.\"),\n    (\"FastCharge Duo Pro\", 39.99, 60, \"This dual-port charger features fast charging technology and a 15,000mAh capacity. Perfect for charging two devices at once quickly.\"),\n    (\"EcoCharge 8000\", 27.99, 110, \"An eco-friendly charger with 8,000mAh capacity, made from sustainable materials. Perfect for environmentally conscious consumers.\"),\n    (\"SmartCharge Max\", 34.99, 90, \"This smart charger features a 10,000mAh capacity and optimizes charging speed for your devices. Its sleek design makes it a stylish accessory.\"),\n    (\"MiniPower 6000\", 18.99, 180, \"A mini charger with 6,000mAh capacity, great for quick charges on the go. Its compact size makes it a convenient travel companion.\"),\n    (\"PowerBoost 20000\", 54.99, 60, \"This powerful charger features a 20,000mAh capacity and fast charging capabilities. Perfect for keeping all your devices powered.\"),\n    (\"QuickCharge Pro\", 39.99, 70, \"A professional-grade charger with quick charging technology and 15,000mAh capacity. Ideal for heavy users who need reliable power.\"),\n    (\"SlimLine Charger\", 29.99, 100, \"A slim and lightweight design makes this charger easy to carry. With 10,000mAh, it's perfect for daily use.\"),\n    (\"FastCharge Solar\", 49.99, 50, \"Harness solar energy with this fast-charging solar charger. Its 10,000mAh capacity is perfect for outdoor adventures.\"),\n    (\"PowerHub 25000\", 69.99, 45, \"This hub charger features 25,000mAh capacity and multiple output ports. Perfect for keeping all your devices charged during family outings.\"),\n    (\"EcoCharge Pro\", 39.99, 80, \"An eco-friendly charger with 10,000mAh capacity, made from sustainable materials. Ideal for environmentally conscious consumers.\")\n]"