"[(\"Whey Protein Isolate\", 29.99, 100, \"A premium whey protein isolate that provides 25g of protein per serving. It's low in carbs and fat, making it perfect for muscle building and recovery.\"), \n(\"Casein Protein Powder\", 34.99, 80, \"This slow-digesting protein is ideal for nighttime recovery. It helps to prevent muscle breakdown while you sleep, providing a steady release of amino acids.\"), \n(\"Plant-Based Protein Blend\", 24.99, 150, \"A delicious blend of pea, rice, and hemp protein for a complete amino acid profile. It's perfect for vegans and those with lactose intolerance.\"), \n(\"Egg White Protein\", 39.99, 60, \"Made from 100% egg whites, this protein powder is rich in essential amino acids. It's an excellent choice for those seeking a high-quality protein source.\"), \n(\"Soy Protein Isolate\", 27.99, 90, \"This soy protein isolate offers a complete protein profile and is great for muscle recovery. It's a great alternative for those avoiding dairy.\"), \n(\"Chocolate Whey Protein\", 31.99, 70, \"Rich chocolate flavor makes this whey protein a tasty addition to your shakes. It's loaded with 24g of protein per scoop, perfect for post-workout.\"), \n(\"Vanilla Bean Protein Powder\", 29.99, 85, \"A smooth and creamy vanilla protein powder that mixes easily. It's ideal for smoothies, baking, or as a protein boost in your meals.\"), \n(\"Pea Protein Powder\", 22.99, 110, \"This plant-based protein is easy to digest and hypoallergenic. It's perfect for those looking to increase their protein intake without dairy.\"), \n(\"Hydrolyzed Whey Protein\", 39.99, 75, \"Fast-absorbing hydrolyzed whey protein designed for rapid muscle recovery. It's ideal for athletes and bodybuilders who need quick nutrition.\"), \n(\"Protein Pancake Mix\", 19.99, 120, \"Start your day with protein-packed pancakes that are easy to make. Each serving delivers 15g of protein, making breakfast delicious and nutritious.\"), \n(\"Protein Bar Variety Pack\", 34.99, 45, \"A selection of protein bars featuring different flavors. Each bar contains 20g of protein, perfect for a quick snack on the go.\"), \n(\"Beef Protein Powder\", 49.99, 50, \"A unique protein source derived from beef, offering a high protein content. It's perfect for those looking for an alternative to dairy-based proteins.\"), \n(\"MCT Oil Protein Powder\", 29.99, 40, \"This protein powder is infused with MCT oil for added energy and endurance. Ideal for keto dieters and those seeking a quick energy boost.\"), \n(\"Coconut Protein Powder\", 25.99, 65, \"A tropical twist on protein powder, this coconut flavor adds a unique taste to your shakes. It's made from high-quality plant proteins.\"), \n(\"Pumpkin Seed Protein\", 27.99, 55, \"Rich in nutrients, this pumpkin seed protein powder is perfect for smoothies and baking. It's a great source of magnesium and zinc.\"), \n(\"Rice Protein Powder\", 21.99, 100, \"A hypoallergenic protein powder made from brown rice. It's easily digestible and perfect for those with dietary restrictions.\"), \n(\"Chocolate Peanut Butter Protein\", 32.99, 60, \"Indulge in the rich flavors of chocolate and peanut butter while fueling your body with protein. Each serving offers 25g of protein.\"), \n(\"Vanilla Almond Protein\", 28.99, 80, \"A delicious blend of vanilla and almond flavors that enhances any shake. It contains 24g of protein and is low in sugar.\"), \n(\"Strawberry Protein Powder\", 25.99, 70, \"This fruity protein powder is perfect for adding a sweet touch to your smoothies. Each serving provides 20g of protein.\"), \n(\"Matcha Green Tea Protein\", 34.99, 45, \"Combining the benefits of matcha with protein, this powder is perfect for energy and recovery. It contains antioxidants and 22g of protein.\"), \n(\"Cacao Protein Powder\", 29.99, 50, \"Rich in antioxidants, this cacao protein powder is perfect for chocolate lovers. Each serving provides 23g of protein.\"), \n(\"Oat Protein Powder\", 22.99, 90, \"A wholesome protein source made from oats, providing fiber and protein. It's great for smoothies and baking.\"), \n(\"Greek Yogurt Protein Powder\", 39.99, 40, \"Infused with the creamy goodness of Greek yogurt, this protein powder is rich in probiotics. It offers 25g of protein per serving.\"), \n(\"Chocolate Mint Protein\", 31.99, 60, \"Enjoy the refreshing taste of chocolate mint while boosting your protein intake. Each serving delivers 24g of protein.\"), \n(\"Caramel Protein Powder\", 28.99, 75, \"A sweet caramel flavor that makes your shakes irresistible. Packed with 22g of protein, it's perfect for dessert lovers.\"), \n(\"Banana Protein Powder\", 25.99, 80, \"Bring the taste of ripe bananas to your protein shakes. Each serving provides 20g of protein and is rich in potassium.\"), \n(\"Cinnamon Roll Protein\", 32.99, 50, \"Indulge in the warm flavors of cinnamon rolls while fueling your body. This protein powder contains 25g of protein per serving.\"), \n(\"Nut Butter Protein Powder\", 29.99, 45, \"A delicious blend of nut butter flavors that adds creaminess to your shakes. Each serving offers 20g of protein.\"), \n(\"Tropical Fruit Protein\", 24.99, 100, \"A vibrant blend of tropical fruit flavors that energizes your shakes. Each serving contains 22g of protein.\"), \n(\"Vanilla Chai Protein\", 27.99, 70, \"A unique blend of vanilla and chai spices that adds warmth to your protein shakes. Each serving provides 24g of protein.\"), \n(\"Lemon Meringue Protein\", 31.99, 60, \"Brighten your day with the zesty flavor of lemon meringue in your shakes. Each serving delivers 23g of protein.\"), \n(\"Hazelnut Protein Powder\", 29.99, 50, \"Rich hazelnut flavor that pairs well with coffee or smoothies. Packed with 22g of protein per serving.\"), \n(\"Almond Coconut Protein\", 28.99, 75, \"A delightful mix of almond and coconut flavors that enhances your protein intake. Each serving contains 24g of protein.\"), \n(\"Raspberry Protein Powder\", 25.99, 80, \"A refreshing raspberry flavor that adds a fruity twist to your shakes. Each serving provides 20g of protein.\"), \n(\"Peanut Butter Protein Powder\", 29.99, 60, \"Rich in flavor, this peanut butter protein powder is perfect for smoothies and baking. Each serving offers 25g of protein.\"), \n(\"Cinnamon Spice Protein\", 24.99, 90, \"A warm cinnamon spice flavor that adds a cozy touch to your shakes. Each serving contains 22g of protein.\"), \n(\"Fruit Punch Protein\", 27.99, 70, \"A fun and fruity flavor that makes protein shakes enjoyable. Each serving provides 20g of protein.\"), \n(\"Mocha Protein Powder\", 31.99, 50, \"A delicious blend of coffee and chocolate flavors for a morning boost. Each serving contains 24g of protein.\"), \n(\"Pina Colada Protein\", 29.99, 45, \"Bring the taste of the tropics to your protein shakes with this pina colada flavor. Each serving offers 22g of protein.\"), \n(\"Maple Syrup Protein\", 28.99, 65, \"Sweet maple syrup flavor that enhances your protein shakes and pancakes. Each serving contains 23g of protein.\"), \n(\"Cherry Almond Protein\", 25.99, 80, \"A delightful cherry almond flavor that adds a unique twist to your shakes. Each serving provides 20g of protein.\"), \n(\"Peach Protein Powder\", 24.99, 90, \"A sweet peach flavor that brightens your protein intake. Each serving contains 22g of protein.\"), \n(\"Chocolate Coconut Protein\", 29.99, 60, \"Indulge in the rich flavors of chocolate and coconut in your shakes. Each serving offers 25g of protein.\"), \n(\"Vanilla Chai Protein\", 31.99, 50, \"A comforting blend of vanilla and chai spices that enhances your protein shakes. Each serving contains 24g of protein.\"), \n(\"Berry Blast Protein\", 27.99, 70, \"A mix of berry flavors that makes your shakes delicious and nutritious. Each serving provides 20g of protein.\"), \n(\"Toffee Protein Powder\", 28.99, 75, \"Rich toffee flavor that adds a sweet touch to your protein shakes. Each serving contains 23g of protein.\"), \n(\"S'mores Protein Powder\", 32.99, 50, \"Enjoy the nostalgic flavors of s'mores in your protein shakes. Each serving offers 24g of protein.\"), \n(\"Carrot Cake Protein\", 29.99, 60, \"A unique flavor that brings the taste of carrot cake to your shakes. Each serving provides 22g of protein.\"), \n(\"Gingerbread Protein\", 24.99, 90, \"Festive gingerbread flavor perfect for holiday shakes. Each serving contains 20g of protein.\"), \n(\"Chocolate Chip Cookie Protein\", 31.99, 50, \"Indulge in the taste of chocolate chip cookies while fueling your body. Each serving offers 24g of protein.\"), \n(\"Maple Pecan Protein\", 29.99, 45, \"A delicious blend of maple and pecan flavors that enhances your shakes. Each serving contains 22g of protein.\"), \n(\"Mango Protein Powder\", 25.99, 80, \"A tropical mango flavor that adds sweetness to your protein shakes. Each serving provides 20g of protein.\"), \n(\"Coconut Cream Protein\", 28.99, 75, \"A creamy coconut flavor that makes your shakes irresistible. Each serving contains 23g of protein.\"), \n(\"Chocolate Raspberry Protein\", 29.99, 60, \"A delightful combination of chocolate and raspberry flavors in your shakes. Each serving offers 25g of protein.\"), \n(\"Tropical Green Protein\", 34.99, 50, \"A blend of tropical fruits and greens for a nutritious shake. Each serving contains 22g of protein.\"), \n(\"Lemon Ginger Protein\", 27.99, 70, \"A zesty lemon and ginger flavor that adds a refreshing twist to your shakes. Each serving provides 20g of protein.\"), \n(\"Spiced Apple Protein\", 31.99, 60, \"Warm spiced apple flavor that enhances your protein shakes. Each serving contains 24g of protein.\"), \n(\"Chocolate Cherry Protein\", 29.99, 50, \"A rich chocolate and cherry flavor that makes your shakes delicious. Each serving offers 22g of protein.\"), \n(\"Almond Joy Protein\", 28.99, 75, \"A delightful blend of chocolate and almond flavors reminiscent of the candy bar. Each serving contains 23g of protein.\"), \n(\"Coconut Lime Protein\", 25.99, 80, \"A refreshing coconut and lime flavor that brightens your shakes. Each serving provides 20g of protein.\"), \n(\"Honey Vanilla Protein\", 24.99, 90, \"A sweet honey vanilla flavor that makes your shakes delicious. Each serving contains 22g of protein.\"), \n(\"Dark Chocolate Protein\", 31.99, 50, \"Rich dark chocolate flavor that satisfies your cravings while boosting protein intake. Each serving offers 24g of protein.\"), \n(\"Cinnamon Roll Protein\", 29.99, 60, \"Indulge in the flavors of cinnamon rolls while fueling your body. Each serving provides 22g of protein.\"), \n(\"Berry Protein Blend\", 27.99, 70, \"A mix of berry flavors that enhances your shakes and smoothies. Each serving contains 20g of protein.\"), \n(\"Chocolate Hazelnut Protein\", 28.99, 75, \"A delicious combination of chocolate and hazelnut flavors for your shakes. Each serving offers 23g of protein.\"), \n(\"Chai Spice Protein\", 29.99, 60, \"A warm chai spice flavor that adds a comforting touch to your protein shakes. Each serving contains 24g of protein.\"), \n(\"Pumpkin Spice Protein\", 25.99, 80, \"A seasonal favorite, this pumpkin spice protein is perfect for fall. Each serving provides 20g of protein.\"), \n(\"Peanut Butter Cup Protein\", 31.99, 50, \"Enjoy the rich flavors of peanut butter cups in your shakes. Each serving offers 22g of protein.\"), \n(\"Vanilla Coconut Protein\", 28.99, 75, \"A creamy blend of vanilla and coconut that enhances your shakes. Each serving contains 23g of protein.\"), \n(\"Chocolate Mint Protein\", 29.99, 60, \"A refreshing chocolate mint flavor that adds a twist to your shakes. Each serving provides 24g of protein.\"), \n(\"Strawberry Banana Protein\", 27.99, 70, \"A classic combination of strawberry and banana that enhances your shakes. Each serving contains 20g of protein.\"), \n(\"Peanut Butter Banana Protein\", 29.99, 50, \"A delicious blend of peanut butter and banana flavors in your shakes. Each serving offers 22g of protein.\"), \n(\"Caramel Macchiato Protein\", 31.99, 60, \"Indulge in the rich flavors of caramel macchiato while fueling your body. Each serving contains 24g of protein.\"), \n(\"Chocolate Orange Protein\", 28.99, 75, \"A unique blend of chocolate and orange flavors for your shakes. Each serving provides 23g of protein.\"), \n(\"Vanilla Caramel Protein\", 25.99, 80, \"A sweet vanilla caramel flavor that enhances your protein shakes. Each serving contains 20g of protein.\"), \n(\"Maple Vanilla Protein\", 29.99, 60, \"A delightful blend of maple and vanilla flavors for your shakes. Each serving offers 22g of protein.\"), \n(\"Coconut Chai Protein\", 27.99, 70, \"A comforting blend of coconut and chai spices that enhances your shakes. Each serving contains 20g of protein.\"), \n(\"Chocolate Peanut Butter Cup Protein\", 31.99, 50, \"Rich chocolate and peanut butter cup flavor that satisfies your cravings. Each serving offers 24g of protein.\"), \n(\"Berry Smoothie Protein\", 29.99, 60, \"A refreshing berry smoothie flavor that makes your shakes delicious. Each serving provides 22g of protein.\"), \n(\"Vanilla Berry Protein\", 28.99, 75, \"A delightful blend of vanilla and berry flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Chocolate Chip Protein\", 25.99, 80, \"Enjoy the taste of chocolate chip cookies in your shakes. Each serving provides 20g of protein.\"), \n(\"Cinnamon Apple Protein\", 29.99, 60, \"A warm cinnamon apple flavor that enhances your protein shakes. Each serving offers 22g of protein.\"), \n(\"Raspberry Lemonade Protein\", 27.99, 70, \"A refreshing raspberry lemonade flavor that adds zest to your shakes. Each serving contains 20g of protein.\"), \n(\"Mint Chocolate Chip Protein\", 31.99, 50, \"A delicious mint chocolate chip flavor that makes your shakes enjoyable. Each serving provides 24g of protein.\"), \n(\"Tropical Berry Protein\", 28.99, 75, \"A blend of tropical and berry flavors that enhances your shakes. Each serving contains 23g of protein.\"), \n(\"Chocolate Coconut Almond Protein\", 29.99, 60, \"Rich chocolate, coconut, and almond flavors combine for a delicious shake. Each serving provides 22g of protein.\"), \n(\"Peach Mango Protein\", 25.99, 80, \"A sweet peach mango flavor that brightens your protein shakes. Each serving contains 20g of protein.\"), \n(\"Pineapple Protein Powder\", 24.99, 90, \"A tropical pineapple flavor that adds sweetness to your shakes. Each serving provides 22g of protein.\"), \n(\"Caramel Apple Protein\", 31.99, 50, \"A delicious caramel apple flavor that enhances your protein intake. Each serving offers 24g of protein.\"), \n(\"Chocolate Strawberry Protein\", 28.99, 75, \"A delightful combination of chocolate and strawberry flavors. Each serving contains 23g of protein.\"), \n(\"Minty Vanilla Protein\", 27.99, 70, \"A refreshing minty vanilla flavor that adds a twist to your shakes. Each serving provides 20g of protein.\"), \n(\"Chocolate Coconut Protein\", 29.99, 60, \"Indulge in the rich flavors of chocolate and coconut. Each serving offers 22g of protein.\"), \n(\"Blueberry Protein Powder\", 25.99, 80, \"A sweet blueberry flavor that enhances your shakes. Each serving contains 20g of protein.\"), \n(\"Chocolate Peanut Butter Protein\", 31.99, 50, \"Rich chocolate and peanut butter flavor that satisfies your cravings. Each serving offers 24g of protein.\"), \n(\"Coconut Raspberry Protein\", 28.99, 75, \"A delightful blend of coconut and raspberry flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Strawberry Kiwi Protein\", 29.99, 60, \"A refreshing strawberry kiwi flavor that adds zest to your shakes. Each serving provides 22g of protein.\"), \n(\"Chocolate Almond Protein\", 27.99, 70, \"Indulge in the rich flavors of chocolate and almond. Each serving contains 20g of protein.\"), \n(\"Honey Cinnamon Protein\", 31.99, 50, \"A sweet honey and cinnamon flavor that enhances your shakes. Each serving offers 24g of protein.\"), \n(\"Tropical Mango Protein\", 29.99, 60, \"A sweet and tropical mango flavor that brightens your shakes. Each serving provides 22g of protein.\"), \n(\"Chocolate Cherry Almond Protein\", 28.99, 75, \"A delightful blend of chocolate, cherry, and almond flavors. Each serving contains 23g of protein.\"), \n(\"Coconut Lime Protein\", 25.99, 80, \"A refreshing coconut and lime flavor that adds a tropical touch. Each serving provides 20g of protein.\"), \n(\"Peanut Butter Cookie Protein\", 29.99, 60, \"Rich peanut butter cookie flavor that satisfies your cravings. Each serving offers 22g of protein.\"), \n(\"Chocolate Mint Protein\", 31.99, 50, \"A refreshing chocolate mint flavor that adds a twist to your shakes. Each serving contains 24g of protein.\"), \n(\"Vanilla Chai Protein\", 28.99, 75, \"A comforting blend of vanilla and chai spices that enhances your shakes. Each serving contains 23g of protein.\"), \n(\"Strawberry Lemon Protein\", 27.99, 70, \"A refreshing strawberry lemon flavor that brightens your shakes. Each serving provides 20g of protein.\"), \n(\"Chocolate Peanut Butter Banana Protein\", 29.99, 60, \"A delicious blend of chocolate, peanut butter, and banana flavors. Each serving offers 22g of protein.\"), \n(\"Vanilla Berry Protein\", 28.99, 75, \"A delightful mix of vanilla and berry flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Caramel Vanilla Protein\", 25.99, 80, \"A sweet caramel and vanilla flavor that enhances your shakes. Each serving provides 20g of protein.\"), \n(\"Chocolate Coconut Protein\", 29.99, 60, \"Rich chocolate and coconut flavor that makes your shakes delicious. Each serving offers 22g of protein.\"), \n(\"Mint Chocolate Protein\", 31.99, 50, \"A refreshing mint chocolate flavor that adds a twist to your shakes. Each serving contains 24g of protein.\"), \n(\"Tropical Fruit Protein\", 29.99, 60, \"A vibrant blend of tropical fruit flavors that energizes your shakes. Each serving provides 22g of protein.\"), \n(\"Chocolate Hazelnut Protein\", 28.99, 75, \"A delicious combination of chocolate and hazelnut flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Cinnamon Roll Protein\", 25.99, 80, \"Indulge in the flavors of cinnamon rolls while fueling your body. Each serving provides 20g of protein.\"), \n(\"Peanut Butter Cup Protein\", 31.99, 50, \"Rich peanut butter cup flavor that satisfies your cravings. Each serving offers 24g of protein.\"), \n(\"Vanilla Almond Protein\", 28.99, 75, \"A delightful blend of vanilla and almond flavors that enhances your shakes. Each serving contains 23g of protein.\"), \n(\"Chocolate Chip Cookie Protein\", 29.99, 60, \"Enjoy the taste of chocolate chip cookies in your shakes. Each serving provides 22g of protein.\"), \n(\"Cinnamon Spice Protein\", 27.99, 70, \"A warm cinnamon spice flavor that adds a cozy touch to your protein shakes. Each serving contains 20g of protein.\"), \n(\"Raspberry Lemonade Protein\", 31.99, 50, \"A refreshing raspberry lemonade flavor that adds zest to your shakes. Each serving offers 24g of protein.\"), \n(\"Mint Chocolate Chip Protein\", 28.99, 75, \"A delicious mint chocolate chip flavor that makes your shakes enjoyable. Each serving contains 23g of protein.\"), \n(\"Tropical Berry Protein\", 29.99, 60, \"A blend of tropical and berry flavors that enhances your shakes. Each serving provides 22g of protein.\"), \n(\"Chocolate Coconut Almond Protein\", 25.99, 80, \"Rich chocolate, coconut, and almond flavors combine for a delicious shake. Each serving contains 20g of protein.\"), \n(\"Peach Mango Protein\", 24.99, 90, \"A sweet peach mango flavor that brightens your protein shakes. Each serving provides 22g of protein.\"), \n(\"Pineapple Protein Powder\", 31.99, 50, \"A tropical pineapple flavor that adds sweetness to your shakes. Each serving provides 24g of protein.\"), \n(\"Caramel Apple Protein\", 28.99, 75, \"A delicious caramel apple flavor that enhances your protein intake. Each serving offers 23g of protein.\"), \n(\"Chocolate Strawberry Protein\", 27.99, 70, \"A delightful combination of chocolate and strawberry flavors. Each serving contains 20g of protein.\"), \n(\"Minty Vanilla Protein\", 31.99, 50, \"A refreshing minty vanilla flavor that adds a twist to your shakes. Each serving offers 24g of protein.\"), \n(\"Chocolate Banana Protein\", 29.99, 60, \"A delicious blend of chocolate and banana flavors that enhances your shakes. Each serving provides 22g of protein.\"), \n(\"Peanut Butter Banana Protein\", 28.99, 75, \"A delightful mix of peanut butter and banana flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Chocolate Mint Protein\", 25.99, 80, \"A refreshing chocolate mint flavor that adds a twist to your shakes. Each serving provides 20g of protein.\"), \n(\"Vanilla Coconut Protein\", 29.99, 60, \"A creamy blend of vanilla and coconut that enhances your shakes. Each serving offers 22g of protein.\"), \n(\"Chocolate Almond Protein\", 31.99, 50, \"Indulge in the rich flavors of chocolate and almond. Each serving contains 24g of protein.\"), \n(\"Honey Cinnamon Protein\", 28.99, 75, \"A sweet honey and cinnamon flavor that enhances your shakes. Each serving provides 23g of protein.\"), \n(\"Tropical Mango Protein\", 29.99, 60, \"A sweet and tropical mango flavor that brightens your shakes. Each serving provides 22g of protein.\"), \n(\"Chocolate Cherry Almond Protein\", 25.99, 80, \"A delightful blend of chocolate, cherry, and almond flavors. Each serving contains 20g of protein.\"), \n(\"Coconut Lime Protein\", 29.99, 60, \"A refreshing coconut and lime flavor that adds a tropical touch. Each serving offers 22g of protein.\"), \n(\"Peanut Butter Cookie Protein\", 31.99, 50, \"Rich peanut butter cookie flavor that satisfies your cravings. Each serving offers 24g of protein.\"), \n(\"Chocolate Mint Protein\", 31.99, 50, \"A refreshing chocolate mint flavor that adds a twist to your shakes. Each serving contains 24g of protein.\"), \n(\"Vanilla Chai Protein\", 28.99, 75, \"A comforting blend of vanilla and chai spices that enhances your shakes. Each serving contains 23g of protein.\"), \n(\"Strawberry Lemon Protein\", 27.99, 70, \"A refreshing strawberry lemon flavor that brightens your shakes. Each serving provides 20g of protein.\"), \n(\"Chocolate Peanut Butter Banana Protein\", 29.99, 60, \"A delicious blend of chocolate, peanut butter, and banana flavors. Each serving offers 22g of protein.\"), \n(\"Vanilla Berry Protein\", 28.99, 75, \"A delightful mix of vanilla and berry flavors for your shakes. Each serving contains 23g of protein.\"), \n(\"Caramel Vanilla Protein\", 25.99, 80, \"A sweet caramel and vanilla flavor that enhances your shakes. Each serving provides 20g of protein.\"), \n(\"Chocolate Coconut Protein\", 29.99, 60, \"Rich chocolate and coconut flavor that makes your shakes delicious. Each serving offers 22g of protein.\")]"