"[(\"Sewing Machine\", 299.99, 30, \"A versatile sewing machine with multiple stitch patterns and automatic needle threading. Perfect for both beginners and experienced sewers looking to create beautiful garments.\"), \n(\"Serger\", 399.99, 15, \"This serger provides professional-quality finishing for all your sewing projects. With its easy-to-use features, you can achieve a clean, polished look in no time.\"), \n(\"Embroidery Machine\", 499.99, 10, \"An advanced embroidery machine that allows you to create intricate designs with ease. It includes a variety of built-in patterns and customizable options.\"), \n(\"Sewing Kit\", 19.99, 100, \"A complete sewing kit with essential tools such as needles, threads, and scissors. Great for quick repairs or starting your sewing journey.\"), \n(\"Fabric Scissors\", 24.99, 75, \"High-quality fabric scissors designed for precision cutting. The ergonomic handles provide comfort during extended use.\"), \n(\"Measuring Tape\", 5.99, 200, \"A flexible measuring tape that is essential for any sewing project. It features both metric and imperial measurements for versatility.\"), \n(\"Pin Cushion\", 7.99, 150, \"A handy pin cushion to keep your sewing pins organized and accessible. Its compact design makes it easy to store and carry.\"), \n(\"Seam Ripper\", 2.99, 180, \"A must-have tool for every sewer, this seam ripper allows for easy removal of stitches. Its sharp blade ensures precise cuts without damaging fabric.\"), \n(\"Sewing Machine Needles\", 9.99, 120, \"A pack of assorted sewing machine needles for different fabric types. Each needle is designed for optimal performance and durability.\"), \n(\"Thread Spools\", 14.99, 200, \"A set of colorful thread spools to match any project. These high-quality threads are designed to withstand wear and tear.\"), \n(\"Quilting Ruler\", 29.99, 40, \"A clear quilting ruler for precise measurements and cutting. Its non-slip surface ensures stability while working on your projects.\"), \n(\"Rotary Cutter\", 19.99, 50, \"This rotary cutter is perfect for cutting multiple layers of fabric with ease. Its ergonomic handle provides comfort and control.\"), \n(\"Sewing Machine Cover\", 29.99, 25, \"A protective cover for your sewing machine to keep it dust-free. Made from durable fabric, it adds a touch of style to your workspace.\"), \n(\"Fabric Marking Pens\", 12.99, 90, \"These fabric marking pens are perfect for transferring patterns onto fabric. They are easy to remove and come in various colors.\"), \n(\"Bias Tape Maker\", 15.99, 35, \"Create your own bias tape with this handy tool. It allows you to make custom bias tape in various widths for your sewing projects.\"), \n(\"Sewing Patterns\", 8.99, 150, \"A collection of sewing patterns for various garments and accessories. Ideal for both beginners and advanced sewists.\"), \n(\"Thimble\", 3.99, 100, \"A protective thimble to prevent finger pricks while hand sewing. Its comfortable fit makes it a favorite among sewing enthusiasts.\"), \n(\"Sewing Machine Oil\", 6.99, 80, \"Specially formulated oil to keep your sewing machine running smoothly. Regular maintenance extends the life of your machine.\"), \n(\"Ironing Board\", 49.99, 20, \"A sturdy ironing board that provides a stable surface for pressing fabric. Its adjustable height makes it suitable for users of all sizes.\"), \n(\"Steam Iron\", 39.99, 25, \"This steam iron features a powerful steam burst for removing wrinkles quickly. Its non-stick soleplate glides effortlessly over fabric.\"), \n(\"Sewing Chair\", 89.99, 15, \"An ergonomic sewing chair designed for comfort during long sewing sessions. Its adjustable height and lumbar support promote good posture.\"), \n(\"Fabric Storage Box\", 24.99, 40, \"A stylish fabric storage box to keep your sewing supplies organized. Its collapsible design makes it easy to store when not in use.\"), \n(\"Crafting Mat\", 19.99, 60, \"A self-healing crafting mat that protects your work surface while cutting. The printed grid helps with accurate measurements.\"), \n(\"Sewing Machine Foot Pedal\", 34.99, 30, \"A replacement foot pedal for various sewing machine models. It provides smooth control and responsiveness while sewing.\"), \n(\"Sewing Thread Organizer\", 14.99, 50, \"Keep your threads neatly organized and tangle-free with this thread organizer. Its compact design is perfect for travel.\"), \n(\"Fusible Interfacing\", 9.99, 70, \"This fusible interfacing adds structure and support to your sewing projects. It easily adheres to fabric with a simple press of an iron.\"), \n(\"Sewing Gauge\", 5.99, 150, \"A handy sewing gauge for measuring hems and seam allowances. Its sliding marker makes it easy to use and accurate.\"), \n(\"Fabric Glue\", 8.99, 80, \"A quick-drying fabric glue that is perfect for temporary or permanent bonding. Ideal for crafting and sewing projects.\"), \n(\"Sewing Book\", 19.99, 25, \"An informative sewing book filled with tips, techniques, and patterns. Perfect for beginners looking to expand their skills.\"), \n(\"Tapestry Needle Set\", 7.99, 60, \"A set of tapestry needles designed for easy threading of thick yarns. Perfect for embroidery and cross-stitch projects.\"), \n(\"Pinking Shears\", 29.99, 40, \"These pinking shears create a zigzag edge to prevent fabric fraying. Ideal for finishing edges and adding a decorative touch.\"), \n(\"Sewing Machine Carrying Case\", 49.99, 20, \"A padded carrying case that protects your sewing machine during transport. It features multiple pockets for accessories.\"), \n(\"Patchwork Ruler\", 24.99, 30, \"This patchwork ruler is perfect for cutting precise quilt pieces. Its clear markings make it easy to read and use.\"), \n(\"Chalk Fabric Markers\", 10.99, 75, \"These chalk fabric markers are ideal for marking fabric without leaving permanent stains. They easily wash away with water.\"), \n(\"Knitting Needles\", 14.99, 100, \"A set of high-quality knitting needles for your next project. Their smooth finish ensures easy stitching and reduced friction.\"), \n(\"Sewing Machine Dust Cover\", 19.99, 50, \"A stylish dust cover to protect your sewing machine from dust and dirt. It adds a decorative touch to your sewing area.\"), \n(\"Quilting Clips\", 12.99, 80, \"These quilting clips hold layers of fabric together without damaging them. A great alternative to pins for bulky projects.\"), \n(\"Sewing Machine Light\", 15.99, 30, \"An LED sewing machine light that brightens your workspace. It improves visibility for detailed sewing tasks.\"), \n(\"Sewing Needle Threader\", 4.99, 150, \"A handy tool that makes threading needles quick and easy. Perfect for those with limited dexterity.\"), \n(\"Fabric Swatch Book\", 19.99, 25, \"A fabric swatch book filled with various fabric samples. Great for selecting materials for your next sewing project.\"), \n(\"Sewing Box\", 29.99, 40, \"A stylish sewing box to store all your supplies in one place. Its compartments help keep everything organized.\"), \n(\"Appliqué Scissors\", 24.99, 35, \"Specialized scissors designed for intricate appliqué work. Their sharp blades allow for precise cuts around delicate shapes.\"), \n(\"Sewing Machine Extension Table\", 39.99, 15, \"An extension table that provides extra workspace for larger projects. It easily attaches to most sewing machines.\"), \n(\"Fabric Sample Kit\", 14.99, 60, \"A kit containing various fabric samples for testing and inspiration. Perfect for selecting the right material for your project.\"), \n(\"Basting Spray\", 9.99, 50, \"A temporary basting spray that holds fabric layers together. Ideal for quilting and sewing projects that require precision.\"), \n(\"Sewing Machine Foot Set\", 29.99, 30, \"A versatile foot set for different sewing techniques. Includes walking foot, zipper foot, and more for enhanced creativity.\"), \n(\"Knitting Bag\", 19.99, 40, \"A spacious knitting bag to store your yarn and tools. Its stylish design makes it a favorite among knitters.\"), \n(\"Fabric Weights\", 12.99, 70, \"These fabric weights hold fabric in place while cutting or sewing. They eliminate the need for pins, making the process faster.\"), \n(\"Sewing Pattern Weights\", 15.99, 50, \"A set of pattern weights to keep your patterns in place while cutting. Their heavy design ensures stability on fabric.\"), \n(\"Sewing Machine Manual\", 9.99, 100, \"An essential manual for understanding your sewing machine's features and functions. Great for troubleshooting and maintenance.\"), \n(\"Embroidery Thread Set\", 19.99, 60, \"A vibrant set of embroidery threads in various colors. Perfect for adding decorative touches to your sewing projects.\"), \n(\"Stitch Guide\", 7.99, 80, \"A handy stitch guide that provides information on various sewing techniques. Ideal for beginners looking to learn new skills.\"), \n(\"Quilting Foot\", 24.99, 30, \"A specialized foot designed for quilting projects. It helps create evenly spaced stitches for a professional finish.\"), \n(\"Sewing Machine Tension Gauge\", 15.99, 40, \"A tension gauge that helps you achieve the perfect stitch tension. Essential for consistent results in sewing.\"), \n(\"Fabric Cutting Mat\", 29.99, 25, \"A durable cutting mat designed for fabric cutting. Its self-healing surface protects your blades and work surface.\"), \n(\"Sewing Machine Cleaning Kit\", 12.99, 50, \"A cleaning kit designed to keep your sewing machine in top condition. It includes brushes and oils for maintenance.\"), \n(\"Sewing Machine Feet Set\", 39.99, 20, \"A complete set of sewing machine feet for various techniques. Perfect for expanding your sewing capabilities.\"), \n(\"Quilt Ruler\", 24.99, 30, \"A quilt ruler with clear markings for accurate cutting. Ideal for quilters looking for precision in their projects.\"), \n(\"Sewing Machine Carry Bag\", 34.99, 15, \"A sturdy carrying bag for your sewing machine. It features padded protection and ample storage for accessories.\"), \n(\"Fabric Remnants\", 9.99, 100, \"A collection of fabric remnants perfect for small projects. Each pack contains a variety of colors and patterns.\"), \n(\"Sewing Machine Feet Guide\", 5.99, 150, \"A guide that explains the different sewing machine feet and their uses. Great for beginners wanting to learn more.\"), \n(\"Sewing Project Planner\", 14.99, 40, \"A planner designed to help you organize your sewing projects. It includes space for notes, materials, and timelines.\"), \n(\"Sewing Machine Foot Pedal Extension\", 19.99, 30, \"An extension for your sewing machine foot pedal for added comfort. It allows for better positioning while sewing.\"), \n(\"Sewing Machine Cover Pattern\", 9.99, 60, \"A pattern for creating a custom cover for your sewing machine. Personalize your workspace with unique designs.\"), \n(\"Patchwork Fabric Bundle\", 29.99, 20, \"A bundle of assorted patchwork fabrics ideal for quilting. Each piece is carefully selected for quality and color.\"), \n(\"Sewing Machine Bobbin Case\", 14.99, 50, \"A replacement bobbin case for your sewing machine. Ensures smooth operation and consistent stitching.\"), \n(\"Sewing Machine Attachment Set\", 39.99, 15, \"An attachment set that expands your sewing machine's capabilities. Includes various feet for different sewing techniques.\"), \n(\"Fleece Fabric\", 11.99, 100, \"Soft fleece fabric perfect for making cozy blankets and garments. Available in a variety of colors and patterns.\"), \n(\"Sewing Machine Repair Kit\", 19.99, 25, \"A repair kit designed to help you fix common sewing machine issues. Includes tools and instructions for DIY repairs.\"), \n(\"Sewing Machine Instructional DVD\", 9.99, 80, \"An instructional DVD that covers the basics of using your sewing machine. Great for beginners looking for visual guidance.\"), \n(\"Fabric Dye Kit\", 24.99, 40, \"A complete fabric dye kit for creating custom colors. Perfect for personalizing your fabric projects.\"), \n(\"Sewing Machine Extension Arm\", 29.99, 30, \"An extension arm that provides extra support for larger projects. It helps keep fabric aligned while sewing.\"), \n(\"Sewing Pattern Magazine\", 8.99, 100, \"A magazine filled with the latest sewing patterns and trends. Great for inspiration and discovering new techniques.\"), \n(\"Sewing Needle Storage Case\", 12.99, 50, \"A compact storage case for organizing your sewing needles. Its clear design allows for easy identification.\"), \n(\"Sewing Project Bag\", 19.99, 40, \"A spacious project bag to keep all your sewing materials in one place. Perfect for taking your projects on the go.\"), \n(\"Sewing Machine Parts Catalog\", 9.99, 60, \"A catalog that lists all the parts for various sewing machines. Useful for finding replacements and upgrades.\"), \n(\"Fabric Cutting Scissors\", 24.99, 30, \"High-quality scissors specifically designed for cutting fabric. Their sharp blades ensure clean cuts every time.\"), \n(\"Sewing Machine Repair Manual\", 14.99, 25, \"A manual that provides troubleshooting tips and repair instructions for sewing machines. Ideal for DIY enthusiasts.\"), \n(\"Sewing Machine Warranty Registration\", 0.00, 100, \"A registration form for your sewing machine warranty. Ensure your investment is protected for years to come.\")]"