"products = [\n    (\"Galaxy S21\", 799.99, 30, \"The Galaxy S21 features a stunning 6.2-inch display and a powerful processor. Capture every moment with its advanced triple-camera system.\"),\n    (\"iPhone 13\", 999.99, 25, \"The iPhone 13 offers exceptional performance with its A15 Bionic chip. Enjoy a vibrant Super Retina XDR display and impressive battery life.\"),\n    (\"OnePlus 9\", 729.99, 40, \"Experience flagship performance with the OnePlus 9, featuring a 120Hz Fluid AMOLED display. Its Hasselblad partnership ensures stunning photography.\"),\n    (\"Google Pixel 6\", 599.99, 35, \"The Pixel 6 is designed for photography enthusiasts with its incredible camera features. Enjoy the purest Android experience with regular updates.\"),\n    (\"Xiaomi Mi 11\", 749.99, 20, \"The Xiaomi Mi 11 boasts a gorgeous AMOLED display and a powerful Snapdragon 888 processor. It’s perfect for gaming and multimedia consumption.\"),\n    (\"Sony Xperia 1 III\", 1299.99, 15, \"The Xperia 1 III offers a 4K HDR OLED display and professional-grade camera features. Ideal for content creators and multimedia lovers.\"),\n    (\"Oppo Find X3 Pro\", 1149.99, 10, \"With its unique design and powerful specs, the Oppo Find X3 Pro is a standout smartphone. Enjoy stunning visuals and fast charging capabilities.\"),\n    (\"Nokia G50\", 299.99, 50, \"The Nokia G50 is a budget-friendly smartphone with 5G capability. It features a large display and a durable design for everyday use.\"),\n    (\"Motorola Edge 20\", 499.99, 45, \"The Motorola Edge 20 offers a high refresh rate display and versatile camera system. It’s perfect for both entertainment and productivity.\"),\n    (\"Asus ROG Phone 5\", 999.99, 20, \"The ROG Phone 5 is designed for gamers, featuring a high refresh rate and customizable gaming controls. Enjoy immersive gameplay with top-notch performance.\"),\n    (\"Huawei P40 Pro\", 899.99, 15, \"The P40 Pro combines sleek design with advanced camera technology. Capture stunning photos even in low light with its exceptional lens system.\"),\n    (\"Realme GT\", 499.99, 30, \"The Realme GT delivers flagship performance at an affordable price. Enjoy a fast and smooth experience with its Snapdragon 888 processor.\"),\n    (\"Vivo X60 Pro\", 699.99, 25, \"The Vivo X60 Pro features advanced stabilization technology for stunning photography. Its sleek design and vibrant display make it a joy to use.\"),\n    (\"LG Velvet\", 599.99, 40, \"The LG Velvet is known for its unique design and versatile camera system. Enjoy a large OLED display for an immersive viewing experience.\"),\n    (\"ZTE Axon 20\", 399.99, 30, \"The ZTE Axon 20 is recognized as the first smartphone with an under-display camera. It offers a unique design and solid performance.\"),\n    (\"Samsung Galaxy A52\", 349.99, 50, \"The Galaxy A52 combines great performance with an impressive camera system. Enjoy a smooth display and long-lasting battery life.\"),\n    (\"iPhone SE (2020)\", 399.99, 45, \"The iPhone SE offers powerful performance in a compact design. It features the same chip as the iPhone 11 for exceptional speed.\"),\n    (\"Honor 50\", 499.99, 35, \"The Honor 50 features a stylish design and a versatile camera setup. Enjoy a smooth user experience with its fast performance.\"),\n    (\"TCL 20 Pro 5G\", 499.99, 25, \"The TCL 20 Pro 5G offers a stunning display and impressive camera capabilities. Its sleek design makes it a great choice for media consumption.\"),\n    (\"Poco F3\", 349.99, 40, \"The Poco F3 delivers flagship performance at a mid-range price. Enjoy a powerful Snapdragon processor and a vibrant AMOLED display.\"),\n    (\"BlackBerry Key2\", 649.99, 15, \"The BlackBerry Key2 combines a classic keyboard with modern smartphone features. It's perfect for productivity-focused users.\"),\n    (\"Samsung Galaxy Z Flip 3\", 999.99, 10, \"The Galaxy Z Flip 3 offers a unique foldable design with top-tier performance. Enjoy a compact device that expands into a full-sized smartphone.\"),\n    (\"iPhone 12 Mini\", 699.99, 20, \"The iPhone 12 Mini packs powerful features into a compact size. Enjoy the same performance as the iPhone 12 with a smaller form factor.\"),\n    (\"Google Pixel 5a\", 449.99, 30, \"The Pixel 5a offers excellent camera performance and a clean Android experience. It's perfect for those who want simplicity and quality.\"),\n    (\"Xiaomi Redmi Note 10\", 199.99, 50, \"The Redmi Note 10 is an affordable smartphone with a vibrant display. It offers great value with its solid performance and camera capabilities.\"),\n    (\"Nokia 8.3 5G\", 699.99, 15, \"The Nokia 8.3 5G features a versatile camera system and 5G capabilities. Enjoy a premium feel with its durable design.\"),\n    (\"Sony Xperia 5 III\", 999.99, 10, \"The Xperia 5 III combines a compact design with powerful features. It’s ideal for photography enthusiasts with its advanced camera technology.\"),\n    (\"Oppo Reno 6 Pro\", 799.99, 20, \"The Oppo Reno 6 Pro offers stylish design and exceptional camera performance. Enjoy a smooth user experience with its fast processor.\"),\n    (\"Huawei Mate 40 Pro\", 1099.99, 10, \"The Mate 40 Pro features cutting-edge technology and an impressive camera system. It’s perfect for those who demand the best in performance.\"),\n    (\"Realme 8 Pro\", 299.99, 40, \"The Realme 8 Pro offers a powerful camera and a sleek design. Enjoy fast charging and a vibrant display for an enhanced experience.\"),\n    (\"Vivo V21\", 399.99, 30, \"The Vivo V21 is known for its exceptional selfie camera and stylish design. It’s perfect for social media enthusiasts.\"),\n    (\"Samsung Galaxy A32\", 279.99, 50, \"The Galaxy A32 offers a great balance of features and affordability. Enjoy a vibrant display and a solid camera system.\"),\n    (\"iPhone 11\", 599.99, 25, \"The iPhone 11 combines powerful performance with a dual-camera system. Enjoy a user-friendly experience with iOS and regular updates.\"),\n    (\"TCL 10 Pro\", 449.99, 35, \"The TCL 10 Pro features a stunning AMOLED display and a versatile camera setup. It's perfect for media consumption and photography.\"),\n    (\"LG Stylo 6\", 249.99, 40, \"The LG Stylo 6 offers a large display and a built-in stylus for productivity. Enjoy a budget-friendly option with decent performance.\"),\n    (\"Motorola Moto G Power\", 249.99, 50, \"The Moto G Power is known for its impressive battery life. It offers solid performance and a large display at an affordable price.\"),\n    (\"Asus Zenfone 8\", 599.99, 20, \"The Zenfone 8 combines compact design with flagship performance. Enjoy a high-quality camera and a smooth user experience.\"),\n    (\"Nokia 5.4\", 249.99, 45, \"The Nokia 5.4 offers a clean Android experience and solid performance. It's a budget-friendly option with a decent camera.\"),\n    (\"Xiaomi Poco X3 Pro\", 299.99, 30, \"The Poco X3 Pro delivers powerful performance for gaming and multitasking. Enjoy a high refresh rate display at an affordable price.\"),\n    (\"Samsung Galaxy A12\", 179.99, 50, \"The Galaxy A12 is an entry-level smartphone with a large display and decent camera. It's perfect for everyday tasks and social media.\"),\n    (\"iPhone XR\", 499.99, 25, \"The iPhone XR combines a large display with powerful performance. Enjoy a range of colors and a great camera experience.\"),\n    (\"Google Pixel 4a\", 349.99, 30, \"The Pixel 4a offers a fantastic camera in a compact design. Enjoy a clean Android experience with regular updates.\"),\n    (\"Honor 30\", 499.99, 20, \"The Honor 30 features a stylish design and a versatile camera system. Enjoy a smooth user experience with its fast performance.\"),\n    (\"Vivo Y20\", 199.99, 50, \"The Vivo Y20 offers great value with its large display and decent performance. It's perfect for budget-conscious users.\"),\n    (\"Oppo A54\", 249.99, 40, \"The Oppo A54 combines a stylish design with essential features. Enjoy a vibrant display and solid battery life.\"),\n    (\"Xiaomi Mi 10 Lite\", 349.99, 30, \"The Mi 10 Lite offers 5G connectivity and a sleek design. It's perfect for those who want modern features at an affordable price.\"),\n    (\"BlackBerry Motion\", 449.99, 15, \"The BlackBerry Motion combines a classic design with modern features. It's ideal for productivity-focused users with its secure software.\"),\n    (\"Samsung Galaxy Z Fold 3\", 1799.99, 5, \"The Galaxy Z Fold 3 offers a revolutionary foldable design with top-tier performance. Enjoy multitasking and a large display experience.\"),\n    (\"iPhone 8\", 399.99, 20, \"The iPhone 8 features a classic design with modern performance. Enjoy a solid camera and a user-friendly iOS experience.\"),\n    (\"Google Pixel 6 Pro\", 899.99, 15, \"The Pixel 6 Pro offers a stunning display and advanced camera features. It's perfect for photography enthusiasts and Android purists.\"),\n    (\"Xiaomi Black Shark 4\", 499.99, 25, \"The Black Shark 4 is designed for gamers, featuring a high refresh rate and customizable controls. Enjoy immersive gameplay and fast charging.\"),\n    (\"Sony Xperia 10 III\", 399.99, 30, \"The Xperia 10 III features a sleek design and versatile camera system. Enjoy a smooth user experience with its vibrant display.\"),\n    (\"Motorola Edge 20 Lite\", 399.99, 35, \"The Edge 20 Lite offers solid performance and a high refresh rate display. It's perfect for media consumption and everyday tasks.\"),\n    (\"Oppo Reno 5\", 499.99, 20, \"The Reno 5 combines a stylish design with great camera capabilities. Enjoy a smooth user experience with its fast processor.\"),\n    (\"Nokia G10\", 199.99, 50, \"The Nokia G10 is an affordable smartphone with a large display. It offers solid performance for everyday tasks.\"),\n    (\"Huawei P30 Lite\", 299.99, 30, \"The P30 Lite features a stylish design and a versatile camera system. It's perfect for social media enthusiasts.\"),\n    (\"Realme Narzo 30\", 199.99, 40, \"The Narzo 30 offers great value with its large display and decent performance. It's perfect for budget-conscious users.\"),\n    (\"Vivo V21e\", 299.99, 35, \"The Vivo V21e features a stylish design and a great camera for selfies. Enjoy a smooth user experience with its fast performance.\"),\n    (\"Samsung Galaxy M32\", 279.99, 50, \"The Galaxy M32 combines a large display with solid performance. It's perfect for media consumption and everyday tasks.\"),\n    (\"iPhone 12 Pro\", 999.99, 15, \"The iPhone 12 Pro features a premium design and advanced camera system. Enjoy top-tier performance with the A14 Bionic chip.\"),\n    (\"Google Pixel 5\", 699.99, 20, \"The Pixel 5 offers a fantastic camera and a clean Android experience. It's perfect for those who want simplicity and quality.\"),\n    (\"Xiaomi Mi 11 Lite\", 349.99, 30, \"The Mi 11 Lite combines a sleek design with solid performance. Enjoy a vibrant display and great camera capabilities.\"),\n    (\"Honor 10X Lite\", 249.99, 40, \"The Honor 10X Lite offers great value with its large display and decent performance. It's perfect for everyday tasks.\"),\n    (\"TCL 20 SE\", 249.99, 50, \"The TCL 20 SE features a large display and solid performance. It's a budget-friendly option for media consumption.\"),\n    (\"Nokia 3.4\", 199.99, 45, \"The Nokia 3.4 offers a clean Android experience and solid performance. It's a great choice for budget-conscious users.\"),\n    (\"Motorola Moto E\", 149.99, 50, \"The Moto E is an entry-level smartphone with essential features. Enjoy a large display and decent battery life.\"),\n    (\"Asus ROG Phone 3\", 999.99, 15, \"The ROG Phone 3 is designed for gamers, featuring a high refresh rate and customizable controls. Enjoy immersive gameplay with top-notch performance.\"),\n    (\"Samsung Galaxy A02s\", 159.99, 50, \"The Galaxy A02s is an affordable smartphone with a large display. It's perfect for everyday tasks and social media.\"),\n    (\"iPhone 11 Pro Max\", 1099.99, 10, \"The iPhone 11 Pro Max features a stunning display and advanced camera capabilities. Enjoy top-tier performance with a premium design.\"),\n    (\"Google Pixel 4\", 499.99, 20, \"The Pixel 4 offers a fantastic camera and a clean Android experience. It's perfect for photography enthusiasts.\"),\n    (\"Xiaomi Mi Mix 4\", 999.99, 10, \"The Mi Mix 4 features a unique design with an under-display camera. Enjoy flagship performance and cutting-edge technology.\"),\n    (\"Vivo X50 Pro\", 599.99, 15, \"The X50 Pro offers advanced camera technology and a stylish design. It's perfect for photography enthusiasts and media consumption.\"),\n    (\"Oppo A74\", 299.99, 35, \"The Oppo A74 combines a stylish design with essential features. Enjoy a vibrant display and solid battery life.\"),\n    (\"Huawei Nova 8\", 499.99, 20, \"The Nova 8 features a sleek design and impressive camera capabilities. It's perfect for social media enthusiasts.\"),\n    (\"Realme 7 Pro\", 299.99, 30, \"The Realme 7 Pro offers a powerful camera and fast charging. Enjoy a smooth user experience with its vibrant display.\"),\n    (\"Samsung Galaxy M51\", 349.99, 25, \"The Galaxy M51 features a massive battery and solid performance. It's perfect for media consumption and everyday tasks.\"),\n    (\"Nokia 1.4\", 139.99, 50, \"The Nokia 1.4 is an entry-level smartphone with essential features. Enjoy a large display and decent performance.\"),\n    (\"Motorola Moto G Stylus\", 299.99, 30, \"The Moto G Stylus features a built-in stylus for productivity. Enjoy a large display and solid performance at an affordable price.\"),\n    (\"Asus Zenfone 7\", 699.99, 15, \"The Zenfone 7 offers a unique flip camera design for versatile photography. Enjoy flagship performance and a smooth user experience.\"),\n    (\"Sony Xperia 1 II\", 1199.99, 10, \"The Xperia 1 II combines a stunning display with advanced camera features. It's perfect for photography enthusiasts and media consumption.\"),\n    (\"Samsung Galaxy A72\", 449.99, 20, \"The Galaxy A72 features a large display and versatile camera system. Enjoy solid performance for everyday tasks and media consumption.\"),\n    (\"iPhone 12 Pro Max\", 1099.99, 10, \"The iPhone 12 Pro Max offers a premium design and advanced camera capabilities. Enjoy top-tier performance with the A14 Bionic chip.\"),\n    (\"Google Pixel 6a\", 499.99, 20, \"The Pixel 6a provides excellent camera performance and a clean Android experience. It's perfect for those who want simplicity and quality.\"),\n]"