"[\n    (\"Aviator Classic\", 129.99, 30, \"These timeless aviator sunglasses feature a sleek metal frame and polarized lenses. Perfect for both men and women, they offer style and protection from harmful UV rays.\"),\n    (\"Wayfarer Retro\", 89.99, 50, \"Embrace a vintage vibe with these classic Wayfarer sunglasses. Their sturdy design and dark lenses make them a must-have accessory for any outfit.\"),\n    (\"Sporty Wraparound\", 69.99, 40, \"Designed for active individuals, these wraparound sunglasses provide maximum coverage and stability. Ideal for outdoor sports, they stay securely in place during any activity.\"),\n    (\"Cat Eye Glam\", 99.99, 25, \"Add a touch of glamour to your look with these chic cat-eye sunglasses. Their stylish shape and tinted lenses are perfect for a day at the beach or a night out.\"),\n    (\"Round Vintage\", 79.99, 35, \"These round sunglasses bring a retro flair to any ensemble. Lightweight and comfortable, they are perfect for those who want to make a fashion statement.\"),\n    (\"Mirrored Shield\", 119.99, 20, \"Stand out with these bold mirrored shield sunglasses. Offering a modern design and excellent UV protection, they are perfect for festivals and sunny days.\"),\n    (\"Bamboo Frame\", 89.99, 15, \"Sustainably crafted from bamboo, these eco-friendly sunglasses are both stylish and unique. Their lightweight design makes them comfortable for all-day wear.\"),\n    (\"Polarized Fishing\", 109.99, 45, \"Ideal for fishing enthusiasts, these polarized sunglasses reduce glare on the water. With a durable frame, they are built to withstand outdoor adventures.\"),\n    (\"Kids' Cartoon\", 29.99, 60, \"Make sun protection fun for kids with these colorful cartoon sunglasses. Featuring playful designs, they are lightweight and comfortable for little ones.\"),\n    (\"Gradient Lens\", 79.99, 50, \"These sunglasses feature a trendy gradient lens that transitions from dark to light. Perfect for adding a fashionable touch to any summer outfit.\"),\n    (\"Oversized Chic\", 99.99, 30, \"Make a bold statement with these oversized sunglasses. Their large lenses provide excellent coverage and a stylish look for any occasion.\"),\n    (\"Metallic Finish\", 89.99, 20, \"With a striking metallic finish, these sunglasses are perfect for those who love to stand out. They combine fashion with functionality for everyday wear.\"),\n    (\"Classic Black\", 49.99, 70, \"A staple in any wardrobe, these classic black sunglasses are versatile and timeless. Their simple design makes them suitable for any outfit.\"),\n    (\"Colorful Floral\", 59.99, 40, \"Brighten up your look with these colorful floral sunglasses. Their unique design adds a playful touch to any summer outfit, making them a must-have accessory.\"),\n    (\"Retro Oval\", 74.99, 35, \"These retro oval sunglasses offer a unique twist on classic styles. Perfect for vintage lovers, they provide both style and UV protection.\"),\n    (\"Travel Companion\", 99.99, 50, \"Designed for travelers, these foldable sunglasses are easy to pack and carry. Their durable construction ensures they can withstand any adventure.\"),\n    (\"Luxury Designer\", 299.99, 10, \"These luxury designer sunglasses are the epitome of sophistication. With high-quality materials and a timeless design, they are perfect for special occasions.\"),\n    (\"Adventure Ready\", 89.99, 30, \"Built for the outdoors, these adventure-ready sunglasses are both durable and stylish. They offer excellent UV protection and are perfect for hiking and exploring.\"),\n    (\"Sleek Sports\", 79.99, 45, \"These sleek sports sunglasses are designed for athletes and outdoor enthusiasts. With a lightweight frame and secure fit, they are perfect for any sport.\"),\n    (\"Vintage Browline\", 69.99, 25, \"These vintage browline sunglasses combine classic style with modern flair. Their unique design makes them a standout accessory for any outfit.\"),\n    (\"Funky Geometric\", 59.99, 30, \"Make a statement with these funky geometric sunglasses. Their bold shapes and colors are perfect for fashion-forward individuals looking to express their style.\"),\n    (\"Clear Frame\", 89.99, 40, \"These trendy clear frame sunglasses are perfect for a modern look. Their versatile design makes them suitable for both casual and formal occasions.\"),\n    (\"Sustainable Shades\", 79.99, 20, \"Crafted from recycled materials, these sustainable shades are both stylish and eco-friendly. They provide excellent UV protection while reducing environmental impact.\"),\n    (\"Chic Butterfly\", 99.99, 15, \"These chic butterfly sunglasses are perfect for making a fashion statement. Their oversized design and unique shape add a touch of elegance to any outfit.\"),\n    (\"Classic Tortoise\", 69.99, 50, \"These classic tortoise sunglasses are a timeless choice for any wardrobe. Their stylish pattern and shape make them versatile for any occasion.\"),\n    (\"Neon Flash\", 49.99, 60, \"Add a pop of color to your look with these neon flash sunglasses. Perfect for festivals and summer events, they are sure to turn heads.\"),\n    (\"Beach Ready\", 59.99, 40, \"Get ready for fun in the sun with these beach-ready sunglasses. Their durable design and UV protection make them perfect for a day by the water.\"),\n    (\"Futuristic Wrap\", 109.99, 20, \"These futuristic wrap sunglasses are designed for trendsetters. With a bold look and excellent UV protection, they are perfect for any adventure.\"),\n    (\"Reflective Lens\", 89.99, 30, \"Featuring reflective lenses, these sunglasses are both stylish and functional. They provide excellent glare reduction for outdoor activities.\"),\n    (\"Fashion Cat Eye\", 79.99, 35, \"These fashion cat-eye sunglasses are a must-have for any trendsetter. Their unique shape and stylish design make them perfect for any occasion.\"),\n    (\"Classic Aviator\", 99.99, 25, \"These classic aviator sunglasses are a staple in any collection. With a timeless design and comfortable fit, they are perfect for everyday wear.\"),\n    (\"Retro Square\", 69.99, 45, \"These retro square sunglasses offer a vintage vibe with a modern twist. Their bold design makes them a standout accessory for any outfit.\"),\n    (\"Kids' Sports\", 39.99, 50, \"Keep your kids protected with these sporty sunglasses designed for active play. They are lightweight and come in fun colors for added appeal.\"),\n    (\"Elegant Oversized\", 89.99, 20, \"These elegant oversized sunglasses provide a touch of sophistication to any outfit. Their large lenses offer excellent UV protection and style.\"),\n    (\"Color Block\", 79.99, 30, \"These color block sunglasses feature a fun and vibrant design. Perfect for summer, they add a playful touch to any look.\"),\n    (\"Clear Lens Fashion\", 59.99, 40, \"These clear lens sunglasses are perfect for a fashion-forward look. Their trendy design makes them suitable for any occasion, day or night.\"),\n    (\"Vintage Round\", 74.99, 35, \"These vintage round sunglasses are a classic accessory for any wardrobe. Their unique shape and stylish design make them perfect for any outfit.\"),\n    (\"Sporty Kids\", 29.99, 60, \"Keep your children stylish and protected with these sporty sunglasses. Designed for comfort and durability, they are perfect for outdoor activities.\"),\n    (\"Chic Geometric\", 99.99, 15, \"These chic geometric sunglasses bring a modern twist to your look. Their unique shape and stylish design make them a standout accessory.\"),\n    (\"Metal Frame\", 89.99, 30, \"These metal frame sunglasses combine durability with style. Their sleek design and comfortable fit make them perfect for everyday wear.\"),\n    (\"Fashionable Shield\", 109.99, 20, \"These fashionable shield sunglasses offer a bold and trendy look. Perfect for making a statement, they provide excellent UV protection.\"),\n    (\"Classic Wayfarer\", 49.99, 70, \"A timeless choice, these classic Wayfarer sunglasses are perfect for any occasion. Their versatile design makes them a staple in any wardrobe.\"),\n    (\"Retro Cat Eye\", 79.99, 25, \"These retro cat-eye sunglasses are a stylish option for any fashion lover. Their unique shape and design make them a must-have accessory.\"),\n    (\"Kids' Fashion\", 34.99, 50, \"These trendy kids' sunglasses combine fun designs with UV protection. Perfect for summer days, they keep little ones stylish and safe.\"),\n    (\"Polarized Classic\", 99.99, 40, \"These polarized classic sunglasses reduce glare and offer superior UV protection. Perfect for outdoor activities, they are a smart choice for sunny days.\"),\n    (\"Sporty Design\", 69.99, 35, \"These sporty sunglasses are designed for those who love adventure. With a secure fit and durable construction, they are perfect for any outdoor activity.\"),\n    (\"Fashion Oversized\", 89.99, 30, \"These fashion oversized sunglasses are perfect for making a statement. Their large lenses provide excellent coverage while adding a touch of glamour.\"),\n    (\"Vintage Browline\", 79.99, 20, \"These vintage browline sunglasses combine classic style with modern flair. They are perfect for those who appreciate retro fashion.\"),\n    (\"Eco-Friendly Shades\", 89.99, 15, \"Made from sustainable materials, these eco-friendly shades are stylish and responsible. They provide excellent UV protection while helping the planet.\"),\n    (\"Colorful Kids\", 39.99, 60, \"Brighten up your child's day with these colorful kids' sunglasses. They are lightweight, comfortable, and perfect for outdoor play.\"),\n    (\"Trendy Round\", 69.99, 40, \"These trendy round sunglasses are a fashionable choice for any occasion. Their unique shape adds a stylish touch to your look.\"),\n    (\"Chic Mirrored\", 99.99, 25, \"These chic mirrored sunglasses are perfect for a modern look. Their reflective lenses and stylish design make them a standout accessory.\"),\n    (\"Classic Polarized\", 109.99, 30, \"These classic polarized sunglasses provide superior glare reduction. Perfect for driving or outdoor activities, they combine style and functionality.\"),\n    (\"Stylish Wraparound\", 79.99, 45, \"These stylish wraparound sunglasses offer maximum coverage and a secure fit. Ideal for sports enthusiasts, they are perfect for any outdoor adventure.\"),\n    (\"Retro Oval\", 69.99, 35, \"These retro oval sunglasses are a fashionable choice for any wardrobe. Their unique shape adds a touch of vintage flair.\"),\n    (\"Kids' Fun\", 29.99, 50, \"Keep your kids protected with these fun and colorful sunglasses. They are lightweight and designed for comfort during outdoor play.\"),\n    (\"Sleek Sports\", 89.99, 20, \"These sleek sports sunglasses are designed for athletes who value performance. Their lightweight construction and secure fit make them perfect for any activity.\"),\n    (\"Luxury Cat Eye\", 199.99, 10, \"These luxury cat-eye sunglasses are the epitome of elegance. With high-quality materials and a stunning design, they are perfect for special occasions.\"),\n    (\"Adventure Ready\", 99.99, 30, \"Built for the outdoors, these adventure-ready sunglasses are both durable and stylish. They offer excellent UV protection and are perfect for hiking and exploring.\"),\n    (\"Trendy Shield\", 89.99, 25, \"These trendy shield sunglasses provide a bold look for fashionistas. Their large lenses offer excellent UV protection and style.\"),\n    (\"Classic Tortoise\", 69.99, 50, \"These classic tortoise sunglasses are a timeless choice for any wardrobe. Their stylish pattern and shape make them versatile for any occasion.\"),\n    (\"Sporty Kids\", 39.99, 60, \"Keep your children protected with these sporty sunglasses designed for active play. They are lightweight and come in fun colors for added appeal.\"),\n    (\"Elegant Oversized\", 89.99, 20, \"These elegant oversized sunglasses provide a touch of sophistication to any outfit. Their large lenses offer excellent UV protection and style.\")\n]"