"[(\"Shortboard Surfboard\", 599.99, 20, \"A lightweight shortboard designed for high-performance surfing. Its sleek shape allows for quick turns and agile maneuvers on the waves.\"), \n(\"Longboard Surfboard\", 749.99, 15, \"Perfect for beginners and cruising, this longboard offers stability and ease of paddling. Its classic design ensures a smooth ride on any wave.\"), \n(\"Surfboard Bag\", 89.99, 50, \"Protect your surfboard with this durable padded bag. It features a comfortable shoulder strap and ample padding to keep your board safe during transport.\"), \n(\"Wetsuit\", 199.99, 30, \"Stay warm in cold waters with this high-quality wetsuit. It provides excellent insulation and flexibility, allowing you to surf comfortably for hours.\"), \n(\"Surf Leash\", 29.99, 100, \"A strong and reliable surf leash that keeps your board attached to you. It features a comfortable ankle strap and is made from durable materials.\"), \n(\"Surf Wax\", 4.99, 200, \"Essential for maintaining grip on your board, this surf wax is easy to apply and provides excellent traction. It works well in various water temperatures.\"), \n(\"Surfboard Repair Kit\", 24.99, 40, \"Be prepared for dings and damages with this comprehensive repair kit. It includes everything you need to fix your surfboard quickly and efficiently.\"), \n(\"Rash Guard\", 39.99, 70, \"Protect your skin from the sun and abrasions with this lightweight rash guard. It's quick-drying and offers excellent UV protection for long days on the water.\"), \n(\"Surfing Sunglasses\", 59.99, 45, \"Stylish and functional, these sunglasses provide UV protection and reduce glare while you surf. They are designed to stay in place even during the roughest rides.\"), \n(\"Surfboard Fin Set\", 79.99, 35, \"Enhance your board's performance with this fin set. Designed for stability and maneuverability, they are compatible with most surfboards.\"), \n(\"Surfing Helmet\", 89.99, 25, \"Safety first with this lightweight surfing helmet. It provides protection against impacts while maintaining comfort and style.\"), \n(\"Beach Towel\", 29.99, 80, \"Soft and absorbent, this beach towel is perfect for drying off after a surf session. It features vibrant colors and is easy to pack for a day at the beach.\"), \n(\"Surfing Backpack\", 69.99, 50, \"A versatile backpack designed for surfers, it has compartments for your gear and a waterproof section for wet items. Perfect for day trips to the beach.\"), \n(\"Waterproof Phone Case\", 19.99, 100, \"Keep your phone safe while surfing with this waterproof case. It allows for touch screen use and is perfect for capturing those epic wave moments.\"), \n(\"Surfing Booties\", 49.99, 40, \"These neoprene booties provide warmth and protection for your feet in cold waters. They feature a non-slip sole for better grip on your board.\"), \n(\"Surfing Gloves\", 34.99, 30, \"Protect your hands from cold water and abrasions with these surfing gloves. They offer a snug fit and excellent dexterity for better control.\"), \n(\"Cooler Bag\", 49.99, 20, \"Keep your drinks cold on the beach with this insulated cooler bag. It's spacious and easy to carry, making it perfect for a day of surfing.\"), \n(\"Surfing Lessons Voucher\", 149.99, 10, \"Gift someone the experience of a lifetime with a surfing lessons voucher. Perfect for beginners looking to learn the basics of riding waves.\"), \n(\"Surfboard Wall Rack\", 79.99, 15, \"Show off your surfboard with this stylish wall rack. Made from sturdy materials, it keeps your board safe and adds a decorative touch to your home.\"), \n(\"Sunblock SPF 50\", 14.99, 100, \"Protect your skin from harmful UV rays with this high-SPF sunblock. Water-resistant and non-greasy, it's perfect for long days on the beach.\"), \n(\"Fins Key\", 9.99, 150, \"A handy tool for adjusting your surfboard fins, ensuring optimal performance. Compact and lightweight, it fits easily in your surf bag.\"), \n(\"Surfing Magazine Subscription\", 29.99, 12, \"Stay updated on the latest surfing trends and techniques with a subscription to a top surfing magazine. Perfect for enthusiasts and professionals alike.\"), \n(\"Surfboard Wax Comb\", 5.99, 200, \"Keep your board in top shape with this essential wax comb. It helps to apply and remove wax efficiently, ensuring optimal grip.\"), \n(\"Surfing DVD\", 19.99, 60, \"Learn from the pros with this instructional surfing DVD. It covers techniques for all skill levels, making it a great resource for aspiring surfers.\"), \n(\"Inflatable Paddleboard\", 499.99, 10, \"Enjoy the versatility of an inflatable paddleboard that can be used for surfing, yoga, or leisure paddling. It’s easy to transport and store.\"), \n(\"Surfing Action Camera\", 199.99, 25, \"Capture your surfing adventures with this high-definition action camera. It’s waterproof and comes with various mounts for versatile filming.\"), \n(\"Beach Umbrella\", 39.99, 80, \"Stay protected from the sun with this durable beach umbrella. It’s easy to set up and provides ample shade for relaxing after surfing.\"), \n(\"Surfboard Tail Pad\", 24.99, 50, \"Enhance your grip with this high-quality tail pad. It provides excellent traction and is designed to withstand the rigors of surfing.\"), \n(\"Kite Surfing Equipment\", 899.99, 5, \"Experience the thrill of kite surfing with this complete equipment set. It includes a kite, board, and harness for an unforgettable ride.\"), \n(\"Surfing Fins\", 69.99, 30, \"These performance fins are designed to enhance your surfboard's maneuverability and speed. Ideal for experienced surfers looking to improve their skills.\"), \n(\"Surfing T-shirt\", 24.99, 100, \"Show off your love for surfing with this comfortable cotton t-shirt. It features a stylish design and is perfect for casual wear.\"), \n(\"Surfboard Socks\", 14.99, 150, \"Protect your surfboard from dings and scratches with these soft surfboard socks. They are lightweight and easy to carry.\"), \n(\"Portable Shower\", 39.99, 20, \"Rinse off after a surf session with this portable shower. It’s easy to set up and provides a refreshing clean wherever you are.\"), \n(\"Surfing Cones\", 19.99, 100, \"Perfect for marking your surf practice area, these colorful cones are lightweight and easy to transport. Ideal for training sessions.\"), \n(\"Surfing Beanie\", 19.99, 60, \"Keep your head warm on chilly beach days with this stylish surfing beanie. Made from soft materials, it’s both functional and fashionable.\"), \n(\"Waterproof Speaker\", 79.99, 15, \"Enjoy your favorite tunes while surfing with this waterproof Bluetooth speaker. It delivers high-quality sound and is perfect for beach outings.\"), \n(\"Surfing Sandals\", 34.99, 80, \"Comfortable and durable, these sandals are perfect for wearing to and from the beach. They provide excellent grip on wet surfaces.\"), \n(\"Surfing Gift Card\", 50.00, 100, \"Give the gift of choice with a surfing gift card. Perfect for friends and family who love the ocean and surfing.\"), \n(\"Surfboard Railing\", 39.99, 30, \"Keep your surfboards organized with this sturdy surfboard railing. It’s easy to install and perfect for garages or beach houses.\"), \n(\"Surfing Art Print\", 29.99, 50, \"Add a touch of ocean-inspired decor to your space with this beautiful surfing art print. It’s perfect for any surfing enthusiast.\"), \n(\"Surfing Travel Guide\", 19.99, 40, \"Discover the best surfing spots around the world with this comprehensive travel guide. It’s a must-have for any surfing adventurer.\"), \n(\"Surfing Hoodie\", 49.99, 30, \"Stay warm and stylish with this cozy surfing hoodie. It features a comfortable fit and a design that celebrates the surfing lifestyle.\"), \n(\"Surfing Keychain\", 9.99, 150, \"Show off your passion for surfing with this fun keychain. It’s a great little accessory for your keys or backpack.\"), \n(\"Surfing Water Bottle\", 19.99, 100, \"Stay hydrated while enjoying the waves with this reusable water bottle. It features an eco-friendly design and keeps drinks cold.\"), \n(\"Surfboard Stand\", 49.99, 25, \"Display your surfboard proudly with this sturdy surfboard stand. It’s perfect for showcasing your favorite board at home.\"), \n(\"Surfing Lessons Book\", 24.99, 20, \"Learn the fundamentals of surfing with this informative book. It covers techniques, safety tips, and more for aspiring surfers.\"), \n(\"Beach Chair\", 59.99, 30, \"Relax in comfort after a long day of surfing with this portable beach chair. It’s lightweight and easy to carry.\"), \n(\"Surfing Calendar\", 14.99, 100, \"Stay inspired all year round with this surfing calendar featuring stunning ocean photography. Perfect for any surfing enthusiast.\"), \n(\"Surfing Notebook\", 9.99, 200, \"Capture your surfing thoughts and experiences in this stylish notebook. It’s perfect for jotting down ideas or planning your next adventure.\"), \n(\"Surfing Phone Holder\", 19.99, 80, \"Keep your phone secure while you surf with this adjustable phone holder. It’s designed to fit most surfboards and is easy to install.\"), \n(\"Surfing Wall Art\", 39.99, 25, \"Bring the ocean vibe to your home with this stunning surfing wall art. It’s perfect for any room and adds a touch of adventure.\"), \n(\"Surfing Flip Flops\", 24.99, 100, \"These comfortable flip flops are perfect for wearing to the beach. They feature a stylish design and are easy to slip on and off.\"), \n(\"Surfing Travel Bag\", 99.99, 15, \"A spacious travel bag designed for surfers, it holds all your gear and is easy to carry. Perfect for road trips to the beach.\"), \n(\"Surfing First Aid Kit\", 29.99, 30, \"Stay prepared for minor injuries with this compact first aid kit. It includes essential supplies for treating cuts and scrapes.\"), \n(\"Surfing Coasters\", 19.99, 50, \"Protect your surfaces with these fun surfing-themed coasters. They add a decorative touch to your home while keeping it clean.\"), \n(\"Surfing Beverages Cooler\", 39.99, 20, \"Keep your drinks cool on hot beach days with this stylish beverages cooler. It’s perfect for picnics and beach parties.\"), \n(\"Surfing Dog Life Jacket\", 34.99, 15, \"Ensure your furry friend is safe while enjoying the water with this dog life jacket. It’s designed for comfort and buoyancy.\"), \n(\"Surfing Beach Blanket\", 29.99, 45, \"Enjoy a comfortable spot on the sand with this oversized beach blanket. It’s sand-resistant and easy to pack for a day at the beach.\"), \n(\"Surfing Jewelry\", 49.99, 25, \"Show off your love for the ocean with this beautiful surfing-themed jewelry. It’s a perfect gift for any surfing enthusiast.\"), \n(\"Surfing Adventure Book\", 19.99, 60, \"Explore thrilling surfing stories and adventures in this captivating book. Perfect for inspiring your next surfing trip.\"), \n(\"Surfing Yoga Mat\", 39.99, 20, \"Enhance your practice with this eco-friendly yoga mat designed for surfers. It provides excellent grip and cushioning.\"), \n(\"Surfing Beach Tote\", 29.99, 50, \"Carry all your beach essentials with this stylish tote bag. It’s spacious and features fun surfing designs.\"), \n(\"Surfing Scarf\", 19.99, 100, \"Stay warm and stylish with this lightweight surfing scarf. It’s perfect for chilly beach evenings and adds flair to any outfit.\"), \n(\"Surfing Phone Mount\", 24.99, 30, \"Keep your phone secure while you surf with this adjustable phone mount. It’s designed to fit most surfboards and is easy to install.\"), \n(\"Surfing Water Shoes\", 39.99, 40, \"Protect your feet while surfing with these lightweight water shoes. They provide excellent grip and are perfect for rocky beaches.\"), \n(\"Surfing Travel Journal\", 14.99, 70, \"Document your surfing adventures with this travel journal. It’s perfect for capturing memories and experiences on your trips.\"), \n(\"Surfing Art Poster\", 19.99, 50, \"Add a touch of ocean-inspired decor to your space with this vibrant surfing art poster. Perfect for any surfing enthusiast.\"), \n(\"Surfing Pet Leash\", 24.99, 30, \"Take your furry friend to the beach with this durable surfing-themed pet leash. It’s designed for comfort and control.\"), \n(\"Surfing Beach Games Set\", 34.99, 20, \"Enjoy fun beach games with this complete set. It includes everything you need for a day of entertainment after surfing.\"), \n(\"Surfing Water Bottle Holder\", 19.99, 100, \"Keep your water bottle secure while you surf with this convenient holder. It attaches easily to your board for quick access.\"), \n(\"Surfing Beach Flag\", 29.99, 15, \"Mark your spot on the beach with this colorful surfing beach flag. It’s perfect for gatherings and adds a festive touch.\"), \n(\"Surfing Paddle\", 49.99, 25, \"Enhance your paddleboarding experience with this lightweight paddle. It’s adjustable and designed for comfort and efficiency.\"), \n(\"Surfing Beach Ball\", 14.99, 100, \"Have fun in the sun with this vibrant beach ball. It’s perfect for games and relaxation after a surf session.\"), \n(\"Surfing Sunglasses Case\", 19.99, 60, \"Protect your sunglasses with this stylish case. It’s compact and designed to fit most sunglasses, making it perfect for beach trips.\"), \n(\"Surfing Beach Mat\", 24.99, 40, \"Relax comfortably on the sand with this durable beach mat. It’s easy to clean and perfect for a day of sun and surf.\"), \n(\"Surfing Hammock\", 49.99, 20, \"Unwind after a long day of surfing with this portable hammock. It’s easy to set up and perfect for relaxing in the sun.\"), \n(\"Surfing Beach Cooler\", 39.99, 30, \"Keep your drinks cold while enjoying the beach with this insulated cooler. It’s spacious and perfect for picnics.\"), \n(\"Surfing Beach Shoes\", 34.99, 50, \"Lightweight and comfortable, these beach shoes are perfect for walking on hot sand. They provide excellent grip and are easy to slip on.\"), \n(\"Surfing Beach Kit\", 79.99, 15, \"This comprehensive beach kit includes all the essentials for a day of surfing and relaxation. It’s perfect for any beachgoer.\"), \n(\"Surfing Picnic Set\", 59.99, 20, \"Enjoy a picnic by the beach with this complete picnic set. It includes everything you need for a relaxing meal after surfing.\"), \n(\"Surfing Beach Chair\", 49.99, 30, \"Relax comfortably on the beach with this lightweight folding chair. It’s easy to carry and perfect for beach days.\"), \n(\"Surfing Beach Blanket\", 29.99, 50, \"Soft and sand-resistant, this beach blanket is perfect for lounging after a surf session. It’s easy to pack and carry.\"), \n(\"Surfing Beach Trolley\", 99.99, 10, \"Transport your gear effortlessly with this sturdy beach trolley. It’s designed for easy maneuverability on sandy surfaces.\"), \n(\"Surfing Beach Umbrella\", 39.99, 40, \"Stay cool and protected from the sun with this durable beach umbrella. It’s easy to set up and perfect for beach outings.\"), \n(\"Surfing Beach Backpack\", 69.99, 20, \"Carry all your beach essentials with this stylish backpack. It’s spacious and designed for convenience on beach trips.\"), \n(\"Surfing Beach Tent\", 149.99, 10, \"Create a shaded oasis with this easy-to-set-up beach tent. It’s perfect for relaxing after a long day of surfing.\"), \n(\"Surfing Beach Games\", 29.99, 30, \"Enjoy fun beach games with this complete set. It includes everything you need for a day of entertainment after surfing.\"), \n(\"Surfing Beach Accessories Set\", 39.99, 25, \"This set includes all the essential accessories for a fun day at the beach. Perfect for surfers and beach lovers alike.\"), \n(\"Surfing Beach Gear\", 79.99, 15, \"Get ready for your next beach adventure with this complete surfing gear set. It includes everything you need for a great day on the waves.\"), \n(\"Surfing Beach Essentials Kit\", 49.99, 20, \"This kit includes all the essentials for a day of surfing and relaxation. Perfect for any beachgoer.\"), \n(\"Surfing Beach Blanket\", 29.99, 40, \"Soft and sand-resistant, this beach blanket is perfect for lounging after a surf session. It’s easy to pack and carry.\")]"