"products = [\n    (\"Ultra HD Smart TV 55\\\"\", 699.99, 30, \"Experience stunning picture quality with this 55-inch Ultra HD Smart TV. It features built-in streaming services and voice control for easy navigation.\"),\n    (\"4K OLED TV 65\\\"\", 1499.99, 20, \"Immerse yourself in the vibrant colors and deep blacks of this 65-inch 4K OLED TV. Perfect for movie nights and gaming with its ultra-responsive display.\"),\n    (\"LED TV 32\\\"\", 299.99, 50, \"This 32-inch LED TV offers great value with clear picture quality and a compact design. Ideal for smaller rooms or as a secondary TV.\"),\n    (\"Smart TV 75\\\"\", 1999.99, 15, \"Enjoy a cinematic experience with this massive 75-inch Smart TV, featuring advanced HDR technology and a wide viewing angle. Perfect for sports and action movies.\"),\n    (\"Curved TV 49\\\"\", 599.99, 25, \"With its immersive curved design, this 49-inch TV enhances your viewing experience. It combines sleek aesthetics with high-definition visuals.\"),\n    (\"QLED TV 55\\\"\", 1299.99, 18, \"This 55-inch QLED TV delivers exceptional brightness and color accuracy for an unparalleled viewing experience. It's perfect for both movies and gaming.\"),\n    (\"Portable Mini TV\", 149.99, 100, \"A compact and lightweight mini TV that you can take anywhere. It features a built-in battery and a clear display for on-the-go entertainment.\"),\n    (\"Smart 4K TV 50\\\"\", 799.99, 40, \"This 50-inch Smart 4K TV is equipped with all the latest streaming apps and features. Its sleek design fits perfectly in any living room.\"),\n    (\"HDR LED TV 43\\\"\", 399.99, 35, \"Enjoy enhanced contrast and vibrant colors with this 43-inch HDR LED TV. It's a great choice for binge-watching your favorite shows.\"),\n    (\"8K Ultra HD TV 65\\\"\", 2999.99, 10, \"Step into the future of television with this 65-inch 8K Ultra HD TV. It offers breathtaking detail and clarity that will elevate your viewing experience.\"),\n    (\"Smart TV 40\\\"\", 499.99, 45, \"This 40-inch Smart TV comes with built-in Wi-Fi and streaming capabilities. It's perfect for casual viewing and compact spaces.\"),\n    (\"Roku TV 55\\\"\", 649.99, 33, \"A 55-inch Roku TV that provides seamless access to thousands of channels. Its user-friendly interface makes it easy to find your favorite content.\"),\n    (\"Sony Bravia 65\\\"\", 1799.99, 12, \"The Sony Bravia 65-inch TV features cutting-edge technology for superior picture quality. Perfect for movie lovers and gamers alike.\"),\n    (\"Samsung Frame TV 55\\\"\", 1999.99, 8, \"Transform your living space with the Samsung Frame TV that doubles as a piece of art. Its customizable bezels and art mode make it a stylish addition.\"),\n    (\"LG NanoCell TV 65\\\"\", 1399.99, 14, \"Experience lifelike colors and stunning clarity with the LG NanoCell 65-inch TV. Ideal for watching sports and movies with family and friends.\"),\n    (\"Philips Ambilight TV 55\\\"\", 1099.99, 16, \"The Philips Ambilight TV creates an immersive viewing experience with its unique lighting technology. This 55-inch model is perfect for movie nights.\"),\n    (\"TCL 4K Smart TV 50\\\"\", 499.99, 37, \"This 50-inch TCL 4K Smart TV offers excellent picture quality and a wide range of streaming options. A great choice for budget-conscious consumers.\"),\n    (\"Vizio 65\\\" 4K TV\", 899.99, 22, \"Enjoy stunning visuals with the Vizio 65-inch 4K TV, featuring smart capabilities and a sleek design. Perfect for any home entertainment setup.\"),\n    (\"Hisense 55\\\" LED TV\", 549.99, 28, \"The Hisense 55-inch LED TV delivers vibrant colors and rich details for an enjoyable viewing experience. It's a great option for everyday use.\"),\n    (\"Panasonic 50\\\" Smart TV\", 699.99, 20, \"This 50-inch Panasonic Smart TV offers a user-friendly interface and access to popular streaming services. Perfect for family entertainment.\"),\n    (\"Sceptre 40\\\" LED TV\", 299.99, 60, \"A budget-friendly 40-inch LED TV that offers decent picture quality for casual viewing. Ideal for bedrooms or smaller living spaces.\"),\n    (\"Sharp 70\\\" 4K TV\", 1299.99, 15, \"The Sharp 70-inch 4K TV provides stunning clarity and vibrant colors for an immersive viewing experience. Perfect for large living rooms.\"),\n    (\"JVC 55\\\" Smart TV\", 499.99, 30, \"This 55-inch JVC Smart TV features a sleek design and access to popular streaming apps. Perfect for binge-watching your favorite shows.\"),\n    (\"Westinghouse 32\\\" LED TV\", 199.99, 70, \"A compact 32-inch LED TV that offers great value for casual viewing. Ideal for kitchens or bedrooms.\"),\n    (\"Insignia 43\\\" Fire TV\", 349.99, 40, \"The Insignia 43-inch Fire TV comes with Alexa built-in for voice control. Perfect for streaming your favorite shows and movies.\"),\n    (\"Element 50\\\" 4K TV\", 399.99, 38, \"This 50-inch Element 4K TV provides great picture quality and smart features at an affordable price. Ideal for family movie nights.\"),\n    (\"Sony A8H OLED TV 55\\\"\", 1999.99, 10, \"Experience incredible picture quality with the Sony A8H OLED TV. Its 55-inch screen is perfect for movie lovers and gamers.\"),\n    (\"Samsung Q80T 65\\\"\", 1799.99, 12, \"The Samsung Q80T 65-inch TV offers stunning visuals and advanced gaming features. Perfect for high-end home entertainment setups.\"),\n    (\"LG CX OLED TV 65\\\"\", 2499.99, 8, \"The LG CX OLED TV delivers exceptional picture quality and contrast. Ideal for cinephiles and avid gamers.\"),\n    (\"Toshiba 43\\\" Fire TV\", 349.99, 45, \"This 43-inch Toshiba Fire TV offers seamless access to popular streaming services. Perfect for everyday viewing in any room.\"),\n    (\"RCA 32\\\" LED TV\", 199.99, 50, \"A simple and affordable 32-inch LED TV that's perfect for casual viewing. Ideal for bedrooms or dorm rooms.\"),\n    (\"Acer 24\\\" Portable Monitor\", 149.99, 80, \"This 24-inch portable monitor is perfect for on-the-go use. It features a lightweight design and clear display for presentations.\"),\n    (\"BenQ 32\\\" Smart TV\", 399.99, 30, \"The BenQ 32-inch Smart TV offers vibrant visuals and smart features. Ideal for small spaces and casual viewing.\"),\n    (\"Vizio 75\\\" 4K TV\", 2499.99, 5, \"Enjoy a theater-like experience with this massive 75-inch Vizio 4K TV. Perfect for sports and movie enthusiasts.\"),\n    (\"Philips 50\\\" 4K TV\", 649.99, 25, \"The Philips 50-inch 4K TV provides stunning clarity and vibrant colors. Perfect for family movie nights and gaming.\"),\n    (\"Samsung 43\\\" QLED TV\", 899.99, 15, \"This 43-inch QLED TV offers impressive picture quality with vivid colors. Perfect for small living spaces and apartments.\"),\n    (\"LG 55\\\" NanoCell TV\", 1099.99, 10, \"Enjoy lifelike colors and stunning visuals with the LG 55-inch NanoCell TV. Ideal for movie nights and gaming.\"),\n    (\"TCL 65\\\" 4K Smart TV\", 799.99, 20, \"The TCL 65-inch 4K Smart TV offers excellent picture quality and a wide range of streaming options. Perfect for family entertainment.\"),\n    (\"Sony 55\\\" Bravia TV\", 1399.99, 18, \"This 55-inch Sony Bravia TV features cutting-edge technology for superior picture quality. Perfect for movie lovers and gamers alike.\"),\n    (\"Sharp 55\\\" Aquos TV\", 1099.99, 22, \"The Sharp 55-inch Aquos TV delivers stunning picture quality and smart features. Perfect for any home entertainment setup.\"),\n    (\"Hisense 70\\\" 4K TV\", 1299.99, 8, \"Enjoy a cinematic experience with the Hisense 70-inch 4K TV. Ideal for large living rooms and family gatherings.\"),\n    (\"Roku 50\\\" Smart TV\", 499.99, 40, \"This 50-inch Roku Smart TV provides seamless access to thousands of channels. Perfect for binge-watching your favorite shows.\"),\n    (\"TCL 32\\\" LED TV\", 249.99, 55, \"A compact 32-inch LED TV that offers great value for casual viewing. Ideal for bedrooms or smaller spaces.\"),\n    (\"Samsung 55\\\" Frame TV\", 1999.99, 10, \"Transform your living space with the Samsung Frame TV that doubles as a piece of art. Its customizable bezels make it a stylish addition.\"),\n    (\"LG 49\\\" Smart TV\", 599.99, 25, \"This 49-inch LG Smart TV offers vibrant colors and smart features. Perfect for family entertainment and casual viewing.\"),\n    (\"Vizio 50\\\" 4K TV\", 499.99, 35, \"Enjoy stunning visuals with the Vizio 50-inch 4K TV, featuring smart capabilities and a sleek design. Perfect for any home setup.\"),\n    (\"Sony 43\\\" Full HD TV\", 399.99, 30, \"The Sony 43-inch Full HD TV delivers vibrant colors and clear visuals. Ideal for everyday viewing and gaming.\"),\n    (\"Panasonic 55\\\" OLED TV\", 1499.99, 15, \"Experience incredible picture quality with the Panasonic 55-inch OLED TV. Perfect for movie nights and immersive gaming.\"),\n    (\"Samsung 32\\\" Smart TV\", 349.99, 50, \"This 32-inch Samsung Smart TV offers access to popular streaming services. Ideal for smaller rooms and casual viewing.\"),\n    (\"Toshiba 50\\\" 4K TV\", 499.99, 40, \"The Toshiba 50-inch 4K TV provides stunning clarity and vibrant colors. Perfect for family movie nights and gaming.\"),\n    (\"Westinghouse 43\\\" LED TV\", 299.99, 35, \"A budget-friendly 43-inch LED TV that offers decent picture quality for casual viewing. Ideal for bedrooms or smaller living spaces.\"),\n    (\"Insignia 55\\\" Fire TV\", 649.99, 20, \"The Insignia 55-inch Fire TV comes with Alexa built-in for voice control. Perfect for streaming your favorite shows and movies.\"),\n    (\"Acer 27\\\" Portable Monitor\", 199.99, 60, \"This 27-inch portable monitor is perfect for on-the-go use. It features a lightweight design and clear display for presentations.\"),\n    (\"BenQ 32\\\" Smart TV\", 399.99, 30, \"The BenQ 32-inch Smart TV offers vibrant visuals and smart features. Ideal for small spaces and casual viewing.\"),\n]"