"[\n    (\"Vitamin C 1000mg\", 19.99, 200, \"Boost your immune system with our high-potency Vitamin C. Each tablet provides 1000mg of pure Vitamin C to support overall health.\"),\n    (\"Vitamin D3 5000 IU\", 15.99, 150, \"Essential for bone health, our Vitamin D3 supplement helps maintain strong bones and a healthy immune system. Each softgel provides 5000 IU of Vitamin D3.\"),\n    (\"Multivitamin for Women\", 25.99, 100, \"Formulated specifically for women, this multivitamin supports energy, immunity, and overall wellness. Contains essential vitamins and minerals for daily health.\"),\n    (\"Multivitamin for Men\", 25.99, 100, \"A comprehensive multivitamin designed for men's health. Supports energy levels, muscle function, and overall vitality with key nutrients.\"),\n    (\"Omega-3 Fish Oil\", 29.99, 80, \"Our Omega-3 Fish Oil provides essential fatty acids that support heart health and cognitive function. Each serving delivers a potent dose of EPA and DHA.\"),\n    (\"B-Complex Vitamins\", 17.99, 120, \"Support your energy metabolism and reduce fatigue with our B-Complex Vitamins. This formula includes all eight essential B vitamins for optimal health.\"),\n    (\"Calcium Magnesium Zinc\", 22.99, 90, \"A powerful combination of Calcium, Magnesium, and Zinc to support bone density and overall health. Ideal for maintaining strong bones and immune function.\"),\n    (\"Probiotic 10 Billion CFU\", 24.99, 70, \"Promote digestive health with our Probiotic supplement containing 10 billion CFU. Helps maintain a balanced gut flora for better digestion.\"),\n    (\"Vitamin E 400 IU\", 18.99, 130, \"Vitamin E is a powerful antioxidant that helps protect cells from damage. Our 400 IU softgel supports skin health and immune function.\"),\n    (\"Biotin 5000 mcg\", 21.99, 110, \"Support healthy hair, skin, and nails with our Biotin supplement. Each tablet provides 5000 mcg of Biotin to promote beauty from within.\"),\n    (\"Iron 65 mg\", 16.99, 140, \"Essential for red blood cell production, our Iron supplement provides 65 mg of iron to support energy levels and overall vitality. Perfect for those with iron deficiency.\"),\n    (\"Vitamin K2 100 mcg\", 19.99, 90, \"Support bone and cardiovascular health with our Vitamin K2 supplement. Each capsule provides 100 mcg of Vitamin K2 to help maintain healthy arteries.\"),\n    (\"Folic Acid 800 mcg\", 14.99, 150, \"Folic Acid is crucial for DNA synthesis and cell division. Our 800 mcg tablets are perfect for supporting prenatal health and overall wellness.\"),\n    (\"Zinc 50 mg\", 12.99, 160, \"Zinc is essential for immune function and skin health. Each tablet provides 50 mg of Zinc to help support your body's defenses.\"),\n    (\"Vitamin B12 1000 mcg\", 19.99, 120, \"Boost your energy and support nerve health with our Vitamin B12 supplement. Each tablet delivers 1000 mcg of B12 for optimal health.\"),\n    (\"CoQ10 200 mg\", 29.99, 75, \"CoQ10 is vital for energy production and heart health. Our 200 mg softgel helps support cardiovascular function and overall vitality.\"),\n    (\"Turmeric Curcumin\", 23.99, 85, \"Harness the power of turmeric with our Curcumin supplement. Known for its anti-inflammatory properties, it's perfect for joint and overall health.\"),\n    (\"L-Theanine 200 mg\", 18.99, 100, \"Promote relaxation without drowsiness with L-Theanine. Each capsule provides 200 mg to help reduce stress and improve mental clarity.\"),\n    (\"Ashwagandha 600 mg\", 21.99, 90, \"Known for its adaptogenic properties, Ashwagandha helps the body manage stress. Our 600 mg capsules support overall wellness and vitality.\"),\n    (\"Chia Seed Oil\", 24.99, 70, \"Rich in Omega-3 fatty acids, Chia Seed Oil supports heart and brain health. Each softgel delivers a potent dose of essential fatty acids.\"),\n    (\"Maca Root Powder\", 19.99, 80, \"Maca Root is known for its energy-boosting and hormone-balancing properties. Our powder is perfect for smoothies and health shakes.\"),\n    (\"Spirulina Tablets\", 15.99, 150, \"Packed with nutrients, Spirulina is a superfood that supports immune health and energy levels. Our tablets are a convenient way to add this superfood to your diet.\"),\n    (\"Cranberry Extract\", 22.99, 90, \"Support urinary tract health with our concentrated Cranberry Extract. Each capsule provides powerful antioxidants to promote wellness.\"),\n    (\"Green Tea Extract\", 18.99, 120, \"Rich in antioxidants, our Green Tea Extract supports metabolism and weight management. Each capsule delivers a potent dose of green tea benefits.\"),\n    (\"Milk Thistle 250 mg\", 19.99, 100, \"Milk Thistle is known for its liver-supporting properties. Our 250 mg capsules help protect and detoxify the liver.\"),\n    (\"Ginseng Root Extract\", 23.99, 75, \"Ginseng is renowned for its energy-boosting and stress-reducing benefits. Our extract helps enhance physical and mental performance.\"),\n    (\"Ginkgo Biloba 120 mg\", 21.99, 90, \"Support cognitive function and memory with Ginkgo Biloba. Each capsule contains 120 mg of this powerful herbal extract.\"),\n    (\"Vitamin A 5000 IU\", 17.99, 130, \"Vitamin A is essential for vision and immune health. Our 5000 IU softgel supports overall wellness and skin health.\"),\n    (\"Selenium 200 mcg\", 18.99, 110, \"Selenium is a powerful antioxidant that supports immune function. Each tablet provides 200 mcg to help protect your body's cells.\"),\n    (\"L-Carnitine 500 mg\", 24.99, 80, \"L-Carnitine is vital for fat metabolism and energy production. Our 500 mg capsules help support weight management and exercise performance.\"),\n    (\"Fiber Supplement\", 16.99, 140, \"Promote digestive health with our Fiber Supplement. Each serving provides a blend of soluble and insoluble fiber to support regularity.\"),\n    (\"Vitamin B6 100 mg\", 14.99, 150, \"Vitamin B6 plays a crucial role in brain health and metabolism. Our 100 mg tablets support energy production and cognitive function.\"),\n    (\"Astaxanthin 12 mg\", 29.99, 70, \"Astaxanthin is a powerful antioxidant that supports skin and eye health. Each softgel provides 12 mg of this potent nutrient.\"),\n    (\"Electrolyte Powder\", 19.99, 90, \"Stay hydrated and replenish electrolytes with our Electrolyte Powder. Perfect for athletes and active lifestyles, it supports optimal hydration.\"),\n    (\"Vitamin C + Zinc\", 21.99, 80, \"Boost your immune system with our combined Vitamin C and Zinc formula. This powerful duo supports overall health and wellness.\"),\n    (\"Collagen Peptides\", 24.99, 75, \"Support skin elasticity and joint health with our Collagen Peptides. Each serving provides essential amino acids for beauty and wellness.\"),\n    (\"Rhodiola Rosea\", 22.99, 85, \"Rhodiola Rosea is an adaptogen that helps combat stress and fatigue. Our capsules support mental clarity and physical endurance.\"),\n    (\"Cinnamon Extract\", 19.99, 100, \"Cinnamon Extract supports healthy blood sugar levels and metabolic function. Each capsule is packed with the benefits of this powerful spice.\"),\n    (\"Kelp 225 mcg\", 15.99, 150, \"Kelp is rich in iodine, essential for thyroid health. Our 225 mcg capsules support metabolism and overall wellness.\"),\n    (\"Black Seed Oil\", 23.99, 80, \"Known for its anti-inflammatory properties, Black Seed Oil supports immune function and overall health. Each softgel delivers potent benefits.\"),\n    (\"Beetroot Powder\", 18.99, 120, \"Beetroot Powder supports cardiovascular health and enhances athletic performance. Add it to smoothies for a natural energy boost.\"),\n    (\"Grape Seed Extract\", 21.99, 90, \"Rich in antioxidants, Grape Seed Extract supports heart health and circulation. Each capsule provides a concentrated dose of this superfood.\"),\n    (\"Aloe Vera Gel\", 16.99, 140, \"Aloe Vera Gel supports digestive health and skin hydration. Our formula is perfect for daily wellness and soothing properties.\"),\n    (\"Saffron Extract\", 29.99, 70, \"Saffron is known for its mood-enhancing properties. Our extract supports emotional well-being and overall mental health.\"),\n    (\"Choline Bitartrate\", 22.99, 85, \"Choline is essential for brain health and cognitive function. Our Bitartrate form supports memory and overall mental performance.\"),\n    (\"Moringa Leaf Powder\", 19.99, 100, \"Moringa is a nutrient-dense superfood that supports energy and overall health. Add our leaf powder to smoothies or meals for a health boost.\"),\n    (\"Vitamin D3 + K2\", 24.99, 75, \"This combined formula of Vitamin D3 and K2 supports bone and cardiovascular health. Each capsule ensures optimal absorption and efficacy.\"),\n    (\"Ginger Root Extract\", 18.99, 120, \"Ginger Root is known for its digestive and anti-inflammatory benefits. Our extract supports gut health and overall wellness.\"),\n    (\"Fisetin 100 mg\", 23.99, 80, \"Fisetin is a powerful flavonoid that supports brain health and longevity. Each capsule provides 100 mg of this beneficial compound.\"),\n    (\"N-Acetyl Cysteine (NAC)\", 21.99, 90, \"NAC supports detoxification and respiratory health. Our capsules help promote healthy lung function and overall wellness.\"),\n    (\"Vitamin B1 100 mg\", 14.99, 150, \"Vitamin B1 is essential for energy production and nerve function. Our 100 mg tablets support overall metabolic health.\"),\n    (\"CoQ10 + Omega-3\", 29.99, 70, \"This unique formula combines CoQ10 and Omega-3 fatty acids for heart and brain health. Each softgel supports optimal cardiovascular function.\"),\n    (\"Lutein + Zeaxanthin\", 22.99, 85, \"Support eye health with our Lutein and Zeaxanthin formula. These carotenoids help protect against blue light and promote vision health.\"),\n    (\"Resveratrol 500 mg\", 24.99, 75, \"Resveratrol is known for its antioxidant properties that support heart health. Each capsule provides 500 mg of this powerful compound.\"),\n    (\"Vitamin B2 100 mg\", 16.99, 140, \"Vitamin B2 is crucial for energy production and cellular function. Our 100 mg tablets support overall health and vitality.\"),\n    (\"Selenium + Vitamin E\", 21.99, 90, \"This formula combines Selenium and Vitamin E for enhanced antioxidant support. Together, they help protect cells from oxidative stress.\"),\n    (\"Chondroitin Sulfate\", 18.99, 120, \"Chondroitin Sulfate supports joint health and mobility. Our capsules are perfect for those looking to maintain healthy joints.\"),\n    (\"Elderberry Extract\", 19.99, 100, \"Elderberry is known for its immune-boosting properties. Our extract provides powerful antioxidants to support overall health.\"),\n    (\"Vitamin C + Bioflavonoids\", 22.99, 80, \"This combination enhances the absorption of Vitamin C while providing additional antioxidant benefits. Each serving supports immune health.\"),\n    (\"Potassium 99 mg\", 14.99, 150, \"Potassium is essential for heart and muscle function. Our 99 mg tablets support electrolyte balance and overall wellness.\"),\n    (\"Apple Cider Vinegar Capsules\", 21.99, 90, \"Support digestion and weight management with our Apple Cider Vinegar Capsules. A convenient way to enjoy the benefits of ACV without the taste.\"),\n    (\"Vitamin D3 1000 IU\", 15.99, 150, \"Vitamin D3 is crucial for bone and immune health. Our 1000 IU softgel supports overall wellness and vitality.\"),\n    (\"Curcumin + Ginger\", 24.99, 75, \"This blend of Curcumin and Ginger supports anti-inflammatory benefits. Each capsule promotes joint health and overall wellness.\"),\n    (\"L-Arginine 500 mg\", 22.99, 85, \"L-Arginine supports blood flow and cardiovascular health. Our 500 mg capsules help enhance performance and overall vitality.\"),\n    (\"Vitamin B5 500 mg\", 19.99, 100, \"Vitamin B5 is essential for energy metabolism and hormone production. Our 500 mg tablets support overall health and vitality.\"),\n    (\"Hyaluronic Acid 100 mg\", 23.99, 80, \"Hyaluronic Acid supports skin hydration and joint health. Each capsule helps maintain moisture and elasticity in the skin.\"),\n    (\"Nutritional Yeast Flakes\", 16.99, 140, \"Nutritional Yeast is a complete protein source rich in B vitamins. Perfect for vegans, it adds a cheesy flavor to your meals.\"),\n    (\"Vitamin C Chewables\", 19.99, 120, \"Enjoy the benefits of Vitamin C in a delicious chewable form. Each serving supports immune health and provides antioxidant protection.\"),\n    (\"Coconut Oil Capsules\", 21.99, 90, \"Coconut Oil is known for its healthy fats that support energy and metabolism. Our capsules provide a convenient way to enjoy its benefits.\"),\n    (\"Beta Glucans\", 18.99, 100, \"Beta Glucans support immune function and overall health. Our capsules are perfect for enhancing your body's natural defenses.\"),\n    (\"Beet Juice Powder\", 24.99, 75, \"Beet Juice Powder supports cardiovascular health and enhances exercise performance. Add it to your smoothies for a natural energy boost.\"),\n    (\"Vitamin K1 100 mcg\", 14.99, 150, \"Vitamin K1 is essential for blood clotting and bone health. Our 100 mcg capsules support overall wellness and cardiovascular health.\"),\n    (\"Methylfolate 400 mcg\", 19.99, 90, \"Methylfolate is the active form of Folic Acid, crucial for DNA synthesis. Our 400 mcg tablets support prenatal health and overall wellness.\"),\n    (\"L-Glutamine 500 mg\", 22.99, 85, \"L-Glutamine supports muscle recovery and gut health. Each capsule provides 500 mg of this important amino acid for optimal performance.\"),\n    (\"Vitamin B7 (Biotin) 1000 mcg\", 18.99, 120, \"Biotin supports healthy hair, skin, and nails. Our 1000 mcg tablets provide the nutrients needed for beauty from within.\"),\n    (\"Green Superfood Powder\", 24.99, 75, \"Packed with nutrients, our Green Superfood Powder supports overall health and energy levels. Mix it into smoothies for a health boost.\"),\n    (\"Vitamin D2 1000 IU\", 15.99, 150, \"Vitamin D2 is important for maintaining bone health and immune function. Each softgel provides 1000 IU of this essential nutrient.\"),\n    (\"Tart Cherry Extract\", 21.99, 90, \"Tart Cherry Extract is known for its anti-inflammatory properties. Supports joint health and recovery after exercise.\"),\n    (\"Acai Berry Extract\", 19.99, 100, \"Acai Berries are rich in antioxidants that support overall health. Our extract provides a concentrated dose of these superfoods.\"),\n    (\"Cocoa Flavanols\", 22.99, 85, \"Cocoa Flavanols support heart health and cognitive function. Each capsule delivers the benefits of dark chocolate without the calories.\"),\n    (\"Rhodiola + Schisandra\", 24.99, 70, \"This blend of adaptogens supports stress management and mental clarity. Each capsule helps enhance physical and cognitive performance.\"),\n    (\"Vitamin C + E\", 19.99, 120, \"This powerful antioxidant combination supports skin health and immune function. Each serving provides the benefits of both vitamins.\"),\n    (\"Bitter Melon Extract\", 17.99, 150, \"Bitter Melon Extract supports healthy blood sugar levels. A natural way to promote metabolic health and wellness.\"),\n    (\"Citrus Bioflavonoids\", 21.99, 90, \"Citrus Bioflavonoids enhance the absorption of Vitamin C and provide additional antioxidant support. Each capsule promotes overall health.\"),\n    (\"Flaxseed Oil\", 18.99, 100, \"Flaxseed Oil is rich in Omega-3 fatty acids that support heart health. Our softgels provide a convenient way to incorporate this superfood into your diet.\"),\n    (\"Ginseng + Ginkgo Biloba\", 22.99, 85, \"This combination supports energy levels and cognitive function. Each capsule helps enhance mental clarity and focus.\"),\n    (\"Vitamin B12 + Folate\", 24.99, 75, \"This formula combines Vitamin B12 and Folate for optimal energy and brain health. Perfect for those looking to support their cognitive function.\"),\n    (\"Methylcobalamin 1000 mcg\", 19.99, 90, \"Methylcobalamin is a bioactive form of Vitamin B12 that supports nerve health. Each tablet provides 1000 mcg for optimal wellness.\"),\n    (\"L-Citrulline 1000 mg\", 25.99, 70, \"L-Citrulline supports blood flow and exercise performance. Each capsule provides 1000 mg to enhance endurance and recovery.\"),\n    (\"Chia Seeds\", 16.99, 140, \"Chia Seeds are a great source of Omega-3 fatty acids and fiber. Add them to your meals for a nutritious boost.\"),\n    (\"Propolis Extract\", 21.99, 90, \"Propolis is known for its immune-boosting properties. Our extract supports overall wellness and provides natural protection.\"),\n    (\"Kava Kava Root\", 18.99, 100, \"Kava Kava Root is known for its calming effects. Each capsule helps promote relaxation and reduce anxiety.\"),\n    (\"Bacopa Monnieri\", 23.99, 80, \"Bacopa Monnieri supports cognitive function and memory. Our capsules are perfect for enhancing mental clarity and focus.\"),\n    (\"Grape Seed Oil\", 19.99, 120, \"Grape Seed Oil is rich in antioxidants that support heart health. Our softgels provide a convenient way to enjoy its benefits.\"),\n    (\"Vitamin B3 (Niacin) 500 mg\", 17.99, 150, \"Vitamin B3 supports energy metabolism and cardiovascular health. Each tablet provides 500 mg for overall wellness.\"),\n    (\"Astaxanthin + Omega-3\", 29.99, 70, \"This combination supports skin health and cognitive function. Each softgel delivers the benefits of both nutrients.\"),\n    (\"Vitamin C Liposomal\", 24.99, 75, \"Liposomal Vitamin C enhances absorption and bioavailability. Supports immune health and provides powerful antioxidant protection.\"),\n    (\"L-Phenylalanine 500 mg\", 21.99, 85, \"L-Phenylalanine supports mood and cognitive function. Each capsule provides 500 mg to enhance overall mental well-being.\"),\n    (\"Calcium Citrate\", 18.99, 100, \"Calcium Citrate is essential for bone health and density. Our capsules provide a highly absorbable form of Calcium.\"),\n    (\"Ginger + Turmeric\", 22.99, 90, \"This powerful blend supports anti-inflammatory benefits and digestive health. Each capsule promotes overall wellness and vitality.\"),\n    (\"Vitamin B5 (Pantothenic Acid) 500 mg\", 19.99, 120, \"Vitamin B5 supports energy production and hormone synthesis. Our 500 mg tablets help maintain overall health and vitality.\"),\n    (\"Methylsulfonylmethane (MSM)\", 21.99, 75, \"MSM supports joint health and reduces inflammation. Each capsule provides a potent dose for optimal joint function.\"),\n    (\"L-Lysine 1000 mg\", 18.99, 100, \"L-Lysine is essential for protein synthesis and immune support. Our capsules provide 1000 mg for overall health.\"),\n    (\"Resveratrol + Quercetin\", 24.99, 80, \"This combination supports heart health and provides antioxidant protection. Each capsule promotes overall wellness and longevity.\"),\n    (\"Vitamin D3 + Calcium\", 22.99, 85, \"This formula combines Vitamin D3 and Calcium for optimal bone health. Each capsule supports strong bones and overall wellness.\"),\n    (\"L-Arginine + L-Citrulline\", 29.99, 70, \"This powerful blend supports blood flow and exercise performance. Each capsule enhances endurance and recovery.\"),\n    (\"Bromelain 500 mg\", 19.99, 100, \"Bromelain supports digestive health and reduces inflammation. Each capsule provides 500 mg for optimal wellness.\"),\n    (\"Vitamin B6 + Magnesium\", 21.99, 90, \"This combination supports energy production and muscle function. Each capsule promotes overall health and vitality.\"),\n    (\"Sodium Ascorbate\", 18.99, 120, \"Sodium Ascorbate is a buffered form of Vitamin C that supports immune health. Each capsule provides powerful antioxidant protection.\"),\n    (\"L-Theanine + GABA\", 24.99, 75, \"This blend supports relaxation and reduces stress. Each capsule enhances mental clarity and promotes calmness.\"),\n    (\"Green Coffee Bean Extract\", 22.99, 85, \"Green Coffee Bean Extract supports weight management and metabolism. Each capsule provides a concentrated dose of chlorogenic acids.\"),\n    (\"B-Complex + C\", 19.99, 100, \"This comprehensive formula provides essential B vitamins and Vitamin C for energy and immune support. Each serving promotes overall health.\"),\n    (\"Moringa + Spirulina\", 21.99, 90, \"This superfood blend supports energy and overall wellness. Each capsule provides the nutrient density of both Moringa and Spirulina.\"),\n    (\"Vitamin E + Selenium\", 24.99, 70, \"This combination provides powerful antioxidant support for skin and immune health. Each capsule promotes overall wellness.\"),\n    (\"Choline + Inositol\", 18.99, 100, \"Choline and Inositol support brain health and cognitive function. Our capsules help enhance memory and overall mental performance.\"),\n    (\"L-Glutathione\", 22.99, 85, \"L-Glutathione is a powerful antioxidant that supports detoxification. Each capsule promotes overall health and wellness.\"),\n    (\"Vitamin K2 + D3\", 29.99, 75, \"This powerful combination supports bone and cardiovascular health. Each capsule ensures optimal absorption and efficacy.\"),\n    (\"Folic Acid + B12\", 21.99, 90, \"This formula combines Folic Acid and Vitamin B12 for optimal energy and brain health. Perfect for those looking to support their cognitive function.\"),\n    (\"K2 + D3 + Calcium\", 24.99, 70, \"This comprehensive formula supports bone health with K2, D3, and Calcium. Each capsule promotes strong bones and overall wellness.\")\n]"