"products = [\n    (\"SoundWave Pro\", 129.99, 75, \"Experience exceptional sound quality with the SoundWave Pro wireless earbuds. These earbuds feature noise cancellation and a comfortable fit for all-day wear.\"),\n    (\"AeroBuds X\", 89.99, 100, \"The AeroBuds X offer a lightweight design and impressive battery life. Perfect for workouts, they stay secure while delivering rich audio.\"),\n    (\"EchoPods 3\", 99.99, 50, \"EchoPods 3 provide immersive sound with deep bass and clear treble. Their touch controls make it easy to manage your music on the go.\"),\n    (\"Harmony Beats\", 149.99, 30, \"Harmony Beats are designed for audiophiles who demand the best sound quality. With customizable sound profiles, you can tailor your listening experience.\"),\n    (\"SwiftSound Earbuds\", 79.99, 120, \"SwiftSound Earbuds are perfect for everyday use, featuring a compact design and reliable connectivity. Enjoy up to 24 hours of playback time with the charging case.\"),\n    (\"UltraBass Buds\", 109.99, 40, \"UltraBass Buds deliver powerful bass and crisp highs, making them ideal for music lovers. Their ergonomic design ensures a snug fit during any activity.\"),\n    (\"ZenBuds\", 69.99, 80, \"ZenBuds are perfect for meditation and relaxation, featuring soothing soundscapes and a comfortable fit. Enjoy a serene listening experience wherever you go.\"),\n    (\"VibeTones\", 119.99, 35, \"VibeTones offer a unique blend of style and performance, with a sleek design and high-fidelity sound. These earbuds are perfect for fashion-forward music enthusiasts.\"),\n    (\"BassBoost Pro\", 139.99, 20, \"BassBoost Pro earbuds are engineered for deep, resonant bass and clear vocals. Ideal for those who love to feel the music.\"),\n    (\"ClearSound Elite\", 159.99, 25, \"ClearSound Elite provides unmatched clarity and detail in audio playback. With adaptive noise cancellation, they are great for any environment.\"),\n    (\"MotionBuds\", 79.99, 90, \"MotionBuds are designed for active lifestyles, featuring a secure fit and sweat resistance. Enjoy your favorite tunes while working out without interruption.\"),\n    (\"SmartConnect Earbuds\", 89.99, 70, \"SmartConnect Earbuds seamlessly connect to your devices with Bluetooth 5.0. Their intuitive controls make them user-friendly for all ages.\"),\n    (\"EpicSound Pro\", 129.99, 55, \"EpicSound Pro earbuds feature high-definition sound quality and a long-lasting battery. Perfect for long commutes or intense workout sessions.\"),\n    (\"SonicWave Buds\", 99.99, 65, \"SonicWave Buds deliver rich audio and a comfortable fit, making them great for all-day wear. Their stylish design complements any outfit.\"),\n    (\"TravelBuds\", 69.99, 85, \"TravelBuds are compact and lightweight, making them the perfect companion for your journeys. Enjoy up to 20 hours of playback with the portable charging case.\"),\n    (\"GamerBuds\", 149.99, 15, \"GamerBuds are designed for immersive gaming experiences with low latency and powerful sound. Get an edge in your gameplay with these high-performance earbuds.\"),\n    (\"LifeSound Wireless\", 89.99, 60, \"LifeSound Wireless earbuds provide a balanced sound profile for all music genres. Their long battery life ensures you can enjoy your tunes all day long.\"),\n    (\"BeatsFit Pro\", 139.99, 30, \"BeatsFit Pro earbuds combine premium sound quality with a secure fit for sports enthusiasts. Enjoy dynamic audio while staying active.\"),\n    (\"WaveBuds\", 79.99, 100, \"WaveBuds feature a sleek design and excellent sound quality, perfect for casual listening. Their compact size makes them easily portable.\"),\n    (\"PulseBuds\", 99.99, 50, \"PulseBuds deliver a punchy sound experience with enhanced bass. They come with multiple ear tip sizes for a customized fit.\"),\n    (\"AirFlow Earbuds\", 129.99, 40, \"AirFlow Earbuds are engineered for comfort and breathability, making them ideal for long listening sessions. Enjoy crystal-clear sound with every note.\"),\n    (\"SoundSphere\", 109.99, 45, \"SoundSphere earbuds offer a 360-degree sound experience. With a stylish design, they are perfect for both casual and professional use.\"),\n    (\"DuraBuds\", 89.99, 80, \"DuraBuds are built to withstand the rigors of daily life, featuring a durable design and water resistance. Enjoy your music worry-free during workouts or outdoor activities.\"),\n    (\"BassWave Pro\", 149.99, 20, \"BassWave Pro earbuds are designed for bass enthusiasts, delivering deep, resonant sound. Their sleek design makes them a stylish choice for any music lover.\"),\n    (\"SoundLink Buds\", 99.99, 55, \"SoundLink Buds provide seamless connectivity and high-quality audio for all your devices. Their lightweight design ensures comfort throughout the day.\"),\n    (\"FitBuds\", 79.99, 90, \"FitBuds are perfect for fitness enthusiasts, providing a secure fit and sweat resistance. Enjoy your workout with motivating tunes without interruptions.\"),\n    (\"ChillBuds\", 69.99, 100, \"ChillBuds are designed for relaxation, featuring soothing sound profiles and a comfortable fit. Perfect for unwinding after a long day.\"),\n    (\"ProSound Buds\", 139.99, 30, \"ProSound Buds deliver studio-quality sound in a compact design. Ideal for audiophiles seeking a premium listening experience.\"),\n    (\"TechBuds\", 89.99, 75, \"TechBuds feature advanced technology for superior sound quality and easy connectivity. Their modern design makes them a great accessory for tech lovers.\"),\n    (\"Waves AirPods\", 129.99, 25, \"Waves AirPods are known for their exceptional sound quality and stylish design. Enjoy a seamless listening experience with advanced noise cancellation.\"),\n    (\"ActiveBuds\", 99.99, 50, \"ActiveBuds are designed for those on the go, featuring a secure fit and durable construction. Perfect for running, cycling, or any active lifestyle.\"),\n    (\"EchoBuds\", 79.99, 85, \"EchoBuds provide an immersive audio experience with great noise isolation. Their compact design makes them easy to carry and use anywhere.\"),\n    (\"StyleBuds\", 109.99, 40, \"StyleBuds combine fashion and function, offering a trendy design with high-quality sound. Perfect for those who want to make a statement while listening.\"),\n    (\"NexGen Buds\", 149.99, 15, \"NexGen Buds feature cutting-edge technology for an unparalleled listening experience. Enjoy rich sound with advanced noise cancellation features.\"),\n    (\"FreedomBuds\", 89.99, 70, \"FreedomBuds provide wireless convenience with a comfortable fit. Enjoy your favorite music without the hassle of tangled wires.\"),\n    (\"SonicPulse\", 99.99, 60, \"SonicPulse earbuds deliver powerful sound and a snug fit for an immersive experience. Ideal for music lovers who appreciate quality.\"),\n    (\"UltraComfort Buds\", 129.99, 30, \"UltraComfort Buds are designed for extended wear without discomfort. Their soft ear tips and lightweight design make them perfect for long listening sessions.\"),\n    (\"FusionBuds\", 79.99, 90, \"FusionBuds combine style and performance, offering a sleek design and great sound quality. Enjoy your music in style, wherever you go.\"),\n    (\"EpicBuds\", 139.99, 20, \"EpicBuds deliver an epic sound experience with enhanced bass and clarity. Perfect for enjoying your favorite tracks or podcasts.\"),\n    (\"SmartFit Earbuds\", 89.99, 50, \"SmartFit Earbuds automatically adjust to your ear shape for maximum comfort. Enjoy a personalized listening experience with every use.\"),\n    (\"TechSound Buds\", 109.99, 45, \"TechSound Buds feature advanced sound technology for crisp audio and deep bass. Ideal for both casual listening and immersive experiences.\"),\n    (\"VibePods\", 99.99, 55, \"VibePods offer a unique sound experience with customizable audio settings. Perfect for music lovers who want to tailor their listening.\"),\n    (\"AirBuds Pro\", 149.99, 25, \"AirBuds Pro provide premium sound quality with a comfortable fit. Their sleek design and advanced features make them a top choice for audiophiles.\"),\n    (\"SoundMax\", 79.99, 80, \"SoundMax earbuds deliver excellent sound quality at an affordable price. Perfect for everyday use, they are both stylish and functional.\"),\n    (\"BassBlaster Buds\", 139.99, 15, \"BassBlaster Buds are designed for bass enthusiasts, delivering powerful sound and a secure fit. Experience deep, resonant bass like never before.\"),\n    (\"Harmony Buds\", 89.99, 70, \"Harmony Buds feature a balanced sound profile, making them suitable for all music genres. Enjoy comfort and quality in one sleek package.\"),\n    (\"FlexBuds\", 99.99, 50, \"FlexBuds are designed for an active lifestyle, featuring a flexible design that stays in place during workouts. Enjoy your favorite tunes without interruption.\"),\n    (\"SonicBoom\", 129.99, 30, \"SonicBoom earbuds deliver explosive sound quality and a comfortable fit. Perfect for music lovers who want to feel every beat.\"),\n    (\"TrueWireless Buds\", 109.99, 40, \"TrueWireless Buds offer a completely wireless experience with great sound quality. Their compact design makes them easy to carry on the go.\"),\n    (\"SoundLink Pro\", 99.99, 60, \"SoundLink Pro earbuds provide high-quality audio with seamless connectivity. Ideal for both casual and professional use.\"),\n    (\"GamerPro Buds\", 149.99, 20, \"GamerPro Buds are engineered for gamers, offering low latency and immersive sound. Gain a competitive edge with these high-performance earbuds.\"),\n    (\"BassFiend Buds\", 79.99, 90, \"BassFiend Buds are perfect for bass lovers, delivering deep sound and a secure fit. Enjoy your music with powerful bass wherever you go.\"),\n    (\"AirPods Lite\", 69.99, 100, \"AirPods Lite offer a lightweight design and decent sound quality for everyday use. Perfect for those who want reliable performance without breaking the bank.\"),\n    (\"WaveSound\", 109.99, 45, \"WaveSound earbuds provide a balanced sound profile with a comfortable fit. Ideal for enjoying music, podcasts, or audiobooks.\"),\n    (\"EpicFit Buds\", 129.99, 30, \"EpicFit Buds are designed for athletes, offering a secure fit and sweat resistance. Enjoy your workouts with motivating music.\"),\n    (\"SoundCore Buds\", 89.99, 70, \"SoundCore Buds deliver impressive sound quality and a comfortable fit. Perfect for long listening sessions without discomfort.\"),\n    (\"ActiveSound\", 99.99, 50, \"ActiveSound earbuds are built for an active lifestyle, providing a secure fit and durable design. Enjoy your favorite tracks while staying active.\"),\n    (\"ChillSound Buds\", 69.99, 100, \"ChillSound Buds are perfect for relaxation, featuring soothing sound profiles and a lightweight design. Ideal for unwinding after a long day.\"),\n    (\"VibeMax\", 79.99, 90, \"VibeMax earbuds deliver a powerful audio experience with a stylish design. Perfect for music lovers who want both quality and aesthetics.\"),\n    (\"TechWave Buds\", 89.99, 70, \"TechWave Buds feature advanced connectivity and high-quality sound for an optimal listening experience. Ideal for tech enthusiasts.\"),\n    (\"SonicAir\", 129.99, 25, \"SonicAir earbuds provide premium sound quality and a comfortable fit. Perfect for audiophiles who want the best listening experience.\"),\n    (\"FitSound Pro\", 139.99, 15, \"FitSound Pro earbuds are designed for fitness enthusiasts, offering a secure fit and great sound quality. Enjoy your music while pushing your limits.\"),\n    (\"PulseFit Buds\", 99.99, 50, \"PulseFit Buds are perfect for workouts, providing a secure fit and sweat resistance. Enjoy your favorite tracks without interruptions.\"),\n    (\"EchoFit\", 79.99, 80, \"EchoFit earbuds deliver clear sound and a comfortable fit for active lifestyles. Perfect for running, cycling, or gym sessions.\"),\n    (\"WaveRider Buds\", 89.99, 60, \"WaveRider Buds feature a sleek design and great sound quality. Ideal for casual listening or on-the-go music enjoyment.\"),\n    (\"FusionSound\", 109.99, 40, \"FusionSound earbuds offer a unique blend of style and performance. Experience high-quality audio in a fashionable package.\"),\n    (\"SmartSound Buds\", 99.99, 50, \"SmartSound Buds feature intuitive controls and great sound quality. Perfect for anyone looking for convenience and performance.\"),\n    (\"ActiveBass\", 139.99, 20, \"ActiveBass earbuds are designed for deep bass lovers, providing powerful sound and a secure fit. Ideal for enjoying music during workouts.\"),\n    (\"SoundSphere Pro\", 129.99, 25, \"SoundSphere Pro earbuds deliver an immersive audio experience with rich sound. Perfect for audiophiles seeking quality.\"),\n    (\"TechBuds Lite\", 69.99, 100, \"TechBuds Lite offer a budget-friendly option with decent sound quality. Perfect for everyday use without compromising style.\"),\n    (\"EpicWave\", 109.99, 45, \"EpicWave earbuds provide a powerful sound experience with a stylish design. Enjoy your music with clarity and depth.\"),\n    (\"SonicFit Buds\", 99.99, 50, \"SonicFit Buds are designed for active lifestyles, offering a secure fit and great sound quality. Perfect for workouts or daily commutes.\"),\n    (\"UltraSound Buds\", 129.99, 30, \"UltraSound Buds deliver premium sound quality with a comfortable fit. Ideal for long listening sessions without discomfort.\"),\n    (\"ChillWave\", 79.99, 90, \"ChillWave earbuds are perfect for relaxation, featuring soothing sound profiles. Enjoy your favorite music or podcasts in comfort.\"),\n    (\"BassBuds\", 89.99, 70, \"BassBuds provide a rich audio experience with deep bass. Perfect for music lovers who appreciate quality sound.\"),\n    (\"SoundFlex\", 99.99, 60, \"SoundFlex earbuds offer a flexible design for a comfortable fit. Enjoy high-quality audio while on the move.\"),\n    (\"AirBuds Lite Pro\", 149.99, 20, \"AirBuds Lite Pro provide premium sound quality in a lightweight design. Perfect for audiophiles who want portability without sacrificing quality.\"),\n    (\"FitWave\", 79.99, 100, \"FitWave earbuds are designed for fitness enthusiasts, providing a secure fit and great sound. Ideal for workouts or outdoor activities.\"),\n    (\"TechSync Buds\", 109.99, 40, \"TechSync Buds feature advanced connectivity and high-quality sound. Perfect for tech-savvy users who value performance.\"),\n    (\"EpicSound Lite\", 69.99, 90, \"EpicSound Lite earbuds offer a budget-friendly option with decent sound quality. Perfect for everyday use without breaking the bank.\"),\n    (\"SoundMax Pro\", 129.99, 25, \"SoundMax Pro earbuds deliver exceptional sound quality and a comfortable fit. Ideal for long listening sessions.\"),\n    (\"WaveFit Buds\", 99.99, 50, \"WaveFit Buds are designed for active lifestyles, providing a secure fit and great sound quality. Perfect for workouts or daily commutes.\"),\n    (\"FusionFit\", 89.99, 70, \"FusionFit earbuds combine style and performance, offering a trendy design and high-quality sound. Perfect for those who want to make a statement.\"),\n    (\"SonicBuds Pro\", 139.99, 15, \"SonicBuds Pro deliver studio-quality sound in a compact design. Ideal for audiophiles seeking a premium listening experience.\")\n]"